// BlueprintGeneratedClass BP_Building_Base.BP_Building_Base_C
// Size: 0x9c8 (Inherited: 0x3c0)
struct ABP_Building_Base_C : ABuildingBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3c0(0x08)
	struct UAudioContextComponent* AudioContext; // 0x3c8(0x08)
	struct USceneComponent* SecondOutsideTestLocation; // 0x3d0(0x08)
	struct UDestructibleComponent* Stripped_DestructibleMesh; // 0x3d8(0x08)
	struct UDestructibleComponent* Main_DestructibleMesh; // 0x3e0(0x08)
	struct UStaticMeshComponent* Stripped_BuildingMesh; // 0x3e8(0x08)
	struct UNavModifierComponent* NavModifier; // 0x3f0(0x08)
	struct UStaticMeshComponent* Main_BuildingShadowMesh; // 0x3f8(0x08)
	struct URadialForceComponent* RadialForce; // 0x400(0x08)
	struct USceneComponent* FireEffects; // 0x408(0x08)
	struct UArrowComponent* PlacementArrow; // 0x410(0x08)
	struct USceneComponent* PlacementHelpers; // 0x418(0x08)
	struct UStaticMeshComponent* FoilageCuller; // 0x420(0x08)
	struct UArrowComponent* Arrow3; // 0x428(0x08)
	struct UArrowComponent* Arrow2; // 0x430(0x08)
	struct UArrowComponent* Arrow1; // 0x438(0x08)
	struct UTextRenderComponent* rotdebug; // 0x440(0x08)
	struct UArrowComponent* DebugArrows; // 0x448(0x08)
	struct UTextRenderComponent* Debug; // 0x450(0x08)
	struct UStaticMeshComponent* Main_BuildingMesh; // 0x458(0x08)
	struct UBoxComponent* Box11; // 0x460(0x08)
	struct UBoxComponent* Box01; // 0x468(0x08)
	struct UBoxComponent* Box10; // 0x470(0x08)
	struct UBoxComponent* Box00; // 0x478(0x08)
	struct USceneComponent* CollisionTesting; // 0x480(0x08)
	struct USceneComponent* Center; // 0x488(0x08)
	struct TArray<struct FVectorPair> BlockingLinesArray; // 0x490(0x10)
	float GridSize; // 0x4a0(0x04)
	struct FVector GridLocation; // 0x4a4(0x0c)
	struct ABP_Grid_Base_C* ParentGrid; // 0x4b0(0x08)
	float Health; // 0x4b8(0x04)
	float MaxAnchoredStability; // 0x4bc(0x04)
	float AnchoredStability; // 0x4c0(0x04)
	float StabilityPassMultiplier; // 0x4c4(0x04)
	bool Dirtied; // 0x4c8(0x01)
	char pad_4C9[0x7]; // 0x4c9(0x07)
	struct TArray<struct ABP_Building_Base_C*> CheckedBuildingsCache; // 0x4d0(0x10)
	struct UMaterialInterface* debugMatCache; // 0x4e0(0x08)
	struct UStaticMeshComponent* MeshCache; // 0x4e8(0x08)
	bool Debugging; // 0x4f0(0x01)
	char pad_4F1[0x3]; // 0x4f1(0x03)
	int32_t HardStabilityMaxRange; // 0x4f4(0x04)
	struct TMap<struct ABP_Building_Base_C*, float> HardStabilityMap; // 0x4f8(0x50)
	float SoftStability; // 0x548(0x04)
	float MaxHardStability; // 0x54c(0x04)
	struct FTimerHandle CrackTimer; // 0x550(0x08)
	float CrackUpdateTime; // 0x558(0x04)
	struct FVectorSpringState ShakeSpring; // 0x55c(0x18)
	struct FVector ShakeTarget; // 0x574(0x0c)
	float LastHardStabilityCheck; // 0x580(0x04)
	char pad_584[0x4]; // 0x584(0x04)
	struct TArray<struct ABP_Building_Base_C*> CachedAffectedBuildings; // 0x588(0x10)
	bool MagicAnchor; // 0x598(0x01)
	char pad_599[0x7]; // 0x599(0x07)
	struct FTimerHandle CollapseTimer; // 0x5a0(0x08)
	struct FRotator GridSpaceRotation; // 0x5a8(0x0c)
	struct FVector GridSpaceCenterLocation; // 0x5b4(0x0c)
	bool CachedRotateCentersUpToHitNormal; // 0x5c0(0x01)
	char pad_5C1[0x7]; // 0x5c1(0x07)
	struct TArray<struct ABP_Building_Base_C*> RemoteAnchorStabilityBuilding; // 0x5c8(0x10)
	struct FVector MeshStartingRelitiveLocation; // 0x5d8(0x0c)
	bool BlockLikePlacement; // 0x5e4(0x01)
	char pad_5E5[0x3]; // 0x5e5(0x03)
	float StraightTracePlacementRange; // 0x5e8(0x04)
	float ForwardThenDownTraceRange; // 0x5ec(0x04)
	struct UMaterialInstanceDynamic* DynamicCrackMatInst; // 0x5f0(0x08)
	struct UCurveFloat* CrackAmountCurve; // 0x5f8(0x08)
	struct FTimerHandle VeryUnstableEffectsTime; // 0x600(0x08)
	struct UDestructibleMesh* DestructibleMesh; // 0x608(0x08)
	struct FString debugAnchorStabs; // 0x610(0x10)
	float LastPushAnchorStability; // 0x620(0x04)
	char pad_624[0x4]; // 0x624(0x04)
	struct FTimerHandle DirtyTickTimer; // 0x628(0x08)
	struct UCurveFloat* DestructibleOcclusionCurve; // 0x630(0x08)
	bool TempStability; // 0x638(0x01)
	char pad_639[0x7]; // 0x639(0x07)
	struct FMulticastInlineDelegate BuildingDestroyed; // 0x640(0x10)
	float DebugUnclampedHardStability; // 0x650(0x04)
	bool Destroyed; // 0x654(0x01)
	char pad_655[0x3]; // 0x655(0x03)
	struct TArray<struct UBP_Weight_C*> Weights; // 0x658(0x10)
	float DesiredCrackLevel; // 0x668(0x04)
	float CurrentCrackLevel; // 0x66c(0x04)
	struct UMaterialInterface* DefaultSlot0Material; // 0x670(0x08)
	struct TArray<struct UMaterialInterface*> DefaultMainMeshMaterials; // 0x678(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> InstancedMainMeshMaterials; // 0x688(0x10)
	struct FBuildableRowHandle BuildableRow; // 0x698(0x18)
	float HitProcessingRadiusThreshold; // 0x6b0(0x04)
	bool ClientsideGhost; // 0x6b4(0x01)
	bool ShowPlacementHelpers; // 0x6b5(0x01)
	char pad_6B6[0x2]; // 0x6b6(0x02)
	struct FFMODEventInstance StressDamageAudioEventInstance; // 0x6b8(0x08)
	bool StabilityAudioEnabled; // 0x6c0(0x01)
	char pad_6C1[0x3]; // 0x6c1(0x03)
	struct FVector BuildingGridFootprint; // 0x6c4(0x0c)
	bool ClampHitNormalToUpOrDown; // 0x6d0(0x01)
	char pad_6D1[0x3]; // 0x6d1(0x03)
	struct FRotator CachedCenterWorldRotation; // 0x6d4(0x0c)
	bool OnFire; // 0x6e0(0x01)
	bool GhostBlockedPlacement; // 0x6e1(0x01)
	char pad_6E2[0x2]; // 0x6e2(0x02)
	float GhostActorViewDistance; // 0x6e4(0x04)
	struct FMulticastInlineDelegate BuildingReplaced; // 0x6e8(0x10)
	struct FVector OutsideTestPushoutAmount; // 0x6f8(0x0c)
	bool ReceivingWindDamage; // 0x704(0x01)
	char pad_705[0x3]; // 0x705(0x03)
	struct FTimerHandle WindDamageTimer; // 0x708(0x08)
	struct FTimerHandle WindParticleSystemSlowTimer; // 0x710(0x08)
	float BaseDamageFromWind; // 0x718(0x04)
	char pad_71C[0x4]; // 0x71c(0x04)
	struct TArray<struct FDestructionPoints> DestructibleDamagedPoints; // 0x720(0x10)
	int32_t WindDamageProcessedIndex; // 0x730(0x04)
	bool FullyStripped; // 0x734(0x01)
	char pad_735[0x3]; // 0x735(0x03)
	struct UDestructibleMesh* StrippedDestructibleMesh; // 0x738(0x08)
	struct UStaticMesh* StrippedStaticMesh; // 0x740(0x08)
	float CollisionDamageImpulseScalar; // 0x748(0x04)
	bool Stripping; // 0x74c(0x01)
	char pad_74D[0x3]; // 0x74d(0x03)
	struct FBuildableAudioData AudioData; // 0x750(0x160)
	struct FFMODEventInstance WindDamageAudioEventInstance; // 0x8b0(0x08)
	struct FVector2D DamageSoundCooldownRange; // 0x8b8(0x08)
	struct FVector2D DestructibleDamageSoundCooldownRange; // 0x8c0(0x08)
	float DamageSoundCooldownEndTime; // 0x8c8(0x04)
	float DestructibleDamageSoundCooldownEndTime; // 0x8cc(0x04)
	struct UStaticMesh* Main_BuildingStaticMesh; // 0x8d0(0x08)
	bool ShouldOptionallyRotateCenterUptoInpactNormal; // 0x8d8(0x01)
	char pad_8D9[0x3]; // 0x8d9(0x03)
	struct FVector NewGridPlacementOffset; // 0x8dc(0x0c)
	struct UStaticMesh* Main_BuildingShadowGeoMesh; // 0x8e8(0x08)
	struct UBP_WeatherAudioComponent_BuildingWindDamage_C* WindDamageWeatherAudio; // 0x8f0(0x08)
	struct UNavArea* BuildingNavAreaClass; // 0x8f8(0x08)
	bool SupportedByGround; // 0x900(0x01)
	char pad_901[0x3]; // 0x901(0x03)
	float LowestGreenStability; // 0x904(0x04)
	float YellowStability; // 0x908(0x04)
	float HighestRedStability; // 0x90c(0x04)
	bool FirstStabilityCalced; // 0x910(0x01)
	char pad_911[0x3]; // 0x911(0x03)
	float MinimumUnstableStability; // 0x914(0x04)
	int32_t SoftHeightLimit; // 0x918(0x04)
	int32_t DistanceToGround; // 0x91c(0x04)
	struct TArray<struct FWeightTransferRelationship> DirectWeightRelationships; // 0x920(0x10)
	struct TArray<struct FWeightTransferRelationship> IndirectWeightDistributed; // 0x930(0x10)
	struct TArray<struct FWeightTransferRelationship> IndirectWeightReceived; // 0x940(0x10)
	struct FTimerHandle WeightUnstableTimer; // 0x950(0x08)
	struct FTimerHandle WeightUnstableActiveDestruction; // 0x958(0x08)
	float CrackSizeDivisor; // 0x960(0x04)
	enum class EBuildingOpenableState OpenableState; // 0x964(0x01)
	char pad_965[0x3]; // 0x965(0x03)
	struct FMulticastInlineDelegate OpenableStateChanged; // 0x968(0x10)
	float BuildingTier; // 0x978(0x04)
	bool ManualWindDamagePeriod; // 0x97c(0x01)
	char pad_97D[0x3]; // 0x97d(0x03)
	float CurrentWindDamageTimerTime; // 0x980(0x04)
	char pad_984[0x4]; // 0x984(0x04)
	struct UCurveFloat* StormToBuildingInteractionCurve; // 0x988(0x08)
	float BaseWindDamagePointRadius; // 0x990(0x04)
	float BaseWindDamagePointImpusle; // 0x994(0x04)
	bool RecentlyRepaired; // 0x998(0x01)
	bool IsAsyncResettingDM; // 0x999(0x01)
	char pad_99A[0x6]; // 0x99a(0x06)
	struct UCurveFloat* HealthToDestructionPointCount; // 0x9a0(0x08)
	struct UCurveFloat* HealthToDestructionImpulseStrength; // 0x9a8(0x08)
	int32_t EffectiveDestructionPointCount; // 0x9b0(0x04)
	bool UseDMmaterialMap; // 0x9b4(0x01)
	char pad_9B5[0x3]; // 0x9b5(0x03)
	struct TArray<int32_t> DestructibleMaterialSlotsMappedToMainMesh; // 0x9b8(0x10)

	float GetOcclusionValue(); // Function BP_Building_Base.BP_Building_Base_C.GetOcclusionValue // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x1a05090
	void AttemptToResetMaterialsOnDestructibleMesh(); // Function BP_Building_Base.BP_Building_Base_C.AttemptToResetMaterialsOnDestructibleMesh // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void AttemptToApplyDynamicMaterialsOnDestructibleMesh(); // Function BP_Building_Base.BP_Building_Base_C.AttemptToApplyDynamicMaterialsOnDestructibleMesh // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void HealthToDestruction(); // Function BP_Building_Base.BP_Building_Base_C.HealthToDestruction // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
