// BlueprintGeneratedClass BP_Tree_DC_TreeDead_04.BP_Tree_DC_TreeDead_04_C
// Size: 0x590 (Inherited: 0x4b8)
struct ABP_Tree_DC_TreeDead_04_C : ABP_TreePrefab_C {
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B9_B2_B1; // 0x4b8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B9_B2; // 0x4c0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B9_B1_B1; // 0x4c8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B9_B1; // 0x4d0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B9; // 0x4d8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B8_B2; // 0x4e0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B8; // 0x4e8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B7_B3; // 0x4f0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B7_B2; // 0x4f8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B7; // 0x500(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B6_B2; // 0x508(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B6_B1; // 0x510(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B6; // 0x518(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B5_B2; // 0x520(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B5; // 0x528(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B4_B2; // 0x530(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B4; // 0x538(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B3_B2; // 0x540(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B3_B1; // 0x548(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B3; // 0x550(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B2_B2; // 0x558(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B2; // 0x560(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B1_B2; // 0x568(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B1_B1; // 0x570(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1_B1; // 0x578(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R_T1; // 0x580(0x08)
	struct UStaticMeshComponent* DC_TreeDead_04_R; // 0x588(0x08)
};

