// BlueprintGeneratedClass BP_Tree_LC_TreeBurnt_02.BP_Tree_LC_TreeBurnt_02_C
// Size: 0x578 (Inherited: 0x4b8)
struct ABP_Tree_LC_TreeBurnt_02_C : ABP_TreePrefab_C {
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_T1_T1_B1_B2; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_T1_T1_B1_B1; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_T1_T1_B1; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_T1_T1; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_T1_B2; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_T1_B1_B4; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_T1_B1_B3; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_T1_B1_B2; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_T1_B1_B1; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_T1_B1; // 0x500(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_T1; // 0x508(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_B1_B3; // 0x510(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_B1_B2; // 0x518(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_B1_B1; // 0x520(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1_B1; // 0x528(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_T1; // 0x530(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_B3; // 0x538(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_B2_B1; // 0x540(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_B2; // 0x548(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_B1_B1; // 0x550(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1_B1; // 0x558(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1_T1; // 0x560(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R_T1; // 0x568(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_02_R; // 0x570(0x08)
};

