// UserDefinedStruct FBiomeWeather.FBiomeWeather
// Size: 0x3c (Inherited: 0x00)
struct FFBiomeWeather {
	float Rain_2_4215F1E24A1B7F2DB6DE5CAA95B88EF1; // 0x00(0x04)
	float Sand_4_F007AF4D497E6F81610AE8BCE3D1BCEA; // 0x04(0x04)
	float Snow_6_B2F655E948954D61AD527D9A315E350D; // 0x08(0x04)
	float Cloudy_8_F7AB22894B670C939BBBEEA1CB61C8CE; // 0x0c(0x04)
	float Thunder_10_87E7B29C4596ECEA8C085E8EA28C835D; // 0x10(0x04)
	float SnowStorm_12_3F5EE710494CD21EDAB376BF3C0054C1; // 0x14(0x04)
	float TemperatureModifier_15_376FBFA34E2482EB0CCF1FA99E281385; // 0x18(0x04)
	struct FVector WindDirection_23_C15FE35E4BEE54BBEA90F9BACE5BA9AB; // 0x1c(0x0c)
	float WindDirectionStrength_35_09FF17C541D960DD81CCC493FEFB424E; // 0x28(0x04)
	float WindSpeed_26_EACEE2B441162C08FC12A5897D0D40CB; // 0x2c(0x04)
	float WindStrength_28_CDADD5A244ABA260C466D7AE39519B1A; // 0x30(0x04)
	float WindMaxGustAmount_30_BCE2AD434E4BA1A8D5973CA28A16DFAE; // 0x34(0x04)
	float WindMinGustAmount_32_FF81CCCF45B378F251F2A8A5F9D40EBF; // 0x38(0x04)
};

