// UserDefinedStruct FWTSplineMesh.FWTSplineMesh
// Size: 0xa8 (Inherited: 0x00)
struct FFWTSplineMesh {
	struct UStaticMesh* Mesh_4_2A0E4FD142090E53C0B330BA46F04410; // 0x00(0x08)
	enum class ESplineMeshAxis ForwardAxis_23_A275D71B4400CF79A1E0FFAC86DBD5F4; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
	struct FTransform Transform_40_790F5E824A2572D1613AEAA6F3114449; // 0x10(0x30)
	struct FVector StartPos_28_2AD051184A14895E95285F8D1C5EA411; // 0x40(0x0c)
	struct FVector StartTangent_30_5AF5FD284B93740E2BB61BACC27C6A28; // 0x4c(0x0c)
	struct FVector EndPos_31_03ED917E403A58C17FF11885BE03F25A; // 0x58(0x0c)
	struct FVector EndTangent_32_74301EB1469C4583CC226EA7A96C9793; // 0x64(0x0c)
	struct FVector2D StartScale_35_179ED05144B0528E0FE1B3BA813D3906; // 0x70(0x08)
	struct FVector2D EndScale_37_A5CB16FC46F92BEDD0090792929F3CE3; // 0x78(0x08)
	float StartRoll_45_95966E7C44A16B1525F86697ACD0FFAD; // 0x80(0x04)
	float EndRoll_46_23A3E4DE475AAD4FFF5F4E87302A5036; // 0x84(0x04)
	struct FVector UpDirection_53_2B30DB6B483A0786922B4AA00F291F70; // 0x88(0x0c)
	bool IsVisible_50_2414C60641197DA5B95AF4880216AD9B; // 0x94(0x01)
	char pad_95[0x3]; // 0x95(0x03)
	float CustomPrimitiveData0_56_708842E9436E2AA37BF384A7D66E0F57; // 0x98(0x04)
	bool CastShadow_58_F97B09C84241FD670940A8A64D8EC596; // 0x9c(0x01)
	char pad_9D[0x3]; // 0x9d(0x03)
	struct FName OverrideCollisionProfile_64_9ED1EA884FAFC3ED0D8B8E9EE5085AA2; // 0xa0(0x08)
};

