// ControlRigBlueprintGeneratedClass SK_DPS_Respawn_Pod_CtrlRig.SK_DPS_Respawn_Pod_CtrlRig_C
// Size: 0x67c (Inherited: 0x650)
struct USK_DPS_Respawn_Pod_CtrlRig_C : UControlRig {
	struct FVector Trace_Length; // 0x650(0x0c)
	float Trace_Offset; // 0x65c(0x04)
	float Floor_Leg1_H; // 0x660(0x04)
	float DoorOpenPosition; // 0x664(0x04)
	float Floor_Leg2_H; // 0x668(0x04)
	float Floor_Leg3_H; // 0x66c(0x04)
	float Floor_Leg4_H; // 0x670(0x04)
	float HeightVOffset; // 0x674(0x04)
	float HeightHOffset; // 0x678(0x04)
};

