// WidgetBlueprintGeneratedClass UMG_AudioWaveform.UMG_AudioWaveform_C
// Size: 0x2d8 (Inherited: 0x260)
struct UUMG_AudioWaveform_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* WaveformVisualizer; // 0x268(0x08)
	struct UImage* AudioBar1; // 0x270(0x08)
	struct UImage* AudioBar1_2; // 0x278(0x08)
	struct UImage* AudioBar1_3; // 0x280(0x08)
	struct UImage* AudioBar1_4; // 0x288(0x08)
	struct UImage* AudioBar1_5; // 0x290(0x08)
	struct UImage* AudioBar1_6; // 0x298(0x08)
	struct UImage* AudioBar1_7; // 0x2a0(0x08)
	struct UImage* AudioBar1_8; // 0x2a8(0x08)
	struct UImage* AudioBar1_9; // 0x2b0(0x08)
	struct UImage* AudioBar1_10; // 0x2b8(0x08)
	struct UImage* AudioBar1_11; // 0x2c0(0x08)
	struct UImage* BaseImage; // 0x2c8(0x08)
	struct UImage* PlayIcon; // 0x2d0(0x08)

	void Construct(); // Function UMG_AudioWaveform.UMG_AudioWaveform_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1a05090
	void ExecuteUbergraph_UMG_AudioWaveform(int32_t EntryPoint); // Function UMG_AudioWaveform.UMG_AudioWaveform_C.ExecuteUbergraph_UMG_AudioWaveform // (Final|UbergraphFunction) // @ game+0x1a05090
};

