// WidgetBlueprintGeneratedClass UMG_AnnouncementScreen.UMG_AnnouncementScreen_C
// Size: 0x358 (Inherited: 0x260)
struct UUMG_AnnouncementScreen_C : UUserWidget {
	struct UTextBlock* AnnounceDate; // 0x260(0x08)
	struct UTextBlock* AnnounceDate_2; // 0x268(0x08)
	struct UTextBlock* AnnounceDate_3; // 0x270(0x08)
	struct UTextBlock* AnnounceDate_4; // 0x278(0x08)
	struct UTextBlock* AnnounceDate_5; // 0x280(0x08)
	struct UTextBlock* AnnounceDate_6; // 0x288(0x08)
	struct UImage* AnnouncementBGImage; // 0x290(0x08)
	struct UImage* AnnouncementBGImage_2; // 0x298(0x08)
	struct UImage* AnnouncementBGImage_3; // 0x2a0(0x08)
	struct UImage* AnnouncementBGImage_4; // 0x2a8(0x08)
	struct UImage* AnnouncementBGImage_5; // 0x2b0(0x08)
	struct UImage* AnnouncementBGImage_6; // 0x2b8(0x08)
	struct UTextBlock* AnnounceSubtitle; // 0x2c0(0x08)
	struct UTextBlock* AnnounceSubtitle_2; // 0x2c8(0x08)
	struct UTextBlock* AnnounceSubtitle_3; // 0x2d0(0x08)
	struct UTextBlock* AnnounceSubtitle_4; // 0x2d8(0x08)
	struct UTextBlock* AnnounceSubtitle_5; // 0x2e0(0x08)
	struct UTextBlock* AnnounceSubtitle_6; // 0x2e8(0x08)
	struct UTextBlock* AnnounceText; // 0x2f0(0x08)
	struct UTextBlock* AnnounceText_2; // 0x2f8(0x08)
	struct UTextBlock* AnnounceText_3; // 0x300(0x08)
	struct UTextBlock* AnnounceText_4; // 0x308(0x08)
	struct UTextBlock* AnnounceText_5; // 0x310(0x08)
	struct UTextBlock* AnnounceText_6; // 0x318(0x08)
	struct UTextBlock* AnnounceTitle; // 0x320(0x08)
	struct UTextBlock* AnnounceTitle_2; // 0x328(0x08)
	struct UTextBlock* AnnounceTitle_3; // 0x330(0x08)
	struct UTextBlock* AnnounceTitle_4; // 0x338(0x08)
	struct UTextBlock* AnnounceTitle_5; // 0x340(0x08)
	struct UTextBlock* AnnounceTitle_6; // 0x348(0x08)
	struct UImage* Image_1; // 0x350(0x08)
};

