// BlueprintGeneratedClass BP_ActionableBehaviour_Firearm.BP_ActionableBehaviour_Firearm_C
// Size: 0x984 (Inherited: 0x2c0)
struct UBP_ActionableBehaviour_Firearm_C : UActionableBehaviour {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct AIcarusActor* OwningActor; // 0x2c8(0x08)
	struct ABP_IcarusPlayerCharacterSurvival_C* OwningPlayer; // 0x2d0(0x08)
	int32_t LocalCurrentAmmo; // 0x2d8(0x04)
	char pad_2DC[0x4]; // 0x2dc(0x04)
	struct FFirearmData FirearmData; // 0x2e0(0x598)
	bool CanFireSemiAuto; // 0x878(0x01)
	bool Reloading; // 0x879(0x01)
	char pad_87A[0x6]; // 0x87a(0x06)
	struct FTimerHandle ReloadTimer; // 0x880(0x08)
	bool Firing; // 0x888(0x01)
	char pad_889[0x7]; // 0x889(0x07)
	struct FTimerHandle FireCheckHandle; // 0x890(0x08)
	float FireTime; // 0x898(0x04)
	float AimAlpha; // 0x89c(0x04)
	bool RadialOpen; // 0x8a0(0x01)
	char pad_8A1[0x3]; // 0x8a1(0x03)
	int32_t ReloadAmount; // 0x8a4(0x04)
	float ChargePower; // 0x8a8(0x04)
	float LastChargePower; // 0x8ac(0x04)
	float FullChargePowerTimeStamp; // 0x8b0(0x04)
	bool LocalChargeCancel; // 0x8b4(0x01)
	char pad_8B5[0x3]; // 0x8b5(0x03)
	struct UMatineeCameraShake* CameraShake; // 0x8b8(0x08)
	struct TArray<struct UObject*> LoadedAssets; // 0x8c0(0x10)
	bool AssetsLoaded; // 0x8d0(0x01)
	char pad_8D1[0x3]; // 0x8d1(0x03)
	struct FItemsStaticRowHandle LocalAmmoType; // 0x8d4(0x18)
	char pad_8EC[0x4]; // 0x8ec(0x04)
	struct AIcarusItem* PreviewItem; // 0x8f0(0x08)
	bool FireAnimPlaying; // 0x8f8(0x01)
	char pad_8F9[0x7]; // 0x8f9(0x07)
	struct FMulticastInlineDelegate ProjectileFired; // 0x900(0x10)
	struct TMap<struct UFMODAudioComponent*, struct FFirearmSoundData> PersistentAudioComponents; // 0x910(0x50)
	bool StaminaUsed; // 0x960(0x01)
	char pad_961[0x3]; // 0x961(0x03)
	struct FName QuickbarInventoryActionId; // 0x964(0x08)
	struct FName BackpackInventoryActionId; // 0x96c(0x08)
	char pad_974[0x4]; // 0x974(0x04)
	struct UContextMenuWidget* CurrentContextMenu; // 0x978(0x08)
	int32_t HoldModifierUID; // 0x980(0x04)

	struct FRotator ApplySpread(struct FRotator BaseAim); // Function BP_ActionableBehaviour_Firearm.BP_ActionableBehaviour_Firearm_C.ApplySpread // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void RemoveHoldModifier(); // Function BP_ActionableBehaviour_Firearm.BP_ActionableBehaviour_Firearm_C.RemoveHoldModifier // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void AddHoldModifier(); // Function BP_ActionableBehaviour_Firearm.BP_ActionableBehaviour_Firearm_C.AddHoldModifier // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void PlayUseWhenBrokenSound(); // Function BP_ActionableBehaviour_Firearm.BP_ActionableBehaviour_Firearm_C.PlayUseWhenBrokenSound // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
