// BlueprintGeneratedClass BP_IcarusPlayerCharacterSurvival.BP_IcarusPlayerCharacterSurvival_C
// Size: 0x1168 (Inherited: 0xb20)
struct ABP_IcarusPlayerCharacterSurvival_C : AIcarusPlayerCharacterSurvival {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xb20(0x08)
	struct UBP_UIProjectionComponent_Player_C* BP_UIProjectionComponent_Player; // 0xb28(0x08)
	struct UBP_Flammable_Player_C* BP_Flammable_Player; // 0xb30(0x08)
	struct UAudioOcclusionComponent* AudioOcclusion; // 0xb38(0x08)
	struct UBP_ItemManipulationComponent_C* BP_ItemManipulationComponent; // 0xb40(0x08)
	struct USphereComponent* WeightCollider; // 0xb48(0x08)
	struct USphereComponent* AudioCollider; // 0xb50(0x08)
	struct UPostProcessComponent* PostProcess_EnterWater; // 0xb58(0x08)
	struct UPostProcessComponent* PostProcess_OutOfWater; // 0xb60(0x08)
	struct UBP_PlayerMusicComponent_C* BP_PlayerMusicComponent; // 0xb68(0x08)
	struct UNiagaraComponent* UnderwaterFX; // 0xb70(0x08)
	struct UStaticMeshComponent* UnderwaterVolume; // 0xb78(0x08)
	struct UBP_PlayerMovementAudioComponent_C* BP_PlayerMovementAudioComponent; // 0xb80(0x08)
	struct UExperienceComponent* Experience; // 0xb88(0x08)
	struct USceneComponent* NameMarkerLocation; // 0xb90(0x08)
	struct UBP_PlayerBuildingPlacement_C* BP_PlayerBuildingPlacement; // 0xb98(0x08)
	struct UChildActorComponent* BP_RVT_FoliagePersistant; // 0xba0(0x08)
	struct UBP_PlayerEnvironmentalAudioComponent_C* BP_PlayerEnvironmentalAudioComponent; // 0xba8(0x08)
	struct UPostProcessComponent* PostProcess_Water; // 0xbb0(0x08)
	struct UPostProcessComponent* PostProcess_Cold; // 0xbb8(0x08)
	struct UPostProcessComponent* PostProcess_Heat; // 0xbc0(0x08)
	struct UPostProcessComponent* PostProcess_Thermal; // 0xbc8(0x08)
	struct UBP_ShelteredComponent_C* BP_ShelteredComponent; // 0xbd0(0x08)
	struct UBP_GroundSurfaceChecker_C* BP_GroundSurfaceChecker; // 0xbd8(0x08)
	struct USkeletalMeshComponent* TPMeshFull; // 0xbe0(0x08)
	struct UBP_PlayerEffectsComponent_C* BP_PlayerEffectsComponent; // 0xbe8(0x08)
	struct USceneComponent* FPSpotlightAttach; // 0xbf0(0x08)
	struct USceneComponent* TPSpotlightAttach; // 0xbf8(0x08)
	struct USkeletalMeshComponent* TPMeshSimple; // 0xc00(0x08)
	struct UPostProcessComponent* PostProcess_DamageIndicator; // 0xc08(0x08)
	struct UPostProcessComponent* PostProcess_Underwater; // 0xc10(0x08)
	struct UBP_SwimmingComponent_C* BP_SwimmingComponent; // 0xc18(0x08)
	struct USceneComponent* DamageDirectionPivot; // 0xc20(0x08)
	struct UCameraComponent* FPCamera; // 0xc28(0x08)
	struct USkeletalMeshComponent* FPMesh; // 0xc30(0x08)
	struct USceneComponent* BowLocator; // 0xc38(0x08)
	struct UBP_PlayerCameraComponent_C* BP_PlayerCameraComponent; // 0xc40(0x08)
	struct UIcarusCameraSpringArm* TPSpringArmComponent; // 0xc48(0x08)
	struct UCameraComponent* TPCamera; // 0xc50(0x08)
	struct UPostProcessComponent* HighlightablePostProcess; // 0xc58(0x08)
	struct UPostProcessComponent* ActionablePostProcess; // 0xc60(0x08)
	struct UBP_Weight_C* BP_Weight; // 0xc68(0x08)
	struct UProcessingComponent* Processing; // 0xc70(0x08)
	struct UWidgetComponent* PlayerNameWidget; // 0xc78(0x08)
	struct UArrowComponent* Arrow1; // 0xc80(0x08)
	float PP_ExitWater_Line_205F5B6F4CBC44F0C618AB9DF54C52A8; // 0xc88(0x04)
	float PP_ExitWater_Time_205F5B6F4CBC44F0C618AB9DF54C52A8; // 0xc8c(0x04)
	enum class ETimelineDirection PP_ExitWater__Direction_205F5B6F4CBC44F0C618AB9DF54C52A8; // 0xc90(0x01)
	char pad_C91[0x7]; // 0xc91(0x07)
	struct UTimelineComponent* PP_ExitWater; // 0xc98(0x08)
	float PP_EnterWater_Time_BC5B894041D4A44E3CB9059F469AE474; // 0xca0(0x04)
	enum class ETimelineDirection PP_EnterWater__Direction_BC5B894041D4A44E3CB9059F469AE474; // 0xca4(0x01)
	char pad_CA5[0x3]; // 0xca5(0x03)
	struct UTimelineComponent* PP_EnterWater; // 0xca8(0x08)
	bool JumpRequested; // 0xcb0(0x01)
	char pad_CB1[0x3]; // 0xcb1(0x03)
	float TurnRate; // 0xcb4(0x04)
	float LookUpRate; // 0xcb8(0x04)
	bool IsItemActionPlaying; // 0xcbc(0x01)
	char pad_CBD[0x3]; // 0xcbd(0x03)
	struct AIcarusItem* FocusedItem; // 0xcc0(0x08)
	struct USkeletalMeshComponent* ActiveMesh; // 0xcc8(0x08)
	struct ABP_Grid_Base_C* RemoteFocusedGrid; // 0xcd0(0x08)
	struct ABP_ObjectSlot_C* CurrentSlotConnection; // 0xcd8(0x08)
	bool IsLocalCrafting; // 0xce0(0x01)
	char pad_CE1[0x7]; // 0xce1(0x07)
	struct FMulticastInlineDelegate ProcessingUpdated; // 0xce8(0x10)
	bool ClientHasAuthority; // 0xcf8(0x01)
	char pad_CF9[0x3]; // 0xcf9(0x03)
	float DefaultFPCameraFOV; // 0xcfc(0x04)
	struct AIcarusItem* BackpackItem; // 0xd00(0x08)
	struct FMulticastInlineDelegate PerspectiveUpdated; // 0xd08(0x10)
	float LeftoverStaminaToApply; // 0xd18(0x04)
	char pad_D1C[0x4]; // 0xd1c(0x04)
	struct TArray<struct UUMG_DamageIndicator_C*> DamageIndicatorWidgets; // 0xd20(0x10)
	bool LightActive; // 0xd30(0x01)
	char pad_D31[0xf]; // 0xd31(0x0f)
	struct FTransform ADSOffset; // 0xd40(0x30)
	struct UMaterialInstanceDynamic* PPDamageMat; // 0xd70(0x08)
	float PPDamageTakenIntensity; // 0xd78(0x04)
	char pad_D7C[0x4]; // 0xd7c(0x04)
	struct AActor* LastDamageCauser; // 0xd80(0x08)
	struct FVector LastDamageLocation; // 0xd88(0x0c)
	char pad_D94[0x4]; // 0xd94(0x04)
	struct UMaterialInstanceDynamic* PPDamageAppliedMat; // 0xd98(0x08)
	struct UCurveFloat* HeartbeatCurve; // 0xda0(0x08)
	int32_t LastStamina; // 0xda8(0x04)
	float PPDamageDealtIntensity; // 0xdac(0x04)
	int32_t CurrentWeight; // 0xdb0(0x04)
	char pad_DB4[0x4]; // 0xdb4(0x04)
	struct FMulticastInlineDelegate AttachedSeatChanged; // 0xdb8(0x10)
	int32_t CurrentStamina; // 0xdc8(0x04)
	int32_t OverburnedUID; // 0xdcc(0x04)
	float FootstepCooldownEndTime; // 0xdd0(0x04)
	struct FFAfflictionTrigger Afflication_Threshold_Overheating; // 0xdd4(0x2c)
	struct FFAfflictionTrigger Afflication_Threshold_HeatOverload; // 0xe00(0x2c)
	struct FFAfflictionTrigger Afflication_Threshold_Chilled; // 0xe2c(0x2c)
	struct FFAfflictionTrigger Afflication_Threshold_Freezing; // 0xe58(0x2c)
	struct FFAfflictionTrigger Afflication_Threshold_Disorented; // 0xe84(0x2c)
	struct FFAfflictionTrigger Afflication_Threshold_Suffocation; // 0xeb0(0x2c)
	struct FFAfflictionTrigger Afflication_Threshold_Thirsty; // 0xedc(0x2c)
	struct FFAfflictionTrigger Afflication_Threshold_Dehydrated; // 0xf08(0x2c)
	struct FFAfflictionTrigger Afflication_Threshold_Hungry; // 0xf34(0x2c)
	struct FFAfflictionTrigger Afflication_Threshold_Famished; // 0xf60(0x2c)
	float FootstepMaxPlayDistanceSquared; // 0xf8c(0x04)
	struct FMulticastInlineDelegate AbortInteraction; // 0xf90(0x10)
	struct UAnimMontage* TPWaveEmote; // 0xfa0(0x08)
	struct UAnimMontage* FPWaveEmote; // 0xfa8(0x08)
	struct AIcarusActor* CachedInteractionRaycastHit; // 0xfb0(0x08)
	struct FMulticastInlineDelegate BackpackItemChanged; // 0xfb8(0x10)
	struct FMulticastInlineDelegate UnderwaterChanged; // 0xfc8(0x10)
	struct UMaterialInstanceDynamic* HelmetMatRef; // 0xfd8(0x08)
	struct FTimerHandle SwimmingTimer; // 0xfe0(0x08)
	int32_t Swimming UID; // 0xfe8(0x04)
	bool BlockPostprocess; // 0xfec(0x01)
	char pad_FED[0x3]; // 0xfed(0x03)
	struct FMulticastInlineDelegate FireModeChanged; // 0xff0(0x10)
	struct FMulticastInlineDelegate PlayerWeightUpdated; // 0x1000(0x10)
	struct FMulticastInlineDelegate FocusedItemUpdated; // 0x1010(0x10)
	bool OutOfWaterPPEnabled; // 0x1020(0x01)
	char pad_1021[0x3]; // 0x1021(0x03)
	float OutOfWaterPPLength; // 0x1024(0x04)
	float OutOfWaterPPFadeOutLength; // 0x1028(0x04)
	char pad_102C[0x4]; // 0x102c(0x04)
	struct UMaterialInstanceDynamic* WaterPPMaterial; // 0x1030(0x08)
	bool IsTravellingInDropship; // 0x1038(0x01)
	char pad_1039[0x7]; // 0x1039(0x07)
	struct FMulticastInlineDelegate TravellingInDropshipChanged; // 0x1040(0x10)
	bool ToggleCrouch; // 0x1050(0x01)
	bool HasValidFocusMontage; // 0x1051(0x01)
	char pad_1052[0x6]; // 0x1052(0x06)
	struct FPoseSnapshot DeathPose; // 0x1058(0x38)
	struct UMaterialInstanceDynamic* WaterEnterPPMaterial; // 0x1090(0x08)
	bool CameFromUnderwater; // 0x1098(0x01)
	char pad_1099[0x7]; // 0x1099(0x07)
	struct UUMG_GOAPWorldStats_C* GOAPWorldStatsRef; // 0x10a0(0x08)
	bool GOAPWorldStatsActive; // 0x10a8(0x01)
	char pad_10A9[0x7]; // 0x10a9(0x07)
	struct FTimerHandle AltInteractionTimer; // 0x10b0(0x08)
	float LastDamageYaw; // 0x10b8(0x04)
	float LastDamageTime; // 0x10bc(0x04)
	struct FMulticastInlineDelegate OnCosmeticDamageEffects; // 0x10c0(0x10)
	struct AIcarusCharacter* Host; // 0x10d0(0x08)
	bool IsUnderwater; // 0x10d8(0x01)
	char pad_10D9[0x3]; // 0x10d9(0x03)
	float GracePeriodTimer; // 0x10dc(0x04)
	bool InteractPressed; // 0x10e0(0x01)
	bool CameraIsUnderwater; // 0x10e1(0x01)
	char pad_10E2[0x6]; // 0x10e2(0x06)
	struct TArray<struct FItemData> Items; // 0x10e8(0x10)
	bool IsDead; // 0x10f8(0x01)
	char pad_10F9[0x7]; // 0x10f9(0x07)
	struct TMap<struct FKeybindingsRowHandle, struct FTimerHandle> KeybindHoldTimerHandles; // 0x1100(0x50)
	struct FMulticastInlineDelegate BuildingRepairWarningChanged; // 0x1150(0x10)
	bool ShowRepairWarning; // 0x1160(0x01)
	char pad_1161[0x3]; // 0x1161(0x03)
	float DefaultVignetteIntensity; // 0x1164(0x04)

	void UpdateCamera(struct FVector InLocation, struct FRotator InRotation, float InFOV, bool ForceUpdate, struct FVector OutLocation, struct FRotator OutRotation, float OutFOV, bool Return); // Function BP_IcarusPlayerCharacterSurvival.BP_IcarusPlayerCharacterSurvival_C.UpdateCamera // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void PlayCraftedRecipeSound(struct FProcessorRecipesRowHandle Recipe, int32_t CountInQueue); // Function BP_IcarusPlayerCharacterSurvival.BP_IcarusPlayerCharacterSurvival_C.PlayCraftedRecipeSound // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void OnProcessingCompleted(struct FProcessingItem Item); // Function BP_IcarusPlayerCharacterSurvival.BP_IcarusPlayerCharacterSurvival_C.OnProcessingCompleted // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
