// BlueprintGeneratedClass BP_Tree_CF_LogMossy_01.BP_Tree_CF_LogMossy_01_C
// Size: 0x500 (Inherited: 0x4b8)
struct ABP_Tree_CF_LogMossy_01_C : ABP_TreePrefab_C {
	struct UStaticMeshComponent* SM_CF_LogMossy_01_R_T1_T1_T1_B5; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_CF_LogMossy_01_R_T1_T1_T1_B4; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_CF_LogMossy_01_R_T1_T1_T1_B3; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_CF_LogMossy_01_R_T1_T1_T1_B2; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_CF_LogMossy_01_R_T1_T1_T1_B1; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_CF_LogMossy_01_R_T1_T1_T1; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_CF_LogMossy_01_R_T1_T1; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_CF_LogMossy_01_R_T1; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_CF_LogMossy_01_R; // 0x4f8(0x08)
};

