// BlueprintGeneratedClass BP_Tree_DC_TreeDead_02.BP_Tree_DC_TreeDead_02_C
// Size: 0x618 (Inherited: 0x4b8)
struct ABP_Tree_DC_TreeDead_02_C : ABP_TreePrefab_C {
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B5_B8; // 0x4b8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B5_B7; // 0x4c0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B5_B6; // 0x4c8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B5_B5; // 0x4d0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B5_B4; // 0x4d8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B5_B3; // 0x4e0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B5_B2; // 0x4e8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B5_B1; // 0x4f0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B5; // 0x4f8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B4_B7; // 0x500(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B4_B6; // 0x508(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B4_B5; // 0x510(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B4_B4; // 0x518(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B4_B3; // 0x520(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B4_B2; // 0x528(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B4_B1_B1; // 0x530(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B4; // 0x538(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B3_B7; // 0x540(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B3_B6; // 0x548(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B3_B5; // 0x550(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B3_B4; // 0x558(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B3_B3_B1; // 0x560(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B3_B2_B1; // 0x568(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B3_B1_B1; // 0x570(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B3; // 0x578(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B2_B4; // 0x580(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B2_B3; // 0x588(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B2_B2_B1; // 0x590(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B2_B2; // 0x598(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B2_B1_B1; // 0x5a0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B2_B1; // 0x5a8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B2; // 0x5b0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B1_B9; // 0x5b8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B1_B8; // 0x5c0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B1_B7; // 0x5c8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B1_B6_B1; // 0x5d0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B1_B4; // 0x5d8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B1_B3; // 0x5e0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B1_B2; // 0x5e8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B1_B1_B1; // 0x5f0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B1_B1; // 0x5f8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1_B1; // 0x600(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R_T1; // 0x608(0x08)
	struct UStaticMeshComponent* DC_TreeDead_02_R; // 0x610(0x08)
};

