// BlueprintGeneratedClass BP_Tree_DC_TreeDead_03.BP_Tree_DC_TreeDead_03_C
// Size: 0x548 (Inherited: 0x4b8)
struct ABP_Tree_DC_TreeDead_03_C : ABP_TreePrefab_C {
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B3_B2_B3; // 0x4b8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B3_B2_B2; // 0x4c0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B3_B2_B1; // 0x4c8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B3_B2; // 0x4d0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B3_B1_B3; // 0x4d8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B3_B1_B2; // 0x4e0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B3_B1_B1; // 0x4e8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B3_B1; // 0x4f0(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B3; // 0x4f8(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B2_B3; // 0x500(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B2_B2; // 0x508(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B2_B1; // 0x510(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B2; // 0x518(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B1_B2; // 0x520(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B1_B1; // 0x528(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1_B1; // 0x530(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R_T1; // 0x538(0x08)
	struct UStaticMeshComponent* DC_TreeDead_03_R; // 0x540(0x08)
};

