// BlueprintGeneratedClass BP_Tree_LC_TreeBurnt_04.BP_Tree_LC_TreeBurnt_04_C
// Size: 0x520 (Inherited: 0x4b8)
struct ABP_Tree_LC_TreeBurnt_04_C : ABP_TreePrefab_C {
	struct UStaticMeshComponent* SM_LC_TreeBurnt_04_R_T1_T1_T1_T1; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_04_R_T1_T1_T1_B3_B1; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_04_R_T1_T1_T1_B3; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_04_R_T1_T1_T1_B2_B1; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_04_R_T1_T1_T1_B2; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_04_R_T1_T1_T1_B1_B1; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_04_R_T1_T1_T1_B1; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_04_R_T1_T1_T1; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_04_R_T1_T1_B1; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_04_R_T1_T1; // 0x500(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_04_R_T1_B1; // 0x508(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_04_R_T1; // 0x510(0x08)
	struct UStaticMeshComponent* SM_LC_TreeBurnt_04_R; // 0x518(0x08)
};

