// BlueprintGeneratedClass BP_Tree_DC_CocoPalm_Dead_03.BP_Tree_DC_CocoPalm_Dead_03_C
// Size: 0x508 (Inherited: 0x4b8)
struct ABP_Tree_DC_CocoPalm_Dead_03_C : ABP_TreePrefab_C {
	struct UStaticMeshComponent* SM_DC_CocoPalm_Dead_03_R_T1_T1_T1_T1_T1_T1_L; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_DC_CocoPalm_Dead_03_R_T1_T1_T1_T1_T1_T1; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_DC_CocoPalm_Dead_03_R_T1_T1_T1_T1_T1_L; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_DC_CocoPalm_Dead_03_R_T1_T1_T1_T1_T1; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_DC_CocoPalm_Dead_03_R_T1_T1_T1_T1_L; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_DC_CocoPalm_Dead_03_R_T1_T1_T1_T1; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_DC_CocoPalm_Dead_03_R_T1_T1_T1; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_DC_CocoPalm_Dead_03_R_T1_T1; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_DC_CocoPalm_Dead_03_R_T1; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_DC_CocoPalm_Dead_03_R; // 0x500(0x08)
};

