// Class OnlineSubsystemIcarus.AddPlayerToProspectCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct UAddPlayerToProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct UAddPlayerToProspectCallbackProxyGen* AddPlayerToProspect(struct FReqAddPlayerToProspect Request); // Function OnlineSubsystemIcarus.AddPlayerToProspectCallbackProxyGen.AddPlayerToProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d4bc0
};

// Class OnlineSubsystemIcarus.BackToHabCallbackProxyGen
// Size: 0x98 (Inherited: 0x30)
struct UBackToHabCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x48]; // 0x50(0x48)

	struct UBackToHabCallbackProxyGen* BackToHab(struct FReqBackToHab Request); // Function OnlineSubsystemIcarus.BackToHabCallbackProxyGen.BackToHab // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d4c80
};

// Class OnlineSubsystemIcarus.BuyWorkshopPackCallbackProxyGen
// Size: 0x70 (Inherited: 0x30)
struct UBuyWorkshopPackCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x20]; // 0x50(0x20)

	struct UBuyWorkshopPackCallbackProxyGen* BuyWorkshopPack(struct FReqPurchaseWorkshopPack Request); // Function OnlineSubsystemIcarus.BuyWorkshopPackCallbackProxyGen.BuyWorkshopPack // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d4e00
};

// Class OnlineSubsystemIcarus.CanJoinProspectCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct UCanJoinProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct UCanJoinProspectCallbackProxyGen* CanJoinProspect(struct FReqCanJoinProspect Request); // Function OnlineSubsystemIcarus.CanJoinProspectCallbackProxyGen.CanJoinProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d4ec0
};

// Class OnlineSubsystemIcarus.CheckProspectExpiredCallbackProxyGen
// Size: 0x60 (Inherited: 0x30)
struct UCheckProspectExpiredCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x10]; // 0x50(0x10)

	struct UCheckProspectExpiredCallbackProxyGen* CheckProspectExpired(struct FReqCheckProspectExpired Request); // Function OnlineSubsystemIcarus.CheckProspectExpiredCallbackProxyGen.CheckProspectExpired // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d4f80
};

// Class OnlineSubsystemIcarus.ClaimNotificationAttachmentsCallbackProxyGen
// Size: 0x70 (Inherited: 0x30)
struct UClaimNotificationAttachmentsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x20]; // 0x50(0x20)

	struct UClaimNotificationAttachmentsCallbackProxyGen* ClaimNotificationAttachments(struct FReqClaimNotificationAttachments Request); // Function OnlineSubsystemIcarus.ClaimNotificationAttachmentsCallbackProxyGen.ClaimNotificationAttachments // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5030
};

// Class OnlineSubsystemIcarus.ClaimProspectCallbackProxyGen
// Size: 0xf8 (Inherited: 0x30)
struct UClaimProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0xa8]; // 0x50(0xa8)

	struct UClaimProspectCallbackProxyGen* ClaimProspect(struct FReqClaimProspect Request); // Function OnlineSubsystemIcarus.ClaimProspectCallbackProxyGen.ClaimProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d50f0
};

// Class OnlineSubsystemIcarus.CreateCharacterCallbackProxyGen
// Size: 0x128 (Inherited: 0x30)
struct UCreateCharacterCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0xd8]; // 0x50(0xd8)

	struct UCreateCharacterCallbackProxyGen* CreateCharacter(struct FReqCreateCharacter Request); // Function OnlineSubsystemIcarus.CreateCharacterCallbackProxyGen.CreateCharacter // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d52a0
};

// Class OnlineSubsystemIcarus.CreateDropshipCallbackProxyGen
// Size: 0x88 (Inherited: 0x30)
struct UCreateDropshipCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x38]; // 0x50(0x38)

	struct UCreateDropshipCallbackProxyGen* CreateDropship(struct FReqCreateDropship Request); // Function OnlineSubsystemIcarus.CreateDropshipCallbackProxyGen.CreateDropship // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5470
};

// Class OnlineSubsystemIcarus.CreateProspectCallbackProxyGen
// Size: 0xd0 (Inherited: 0x30)
struct UCreateProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x80]; // 0x50(0x80)

	struct UCreateProspectCallbackProxyGen* CreateProspect(struct FReqCreateProspect Request); // Function OnlineSubsystemIcarus.CreateProspectCallbackProxyGen.CreateProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5570
};

// Class OnlineSubsystemIcarus.DeleteCharacterCallbackProxyGen
// Size: 0x58 (Inherited: 0x30)
struct UDeleteCharacterCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x8]; // 0x50(0x08)

	struct UDeleteCharacterCallbackProxyGen* DeleteCharacter(struct FReqDeleteCharacter Request); // Function OnlineSubsystemIcarus.DeleteCharacterCallbackProxyGen.DeleteCharacter // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5710
};

// Class OnlineSubsystemIcarus.DeleteDropshipCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UDeleteDropshipCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UDeleteDropshipCallbackProxyGen* DeleteDropship(struct FReqDeleteDropship Request); // Function OnlineSubsystemIcarus.DeleteDropshipCallbackProxyGen.DeleteDropship // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d57b0
};

// Class OnlineSubsystemIcarus.DeleteNotificationCallbackProxyGen
// Size: 0x70 (Inherited: 0x30)
struct UDeleteNotificationCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x20]; // 0x50(0x20)

	struct UDeleteNotificationCallbackProxyGen* DeleteNotification(struct FReqDeleteNotification Request); // Function OnlineSubsystemIcarus.DeleteNotificationCallbackProxyGen.DeleteNotification // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5860
};

// Class OnlineSubsystemIcarus.GetAllProspectsCallbackProxyGen
// Size: 0x60 (Inherited: 0x30)
struct UGetAllProspectsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x10]; // 0x50(0x10)

	struct UGetAllProspectsCallbackProxyGen* GetAllProspects(struct FReqGetAllProspects Request); // Function OnlineSubsystemIcarus.GetAllProspectsCallbackProxyGen.GetAllProspects // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5920
};

// Class OnlineSubsystemIcarus.GetAvailableProspectsCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetAvailableProspectsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetAvailableProspectsCallbackProxyGen* GetAvailableProspects(struct FReqGetAvailableProspects Request); // Function OnlineSubsystemIcarus.GetAvailableProspectsCallbackProxyGen.GetAvailableProspects // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d59d0
};

// Class OnlineSubsystemIcarus.GetChallengesCallbackProxyGen
// Size: 0x60 (Inherited: 0x30)
struct UGetChallengesCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x10]; // 0x50(0x10)

	struct UGetChallengesCallbackProxyGen* GetChallenges(struct FReqGetChallenges Request); // Function OnlineSubsystemIcarus.GetChallengesCallbackProxyGen.GetChallenges // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5a80
};

// Class OnlineSubsystemIcarus.GetCharacterLoadoutCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetCharacterLoadoutCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetCharacterLoadoutCallbackProxyGen* GetCharacterLoadout(struct FReqGetCharacterLoadout Request); // Function OnlineSubsystemIcarus.GetCharacterLoadoutCallbackProxyGen.GetCharacterLoadout // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5b30
};

// Class OnlineSubsystemIcarus.GetCharacterProfileCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetCharacterProfileCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetCharacterProfileCallbackProxyGen* GetCharacterProfile(struct FReqGetCharacterProfile Request); // Function OnlineSubsystemIcarus.GetCharacterProfileCallbackProxyGen.GetCharacterProfile // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5be0
};

// Class OnlineSubsystemIcarus.GetCharactersCallbackProxyGen
// Size: 0x58 (Inherited: 0x30)
struct UGetCharactersCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x8]; // 0x50(0x08)

	struct UGetCharactersCallbackProxyGen* GetCharacters(struct FReqGetCharacters Request); // Function OnlineSubsystemIcarus.GetCharactersCallbackProxyGen.GetCharacters // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5c90
};

// Class OnlineSubsystemIcarus.GetCreditsCallbackProxyGen
// Size: 0x60 (Inherited: 0x30)
struct UGetCreditsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x10]; // 0x50(0x10)

	struct UGetCreditsCallbackProxyGen* GetCredits(struct FReqGetCredits Request); // Function OnlineSubsystemIcarus.GetCreditsCallbackProxyGen.GetCredits // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5d20
};

// Class OnlineSubsystemIcarus.GetDropshipsCallbackProxyGen
// Size: 0x60 (Inherited: 0x30)
struct UGetDropshipsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x10]; // 0x50(0x10)

	struct UGetDropshipsCallbackProxyGen* GetDropships(struct FReqGetDropships Request); // Function OnlineSubsystemIcarus.GetDropshipsCallbackProxyGen.GetDropships // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5dd0
};

// Class OnlineSubsystemIcarus.GetLastProspectCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetLastProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetLastProspectCallbackProxyGen* GetLastProspect(struct FReqGetLastProspect Request); // Function OnlineSubsystemIcarus.GetLastProspectCallbackProxyGen.GetLastProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5e80
};

// Class OnlineSubsystemIcarus.GetLoadoutInventoryCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetLoadoutInventoryCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetLoadoutInventoryCallbackProxyGen* GetLoadoutInventory(struct FReqLoadoutInventory Request); // Function OnlineSubsystemIcarus.GetLoadoutInventoryCallbackProxyGen.GetLoadoutInventory // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5f30
};

// Class OnlineSubsystemIcarus.GetMetaInventoryCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetMetaInventoryCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetMetaInventoryCallbackProxyGen* GetMetaInventory(struct FReqGetMetaInventory Request); // Function OnlineSubsystemIcarus.GetMetaInventoryCallbackProxyGen.GetMetaInventory // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d5fe0
};

// Class OnlineSubsystemIcarus.GetMetaResourceCallbackProxyGen
// Size: 0x60 (Inherited: 0x30)
struct UGetMetaResourceCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x10]; // 0x50(0x10)

	struct UGetMetaResourceCallbackProxyGen* GetMetaResource(struct FReqGetMetaResources Request); // Function OnlineSubsystemIcarus.GetMetaResourceCallbackProxyGen.GetMetaResource // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d9e00
};

// Class OnlineSubsystemIcarus.GetNotificationsCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetNotificationsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetNotificationsCallbackProxyGen* GetNotifications(struct FReqGetNotifications Request); // Function OnlineSubsystemIcarus.GetNotificationsCallbackProxyGen.GetNotifications // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d9eb0
};

// Class OnlineSubsystemIcarus.GetPreparedLoadoutCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetPreparedLoadoutCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetPreparedLoadoutCallbackProxyGen* GetPreparedLoadout(struct FReqPreparedLoadout Request); // Function OnlineSubsystemIcarus.GetPreparedLoadoutCallbackProxyGen.GetPreparedLoadout // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d9f60
};

// Class OnlineSubsystemIcarus.GetProspectCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct UGetProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct UGetProspectCallbackProxyGen* GetProspect(struct FReqGetProspect Request); // Function OnlineSubsystemIcarus.GetProspectCallbackProxyGen.GetProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9da010
};

// Class OnlineSubsystemIcarus.GetProspectReportCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct UGetProspectReportCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct UGetProspectReportCallbackProxyGen* GetProspectReport(struct FReqGetProspectReport Request); // Function OnlineSubsystemIcarus.GetProspectReportCallbackProxyGen.GetProspectReport // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9da0d0
};

// Class OnlineSubsystemIcarus.GetProspectSummaryCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct UGetProspectSummaryCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct UGetProspectSummaryCallbackProxyGen* GetProspectSummary(struct FReqGetProspectSummary Request); // Function OnlineSubsystemIcarus.GetProspectSummaryCallbackProxyGen.GetProspectSummary // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9da190
};

// Class OnlineSubsystemIcarus.GetUserProfileCallbackProxyGen
// Size: 0x58 (Inherited: 0x30)
struct UGetUserProfileCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x8]; // 0x50(0x08)

	struct UGetUserProfileCallbackProxyGen* GetUserProfile(struct FReqGetUserProfile Request); // Function OnlineSubsystemIcarus.GetUserProfileCallbackProxyGen.GetUserProfile // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9da270
};

// Class OnlineSubsystemIcarus.GetWorkshopPacksCallbackProxyGen
// Size: 0x58 (Inherited: 0x30)
struct UGetWorkshopPacksCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x8]; // 0x50(0x08)

	struct UGetWorkshopPacksCallbackProxyGen* GetWorkshopPacks(struct FReqGetWorkshopPacks Request); // Function OnlineSubsystemIcarus.GetWorkshopPacksCallbackProxyGen.GetWorkshopPacks // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9da300
};

// Class OnlineSubsystemIcarus.HostCandidateCallbackProxyGen
// Size: 0x70 (Inherited: 0x30)
struct UHostCandidateCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x20]; // 0x50(0x20)

	struct UHostCandidateCallbackProxyGen* HostCandidate(struct FReqHostCandidate Request); // Function OnlineSubsystemIcarus.HostCandidateCallbackProxyGen.HostCandidate // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9da390
};

// Class OnlineSubsystemIcarus.IcarusConnectionComponentBase
// Size: 0x188 (Inherited: 0x28)
struct UIcarusConnectionComponentBase : UObject {
	char pad_28[0x30]; // 0x28(0x30)
	struct FString AddressAndPort; // 0x58(0x10)
	char pad_68[0x120]; // 0x68(0x120)

	bool IsConnected(); // Function OnlineSubsystemIcarus.IcarusConnectionComponentBase.IsConnected // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9da450
	int32_t GetReconnectAttempts(); // Function OnlineSubsystemIcarus.IcarusConnectionComponentBase.GetReconnectAttempts // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9da250
	struct FString GetAuthType(); // Function OnlineSubsystemIcarus.IcarusConnectionComponentBase.GetAuthType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d9a60
	struct FString GetAuthToken(); // Function OnlineSubsystemIcarus.IcarusConnectionComponentBase.GetAuthToken // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d9990
	struct FString GetAuthId(); // Function OnlineSubsystemIcarus.IcarusConnectionComponentBase.GetAuthId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d98c0
};

// Class OnlineSubsystemIcarus.IcarusConnectionComponentGen
// Size: 0x528 (Inherited: 0x188)
struct UIcarusConnectionComponentGen : UIcarusConnectionComponentBase {
	char pad_188[0x3a0]; // 0x188(0x3a0)
};

// Class OnlineSubsystemIcarus.IcarusConnectionComponent
// Size: 0x648 (Inherited: 0x528)
struct UIcarusConnectionComponent : UIcarusConnectionComponentGen {
	char pad_528[0x120]; // 0x528(0x120)
};

// Class OnlineSubsystemIcarus.IcarusLobbyConnectionComponentBase
// Size: 0x1a8 (Inherited: 0x28)
struct UIcarusLobbyConnectionComponentBase : UObject {
	struct FString AddressAndPort; // 0x28(0x10)
	char pad_38[0x170]; // 0x38(0x170)

	bool IsConnected(); // Function OnlineSubsystemIcarus.IcarusLobbyConnectionComponentBase.IsConnected // (Final|Native|Public|BlueprintCallable) // @ game+0x9da480
};

// Class OnlineSubsystemIcarus.IcarusLobbyConnectionComponentGen
// Size: 0x1b8 (Inherited: 0x1a8)
struct UIcarusLobbyConnectionComponentGen : UIcarusLobbyConnectionComponentBase {
	char pad_1A8[0x10]; // 0x1a8(0x10)
};

// Class OnlineSubsystemIcarus.IcarusLobbyConnectionComponent
// Size: 0x210 (Inherited: 0x1b8)
struct UIcarusLobbyConnectionComponent : UIcarusLobbyConnectionComponentGen {
	char pad_1B8[0x58]; // 0x1b8(0x58)
};

// Class OnlineSubsystemIcarus.IcarusMessageListeners
// Size: 0x68 (Inherited: 0x28)
struct UIcarusMessageListeners : UObject {
	struct FMulticastInlineDelegate OnConnectMessage; // 0x28(0x10)
	struct FMulticastInlineDelegate OnMatchUpdateMessage; // 0x38(0x10)
	struct FMulticastInlineDelegate OnUpdateConnectionStringMessage; // 0x48(0x10)
	struct FMulticastInlineDelegate OnChatMessage; // 0x58(0x10)
};

// Class OnlineSubsystemIcarus.IcarusOfflineConnectionComponentGen
// Size: 0x6a8 (Inherited: 0x648)
struct UIcarusOfflineConnectionComponentGen : UIcarusConnectionComponent {
	char pad_648[0x60]; // 0x648(0x60)
};

// Class OnlineSubsystemIcarus.JoinProspectCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UJoinProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UJoinProspectCallbackProxyGen* JoinProspect(struct FReqJoinProspect Request); // Function OnlineSubsystemIcarus.JoinProspectCallbackProxyGen.JoinProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9da510
};

// Class OnlineSubsystemIcarus.LeaveProspectCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct ULeaveProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct ULeaveProspectCallbackProxyGen* LeaveProspect(struct FReqLeaveProspect Request); // Function OnlineSubsystemIcarus.LeaveProspectCallbackProxyGen.LeaveProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9da5c0
};

// Class OnlineSubsystemIcarus.LobbyMessageCallbackProxyGen
// Size: 0x80 (Inherited: 0x30)
struct ULobbyMessageCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x30]; // 0x50(0x30)

	struct ULobbyMessageCallbackProxyGen* LobbyMessage(struct FReqLobbyMessage Request); // Function OnlineSubsystemIcarus.LobbyMessageCallbackProxyGen.LobbyMessage // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9da670
};

// Class OnlineSubsystemIcarus.ModifyDropshipCallbackProxyGen
// Size: 0x90 (Inherited: 0x30)
struct UModifyDropshipCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x40]; // 0x50(0x40)

	struct UModifyDropshipCallbackProxyGen* ModifyDropship(struct FReqModifyDropship Request); // Function OnlineSubsystemIcarus.ModifyDropshipCallbackProxyGen.ModifyDropship // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9da8a0
};

// Class OnlineSubsystemIcarus.MoveMetaInventoryItemCallbackProxyGen
// Size: 0x90 (Inherited: 0x30)
struct UMoveMetaInventoryItemCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x40]; // 0x50(0x40)

	struct UMoveMetaInventoryItemCallbackProxyGen* MoveMetaInventoryItem(struct FReqMoveMetaInventoryItem Request); // Function OnlineSubsystemIcarus.MoveMetaInventoryItemCallbackProxyGen.MoveMetaInventoryItem // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9da9a0
};

// Class OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UOnlineSubsystemIcarusFunctionLibrary : UBlueprintFunctionLibrary {

	bool SwitchOnlineMode(bool bOnlineMode); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.SwitchOnlineMode // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dabd0
	void SetPresence(struct APlayerController* PlayerController, enum class EOnlinePresenceStatusIcarus NewState, struct TArray<struct FPresencePropertyKeyPair> Properties); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.SetPresence // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9daa80
	struct FPresencePropertyKeyPair MakeLiteralPresencePropertyString(struct FName Key, struct FString Value); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.MakeLiteralPresencePropertyString // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9da750
	bool IsOnlineSubsystemIcarusEnabled(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.IsOnlineSubsystemIcarusEnabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9da4e0
	bool IsOnlineMode(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.IsOnlineMode // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9da4b0
	bool GetIcarusVersion(struct FIcarusVersion Version); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.GetIcarusVersion // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d9d30
	struct UIcarusMessageListeners* GetIcarusMessageListeners(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.GetIcarusMessageListeners // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d9d00
	struct UIcarusLobbyConnectionComponent* GetIcarusLobbyConnectionComponent(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.GetIcarusLobbyConnectionComponent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d9cd0
	struct UIcarusConnectionComponent* GetIcarusConnectionComponent(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.GetIcarusConnectionComponent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d9ca0
	struct FString GetHash(struct TArray<char> Buffer); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.GetHash // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d9bb0
	struct FString GetGatewayAddress(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.GetGatewayAddress // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d9b30
};

// Class OnlineSubsystemIcarus.OnlineSubsystemIcarusOfflineFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UOnlineSubsystemIcarusOfflineFunctionLibrary : UBlueprintFunctionLibrary {

	bool SwitchOnlineMode(bool bOnlineMode); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusOfflineFunctionLibrary.SwitchOnlineMode // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dabd0
	bool IsOnlineMode(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusOfflineFunctionLibrary.IsOnlineMode // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9da4b0
};

// Class OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UOnlineSubsystemIcarusSessionFunctionLibrary : UBlueprintFunctionLibrary {

	void SendChatMessage(struct FIcarusChatMessage ChatMessage); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.SendChatMessage // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9df200
	void ReqUpdateLobbyStatus(enum class ELobbyStatus LobbyStatus); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.ReqUpdateLobbyStatus // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dee50
	void RequestConnectionString(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.RequestConnectionString // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9deec0
	bool IsValidMatch(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.IsValidMatch // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dea90
	bool IsMatchHost(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.IsMatchHost // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dea60
	bool IsConnectedIcarusBackend(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.IsConnectedIcarusBackend // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dea30
	struct TMap<struct FName, struct FMatchMakingFilter> GetMatchFilters(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.GetMatchFilters // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9de960
	struct FString GetIcarusPlayerId(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.GetIcarusPlayerId // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9de8e0
	struct FMatchUpdate GetCurrentMatch(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.GetCurrentMatch // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9de710
	struct FConnectionString GetConnectionString(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.GetConnectionString // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9de6a0
	struct FString GetAuthToken(int32_t LocalUserNum); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.GetAuthToken // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9de5d0
	void CancelMatchMaking(struct FName SessionName); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.CancelMatchMaking // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9de550
};

// Class OnlineSubsystemIcarus.PackageLoadoutCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UPackageLoadoutCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UPackageLoadoutCallbackProxyGen* PackageLoadout(struct FReqPackageLoadout Request); // Function OnlineSubsystemIcarus.PackageLoadoutCallbackProxyGen.PackageLoadout // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9deac0
};

// Class OnlineSubsystemIcarus.ReadNotificationCallbackProxyGen
// Size: 0x70 (Inherited: 0x30)
struct UReadNotificationCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x20]; // 0x50(0x20)

	struct UReadNotificationCallbackProxyGen* ReadNotification(struct FReqReadNotification Request); // Function OnlineSubsystemIcarus.ReadNotificationCallbackProxyGen.ReadNotification // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9deb70
};

// Class OnlineSubsystemIcarus.RemoveEnvirosuitCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct URemoveEnvirosuitCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct URemoveEnvirosuitCallbackProxyGen* RemoveEnvirosuit(struct FReqRemoveEnvirosuit Request); // Function OnlineSubsystemIcarus.RemoveEnvirosuitCallbackProxyGen.RemoveEnvirosuit // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dec30
};

// Class OnlineSubsystemIcarus.RemoveMetaItemCallbackProxyGen
// Size: 0x70 (Inherited: 0x30)
struct URemoveMetaItemCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x20]; // 0x50(0x20)

	struct URemoveMetaItemCallbackProxyGen* RemoveMetaItem(struct FReqRemoveMetaInventoryItem Request); // Function OnlineSubsystemIcarus.RemoveMetaItemCallbackProxyGen.RemoveMetaItem // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dece0
};

// Class OnlineSubsystemIcarus.RemoveSelectedDropshipCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct URemoveSelectedDropshipCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct URemoveSelectedDropshipCallbackProxyGen* RemoveSelectedDropship(struct FReqRemoveSelectedDropship Request); // Function OnlineSubsystemIcarus.RemoveSelectedDropshipCallbackProxyGen.RemoveSelectedDropship // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9deda0
};

// Class OnlineSubsystemIcarus.ResetCharacterCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UResetCharacterCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UResetCharacterCallbackProxyGen* ResetCharacter(struct FReqResetCharacter Request); // Function OnlineSubsystemIcarus.ResetCharacterCallbackProxyGen.ResetCharacter // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9deee0
};

// Class OnlineSubsystemIcarus.ResumeProspectCallbackProxyGen
// Size: 0xa8 (Inherited: 0x30)
struct UResumeProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x58]; // 0x50(0x58)

	struct UResumeProspectCallbackProxyGen* ResumeProspect(struct FReqResumeProspect Request); // Function OnlineSubsystemIcarus.ResumeProspectCallbackProxyGen.ResumeProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9def90
};

// Class OnlineSubsystemIcarus.SelectDropshipCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct USelectDropshipCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct USelectDropshipCallbackProxyGen* SelectDropship(struct FReqSelectDropship Request); // Function OnlineSubsystemIcarus.SelectDropshipCallbackProxyGen.SelectDropship // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9df090
};

// Class OnlineSubsystemIcarus.SelectEnvirosuitCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct USelectEnvirosuitCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct USelectEnvirosuitCallbackProxyGen* SelectEnvirosuit(struct FReqSelectEnvirosuit Request); // Function OnlineSubsystemIcarus.SelectEnvirosuitCallbackProxyGen.SelectEnvirosuit // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9df140
};

// Class OnlineSubsystemIcarus.SetResourceSplitCallbackProxyGen
// Size: 0x88 (Inherited: 0x30)
struct USetResourceSplitCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x38]; // 0x50(0x38)

	struct USetResourceSplitCallbackProxyGen* SetResourceSplit(struct FReqSetResourceSplit Request); // Function OnlineSubsystemIcarus.SetResourceSplitCallbackProxyGen.SetResourceSplit // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9df2d0
};

// Class OnlineSubsystemIcarus.SettleProspectCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct USettleProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct USettleProspectCallbackProxyGen* SettleProspect(struct FReqSettleProspect Request); // Function OnlineSubsystemIcarus.SettleProspectCallbackProxyGen.SettleProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9df3d0
};

// Class OnlineSubsystemIcarus.SyncTalentsCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct USyncTalentsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct USyncTalentsCallbackProxyGen* SyncTalents(struct FReqSyncTalents Request); // Function OnlineSubsystemIcarus.SyncTalentsCallbackProxyGen.SyncTalents // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9df490
};

// Class OnlineSubsystemIcarus.UnlockCharacterFlagsCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UUnlockCharacterFlagsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UUnlockCharacterFlagsCallbackProxyGen* UnlockCharacterFlags(struct FReqUnlockCharacterFlags Request); // Function OnlineSubsystemIcarus.UnlockCharacterFlagsCallbackProxyGen.UnlockCharacterFlags // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9df580
};

// Class OnlineSubsystemIcarus.UnpackageLoadoutCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UUnpackageLoadoutCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UUnpackageLoadoutCallbackProxyGen* UnpackageLoadout(struct FReqUnpackageLoadout Request); // Function OnlineSubsystemIcarus.UnpackageLoadoutCallbackProxyGen.UnpackageLoadout // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e04b0
};

// Class OnlineSubsystemIcarus.UpdateChallengeProgressCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct UUpdateChallengeProgressCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct UUpdateChallengeProgressCallbackProxyGen* UpdateChallengeProgress(struct FReqUpdateChallengeProgress Request); // Function OnlineSubsystemIcarus.UpdateChallengeProgressCallbackProxyGen.UpdateChallengeProgress // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e0560
};

// Class OnlineSubsystemIcarus.UpdateCharacterLoadoutCallbackProxyGen
// Size: 0x1a0 (Inherited: 0x30)
struct UUpdateCharacterLoadoutCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x150]; // 0x50(0x150)

	struct UUpdateCharacterLoadoutCallbackProxyGen* UpdateCharacterLoadout(struct FReqUpdateCharacterLoadout Request); // Function OnlineSubsystemIcarus.UpdateCharacterLoadoutCallbackProxyGen.UpdateCharacterLoadout // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e0620
};

// Class OnlineSubsystemIcarus.UpdateCharacterProgressCallbackProxyGen
// Size: 0x98 (Inherited: 0x30)
struct UUpdateCharacterProgressCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x48]; // 0x50(0x48)

	struct UUpdateCharacterProgressCallbackProxyGen* UpdateCharacterProgress(struct FReqUpdateCharacterProgress Request); // Function OnlineSubsystemIcarus.UpdateCharacterProgressCallbackProxyGen.UpdateCharacterProgress // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e06e0
};

// Class OnlineSubsystemIcarus.UpdateCosmeticsCallbackProxyGen
// Size: 0x130 (Inherited: 0x30)
struct UUpdateCosmeticsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0xe0]; // 0x50(0xe0)

	struct UUpdateCosmeticsCallbackProxyGen* UpdateCosmetics(struct FReqUpdateCosmetics Request); // Function OnlineSubsystemIcarus.UpdateCosmeticsCallbackProxyGen.UpdateCosmetics // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e07d0
};

// Class OnlineSubsystemIcarus.UpdateFactionMissionProgressCallbackProxyGen
// Size: 0x90 (Inherited: 0x30)
struct UUpdateFactionMissionProgressCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x40]; // 0x50(0x40)

	struct UUpdateFactionMissionProgressCallbackProxyGen* UpdateFactionMissionProgress(struct FReqUpdateFactionMissionProgress Request); // Function OnlineSubsystemIcarus.UpdateFactionMissionProgressCallbackProxyGen.UpdateFactionMissionProgress // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e09b0
};

// Class OnlineSubsystemIcarus.UpdateProspectCallbackProxyGen
// Size: 0xb0 (Inherited: 0x30)
struct UUpdateProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x60]; // 0x50(0x60)

	struct UUpdateProspectCallbackProxyGen* UpdateProspect(struct FReqUpdateProspect Request); // Function OnlineSubsystemIcarus.UpdateProspectCallbackProxyGen.UpdateProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e0a90
};

// Class OnlineSubsystemIcarus.UpdateTrackedStatsCallbackProxyGen
// Size: 0x88 (Inherited: 0x30)
struct UUpdateTrackedStatsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x38]; // 0x50(0x38)

	struct UUpdateTrackedStatsCallbackProxyGen* UpdateTrackedStats(struct FReqUpdateTrackedStats Request); // Function OnlineSubsystemIcarus.UpdateTrackedStatsCallbackProxyGen.UpdateTrackedStats // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e0b90
};

