// AnimBlueprintGeneratedClass SK_BLD_TrapDoorHatch_Wood_AnimBP.SK_BLD_TrapDoorHatch_Wood_AnimBP_C
// Size: 0x789 (Inherited: 0x2c0)
struct USK_BLD_TrapDoorHatch_Wood_AnimBP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3c0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x3e8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x468(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x498(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x518(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x548(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x5c8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5f8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x678(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x6a8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x6d8(0xb0)
	enum class DoorState DoorState; // 0x788(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function SK_BLD_TrapDoorHatch_Wood_AnimBP.SK_BLD_TrapDoorHatch_Wood_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_BLD_TrapDoorHatch_Wood_AnimBP_AnimGraphNode_TransitionResult_3F3525D343FB94A08B0FF090B0274797(); // Function SK_BLD_TrapDoorHatch_Wood_AnimBP.SK_BLD_TrapDoorHatch_Wood_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SK_BLD_TrapDoorHatch_Wood_AnimBP_AnimGraphNode_TransitionResult_3F3525D343FB94A08B0FF090B0274797 // (BlueprintEvent) // @ game+0x1a05090
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_BLD_TrapDoorHatch_Wood_AnimBP_AnimGraphNode_TransitionResult_EC48B9D24F0DDA1FD4DE7EBE4AF8D173(); // Function SK_BLD_TrapDoorHatch_Wood_AnimBP.SK_BLD_TrapDoorHatch_Wood_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SK_BLD_TrapDoorHatch_Wood_AnimBP_AnimGraphNode_TransitionResult_EC48B9D24F0DDA1FD4DE7EBE4AF8D173 // (BlueprintEvent) // @ game+0x1a05090
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_BLD_TrapDoorHatch_Wood_AnimBP_AnimGraphNode_TransitionResult_EF081FA249A12CB8B11ECEB0DD22AEF7(); // Function SK_BLD_TrapDoorHatch_Wood_AnimBP.SK_BLD_TrapDoorHatch_Wood_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SK_BLD_TrapDoorHatch_Wood_AnimBP_AnimGraphNode_TransitionResult_EF081FA249A12CB8B11ECEB0DD22AEF7 // (BlueprintEvent) // @ game+0x1a05090
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_BLD_TrapDoorHatch_Wood_AnimBP_AnimGraphNode_TransitionResult_01AB6095452E70BC91618FAABE0E6AA9(); // Function SK_BLD_TrapDoorHatch_Wood_AnimBP.SK_BLD_TrapDoorHatch_Wood_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SK_BLD_TrapDoorHatch_Wood_AnimBP_AnimGraphNode_TransitionResult_01AB6095452E70BC91618FAABE0E6AA9 // (BlueprintEvent) // @ game+0x1a05090
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function SK_BLD_TrapDoorHatch_Wood_AnimBP.SK_BLD_TrapDoorHatch_Wood_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x1a05090
	void ExecuteUbergraph_SK_BLD_TrapDoorHatch_Wood_AnimBP(int32_t EntryPoint); // Function SK_BLD_TrapDoorHatch_Wood_AnimBP.SK_BLD_TrapDoorHatch_Wood_AnimBP_C.ExecuteUbergraph_SK_BLD_TrapDoorHatch_Wood_AnimBP // (Final|UbergraphFunction) // @ game+0x1a05090
};

