// ControlRigBlueprintGeneratedClass SK_DPS_SML_DropShip_02_MID_CtrlRig.SK_DPS_SML_DropShip_02_MID_CtrlRig_C
// Size: 0x674 (Inherited: 0x650)
struct USK_DPS_SML_DropShip_02_MID_CtrlRig_C : UControlRig {
	float DoorExtend; // 0x650(0x04)
	float DoorInit; // 0x654(0x04)
	float DoorCurrent; // 0x658(0x04)
	bool DoorOpen?; // 0x65c(0x01)
	char pad_65D[0x3]; // 0x65d(0x03)
	float FloorHeight; // 0x660(0x04)
	float DoorRelative; // 0x664(0x04)
	float LadderExtention; // 0x668(0x04)
	float CurrentLadderExtention; // 0x66c(0x04)
	float DoorSpeed; // 0x670(0x04)
};

