// WidgetBlueprintGeneratedClass UMG_ProspectPin.UMG_ProspectPin_C
// Size: 0xbc9 (Inherited: 0x260)
struct UUMG_ProspectPin_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* HoverAnimation; // 0x268(0x08)
	struct UTextBlock* ActiveInsessiontext; // 0x270(0x08)
	struct UBorder* ActivePlayers; // 0x278(0x08)
	struct UBorder* AssignedPlayers; // 0x280(0x08)
	struct UTextBlock* AssignedPlayersText; // 0x288(0x08)
	struct UBorder* BackgroundHostName; // 0x290(0x08)
	struct UBorder* BackgroundProspectPin; // 0x298(0x08)
	struct UBorder* BackgroundSlot; // 0x2a0(0x08)
	struct UBorder* BackgroundSlot_2; // 0x2a8(0x08)
	struct UButton* ButtonBase; // 0x2b0(0x08)
	struct UImage* CoinIcon; // 0x2b8(0x08)
	struct UOverlay* CostDetails; // 0x2c0(0x08)
	struct UTextBlock* CostText; // 0x2c8(0x08)
	struct UTextBlock* Days; // 0x2d0(0x08)
	struct UTextBlock* Days_2; // 0x2d8(0x08)
	struct UTextBlock* Days_3; // 0x2e0(0x08)
	struct UTextBlock* Days_4; // 0x2e8(0x08)
	struct UTextBlock* Days_5; // 0x2f0(0x08)
	struct UVerticalBox* DifficultyExoticsVbox; // 0x2f8(0x08)
	struct UHorizontalBox* DifficultyHbox; // 0x300(0x08)
	struct UTextBlock* DifficultyText; // 0x308(0x08)
	struct UImage* DifficutlyIcon; // 0x310(0x08)
	struct UBorder* Divider; // 0x318(0x08)
	struct UImage* ExoticPlaceholder; // 0x320(0x08)
	struct UHorizontalBox* ExoticsHbox; // 0x328(0x08)
	struct UOverlay* FactionMission; // 0x330(0x08)
	struct UBorder* FilledBorder; // 0x338(0x08)
	struct UBorder* FrameProspectPin; // 0x340(0x08)
	struct UImage* HostIcon; // 0x348(0x08)
	struct UTextBlock* HostName; // 0x350(0x08)
	struct UOverlay* HostNameOverlay; // 0x358(0x08)
	struct UTextBlock* Hours; // 0x360(0x08)
	struct UBorder* HoveredButtonBorder; // 0x368(0x08)
	struct UTextBlock* HoveredButtonText; // 0x370(0x08)
	struct UImage* HoveredLines; // 0x378(0x08)
	struct UOverlay* HoverEffects; // 0x380(0x08)
	struct UOverlay* HoverPrompt; // 0x388(0x08)
	struct UTextBlock* Minutes; // 0x390(0x08)
	struct UTextBlock* PersistantText; // 0x398(0x08)
	struct UHorizontalBox* PlayerSlots; // 0x3a0(0x08)
	struct UImage* Pointer; // 0x3a8(0x08)
	struct UBorder* PointerBorder; // 0x3b0(0x08)
	struct UBorder* PointerFrame; // 0x3b8(0x08)
	struct UBorder* PromptBorder; // 0x3c0(0x08)
	struct URichTextBlock* PromptText; // 0x3c8(0x08)
	struct UTextBlock* ProspectName; // 0x3d0(0x08)
	struct UBorder* ProspectTitleBackground; // 0x3d8(0x08)
	struct UTextBlock* Seconds; // 0x3e0(0x08)
	struct UImage* SlotsIcon; // 0x3e8(0x08)
	struct UImage* SlotsIcon_2; // 0x3f0(0x08)
	struct UTextBlock* SlotsTitle; // 0x3f8(0x08)
	struct UTextBlock* SlotsTitle_2; // 0x400(0x08)
	struct UHorizontalBox* Time; // 0x408(0x08)
	struct UBorder* TimeBorder; // 0x410(0x08)
	struct UUMG_ProspectPinFactionMission_C* UMG_ProspectPinFactionMission; // 0x418(0x08)
	struct UOverlay* VersionMismatch; // 0x420(0x08)
	struct UBorder* VersionNumber; // 0x428(0x08)
	struct UTextBlock* VersionText; // 0x430(0x08)
	struct FSlateColor TitleText_Hovered; // 0x438(0x28)
	struct FSlateColor TitleText_Default; // 0x460(0x28)
	struct FSlateColor DetailTitleText_Default; // 0x488(0x28)
	struct FFProspectServerInfo ProspectInfo; // 0x4b0(0x190)
	struct FOnlineProspectInfo CurrentOnlineProspect; // 0x640(0x150)
	enum class E_ProspectState ProspectState; // 0x790(0x01)
	char pad_791[0x7]; // 0x791(0x07)
	struct FMulticastInlineDelegate ProspectSelected; // 0x798(0x10)
	struct FSlateColor DifficultyText_Easy; // 0x7a8(0x28)
	struct FSlateColor DifficultyText_Normal; // 0x7d0(0x28)
	struct FSlateColor DifficultyText_Hard; // 0x7f8(0x28)
	struct FSlateColor DifficultyText_Extreme; // 0x820(0x28)
	struct FSlateColor DifficultyTextColor; // 0x848(0x28)
	struct FSlateColor SlotsText_Hover; // 0x870(0x28)
	bool Hovered; // 0x898(0x01)
	bool Pressed; // 0x899(0x01)
	char pad_89A[0x6]; // 0x89a(0x06)
	struct FSlateColor TitleText_Pressed; // 0x8a0(0x28)
	struct FLinearColor Frame_Default; // 0x8c8(0x10)
	struct FLinearColor Frame_Hovered; // 0x8d8(0x10)
	struct FLinearColor Frame_Pressed; // 0x8e8(0x10)
	enum class E_PinState Pin State; // 0x8f8(0x01)
	char pad_8F9[0x3]; // 0x8f9(0x03)
	struct FLinearColor Title; // 0x8fc(0x10)
	struct FLinearColor TitleBackground_Default; // 0x90c(0x10)
	struct FLinearColor TitleBackground_Hover; // 0x91c(0x10)
	struct FLinearColor TitleBackground_Pressed; // 0x92c(0x10)
	struct FLinearColor Background_Hovered; // 0x93c(0x10)
	struct FLinearColor Background_Pressed; // 0x94c(0x10)
	struct FLinearColor Background_Default; // 0x95c(0x10)
	char pad_96C[0x4]; // 0x96c(0x04)
	struct FSlateColor Black; // 0x970(0x28)
	struct FLinearColor Claimed_Default; // 0x998(0x10)
	struct FLinearColor Claimed_Hover; // 0x9a8(0x10)
	struct FLinearColor Claimed_Pressed; // 0x9b8(0x10)
	struct FLinearColor Claimable_Default; // 0x9c8(0x10)
	struct FLinearColor Claimable_Hover; // 0x9d8(0x10)
	struct FLinearColor Claimable_Pressed; // 0x9e8(0x10)
	struct FSlateColor Detail Title Text Default; // 0x9f8(0x28)
	struct FLinearColor OpenDefault; // 0xa20(0x10)
	struct FLinearColor Open_Hover; // 0xa30(0x10)
	struct FLinearColor Open_Pressed; // 0xa40(0x10)
	struct FLinearColor Joined Default; // 0xa50(0x10)
	struct FLinearColor Joined_Hover; // 0xa60(0x10)
	struct FLinearColor Joined Pressed; // 0xa70(0x10)
	struct FLinearColor CalimableFrame Default; // 0xa80(0x10)
	struct FSlateColor ClaimableTitle; // 0xa90(0x28)
	struct TMap<enum class EIcarusProspectDifficulty, struct FColor> DifficultyColourMap; // 0xab8(0x50)
	struct FSlateColor CoinDefault; // 0xb08(0x28)
	struct FSlateColor CoinHovered; // 0xb30(0x28)
	struct FSlateColor CoinPressed; // 0xb58(0x28)
	struct FLinearColor Occupied Default; // 0xb80(0x10)
	struct FLinearColor Occupied Hovered; // 0xb90(0x10)
	struct FLinearColor Occupied Pressed; // 0xba0(0x10)
	bool Active; // 0xbb0(0x01)
	char pad_BB1[0x7]; // 0xbb1(0x07)
	struct FMulticastInlineDelegate ProspectExpired; // 0xbb8(0x10)
	bool Is Persistent; // 0xbc8(0x01)

	void SetHoverdPrompt(enum class E_ProspectState ProspectState); // Function UMG_ProspectPin.UMG_ProspectPin_C.SetHoverdPrompt // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void SetPromptText(enum class E_ProspectState ProspectState); // Function UMG_ProspectPin.UMG_ProspectPin_C.SetPromptText // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void SetHasClaimedProspect(); // Function UMG_ProspectPin.UMG_ProspectPin_C.SetHasClaimedProspect // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void SetTime(struct TArray<struct FString> Time); // Function UMG_ProspectPin.UMG_ProspectPin_C.SetTime // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void SetState(enum class E_ProspectState NewState); // Function UMG_ProspectPin.UMG_ProspectPin_C.SetState // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void Update Pin Visuals(enum class E_PinState PinState); // Function UMG_ProspectPin.UMG_ProspectPin_C.Update Pin Visuals // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void SetProspectInfo(struct FFProspectServerInfo Prospect); // Function UMG_ProspectPin.UMG_ProspectPin_C.SetProspectInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void BndEvt__ButtonBase_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function UMG_ProspectPin.UMG_ProspectPin_C.BndEvt__ButtonBase_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1a05090
	void BndEvt__ButtonBase_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function UMG_ProspectPin.UMG_ProspectPin_C.BndEvt__ButtonBase_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1a05090
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function UMG_ProspectPin.UMG_ProspectPin_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1a05090
	void BndEvt__ButtonBase_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature(); // Function UMG_ProspectPin.UMG_ProspectPin_C.BndEvt__ButtonBase_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1a05090
	void BndEvt__ButtonBase_K2Node_ComponentBoundEvent_5_OnButtonReleasedEvent__DelegateSignature(); // Function UMG_ProspectPin.UMG_ProspectPin_C.BndEvt__ButtonBase_K2Node_ComponentBoundEvent_5_OnButtonReleasedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1a05090
	void BndEvt__ButtonBase_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function UMG_ProspectPin.UMG_ProspectPin_C.BndEvt__ButtonBase_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1a05090
	void ExecuteUbergraph_UMG_ProspectPin(int32_t EntryPoint); // Function UMG_ProspectPin.UMG_ProspectPin_C.ExecuteUbergraph_UMG_ProspectPin // (Final|UbergraphFunction|HasDefaults) // @ game+0x1a05090
	void ProspectExpired__DelegateSignature(); // Function UMG_ProspectPin.UMG_ProspectPin_C.ProspectExpired__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
	void ProspectSelected__DelegateSignature(struct FFProspectServerInfo Prospect, bool Active); // Function UMG_ProspectPin.UMG_ProspectPin_C.ProspectSelected__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x1a05090
};

