// AnimBlueprintGeneratedClass 1ST_CHA_RIG_AnimBP.1ST_CHA_RIG_AnimBP_C
// Size: 0x4488 (Inherited: 0x2e0)
struct U1ST_CHA_RIG_AnimBP_C : UIcarusCharacterAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2e0(0x08)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x2e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x310(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x338(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x420(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x450(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x538(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x568(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x618(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x660(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x7b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x7e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x808(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x830(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x858(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x880(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x8a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x8d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x8f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x920(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x948(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x970(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x998(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x9c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x9e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xa10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xa38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xa60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xa88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xab0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xad8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0xb00(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0xb80(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0xbb0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0xc50(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0xcd0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0xd50(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0xd80(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0xe00(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xe30(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0xeb0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0xee0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0xf90(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xfc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xfe8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x1010(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x1038(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x1060(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x10e0(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1110(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x11d8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x1228(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x1278(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x12a8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x1328(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x1358(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1408(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x1438(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x14b8(0x30)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x14e8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x1508(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x1528(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1630(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x16b0(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x1750(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x17a0(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x17f0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1890(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x1910(0xa0)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization_2; // 0x19b0(0x70)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1a20(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1a50(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1ad0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x1b50(0xa0)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x1bf0(0x70)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1c60(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1c90(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1d10(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1d40(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x1dc0(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x1e80(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1f20(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1fa0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x1fd0(0x28)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x1ff8(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x20a8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x20d8(0x118)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_2; // 0x21f0(0x38)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0x2228(0xd0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x22f8(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x23a8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x23d0(0x158)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x2528(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x2610(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0x26d0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2700(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x2728(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2750(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2778(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x27a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x27d0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x2850(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x2880(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2900(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2930(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x29b0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x29e0(0xb0)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive; // 0x2a90(0x38)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x2ac8(0xd0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x2b98(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2c38(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x2cd8(0x50)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x2d28(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x2d70(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x2db8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x2dd8(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x2df8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x2e40(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x2e88(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2eb0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x2ed8(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x2f20(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x3028(0x108)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x3130(0x50)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3180(0x118)
	char pad_3298[0x8]; // 0x3298(0x08)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik; // 0x32a0(0x190)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x3430(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x3478(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x34c0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x35c8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x35e8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x3608(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3710(0xc0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x37d0(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x38d8(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3900(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3920(0x20)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x3940(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3970(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3a10(0xe8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3af8(0x158)
	struct ABP_IcarusPlayerCharacterSurvival_C* OwningBPCharacter; // 0x3c50(0x08)
	float CurrentVelocity; // 0x3c58(0x04)
	float EasedCurrentVelocity; // 0x3c5c(0x04)
	struct FRangedWeaponData RangedWeaponData; // 0x3c60(0xd0)
	bool IsADS; // 0x3d30(0x01)
	char pad_3D31[0x3]; // 0x3d31(0x03)
	float ChargePower; // 0x3d34(0x04)
	bool IsReloading; // 0x3d38(0x01)
	bool IsFiring; // 0x3d39(0x01)
	char pad_3D3A[0x6]; // 0x3d3a(0x06)
	struct TSoftObjectPtr<UBlendSpaceBase> LocomotionBS; // 0x3d40(0x28)
	enum class EAnimOverlayState OverlayState; // 0x3d68(0x01)
	bool IsCrouched; // 0x3d69(0x01)
	bool RequestedJump; // 0x3d6a(0x01)
	bool IsGrounded; // 0x3d6b(0x01)
	bool IsJumping; // 0x3d6c(0x01)
	bool IsFalling; // 0x3d6d(0x01)
	char pad_3D6E[0x2]; // 0x3d6e(0x02)
	float LocomotionCamBoneWeight; // 0x3d70(0x04)
	bool ShowHandsWhenUnequipped; // 0x3d74(0x01)
	char pad_3D75[0xb]; // 0x3d75(0x0b)
	struct FFocusableData CurrentFocusableData; // 0x3d80(0x1b0)
	bool IsSprinting; // 0x3f30(0x01)
	char pad_3F31[0x3]; // 0x3f31(0x03)
	float AimPlayRate; // 0x3f34(0x04)
	struct FVector GripSocketLocation; // 0x3f38(0x0c)
	float IKAlpha; // 0x3f44(0x04)
	float TargetRecoil; // 0x3f48(0x04)
	float CurrentRecoil; // 0x3f4c(0x04)
	struct FFirearmAnimData FirearmData; // 0x3f50(0x130)
	struct TArray<struct UObject*> FocusableAnims; // 0x4080(0x10)
	struct TArray<struct UObject*> BowDataAnims; // 0x4090(0x10)
	bool HasFinishedLoadingFocusableAnims; // 0x40a0(0x01)
	char pad_40A1[0x3]; // 0x40a1(0x03)
	float ThrowStrength; // 0x40a4(0x04)
	struct UBP_ActionableBehaviour_Throwable_C* ThrowableRef; // 0x40a8(0x08)
	bool IsDrawingThrowable; // 0x40b0(0x01)
	bool Reeling; // 0x40b1(0x01)
	bool IsCasting; // 0x40b2(0x01)
	bool Casted; // 0x40b3(0x01)
	char pad_40B4[0xc]; // 0x40b4(0x0c)
	struct FTransform MeshOffset; // 0x40c0(0x30)
	struct FRotator WorldRotation; // 0x40f0(0x0c)
	struct FRotator DeltaRotation; // 0x40fc(0x0c)
	float ADSAlpha; // 0x4108(0x04)
	bool WantsToThrow; // 0x410c(0x01)
	char pad_410D[0x3]; // 0x410d(0x03)
	struct FTransform ItemAttachOffset; // 0x4110(0x30)
	float LandedTimeStamp; // 0x4140(0x04)
	bool IsUnderwater; // 0x4144(0x01)
	char pad_4145[0x3]; // 0x4145(0x03)
	float Direction; // 0x4148(0x04)
	char pad_414C[0x4]; // 0x414c(0x04)
	struct FItemAnimationData CachedItemAnimations; // 0x4150(0x338)

	void VehicleLowerBody(struct FPoseLink LowerInPose, struct FPoseLink VehicleLowerBody); // Function 1ST_CHA_RIG_AnimBP.1ST_CHA_RIG_AnimBP_C.VehicleLowerBody // (HasOutParms|BlueprintCallable) // @ game+0x1a38c80
	void VehicleUpperBody(struct FPoseLink UpperInPose, struct FPoseLink VehicleUpperBody); // Function 1ST_CHA_RIG_AnimBP.1ST_CHA_RIG_AnimBP_C.VehicleUpperBody // (HasOutParms|BlueprintCallable) // @ game+0x1a38c80
	void AnimGraph(struct FPoseLink AnimGraph); // Function 1ST_CHA_RIG_AnimBP.1ST_CHA_RIG_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	bool IsSwimming(); // Function 1ST_CHA_RIG_AnimBP.1ST_CHA_RIG_AnimBP_C.IsSwimming // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1a38c80
