// AnimBlueprintGeneratedClass 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C
// Size: 0x2c80 (Inherited: 0x2e0)
struct U3RD_CHA_RIG_Space_AnimBP_C : UIcarusCharacterAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2e0(0x08)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x2e8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x3f0(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x4f8(0xc0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x5b8(0x108)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x6c0(0xc8)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_2; // 0x788(0xf8)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x880(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0xa60(0x1e0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0xc40(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xc60(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0xce0(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xd00(0x80)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0xd80(0xf8)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xe78(0x48)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xec0(0xc8)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0xf88(0x70)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0xff8(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x10b8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x10e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x1110(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x1138(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x1160(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1188(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x11b0(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1230(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x12f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1370(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x13f0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x1410(0x20)
	struct FAnimNode_ExtensionLimit AnimGraphNode_ExtensionLimit; // 0x1430(0xd8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x1508(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x1610(0x108)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1718(0x30)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_3; // 0x1748(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x17e8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1868(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x18e8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x19d0(0xe8)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x1ab8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1b58(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1bd8(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1c58(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x1d08(0xe8)
	struct FAnimNode_SpeedWarping3D AnimGraphNode_SpeedWarping3D; // 0x1df0(0xf0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x1ee0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x1fc8(0xe8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x20b0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x21b8(0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x21d8(0xe8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x22c0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x22e0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x23e8(0x108)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x24f0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x2590(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x2610(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2690(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26c0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2740(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2770(0xb0)
	struct FVector EffectorLocationRight; // 0x2820(0x0c)
	struct FVector JointTargetLocationRight; // 0x282c(0x0c)
	struct FVector EffectorLocationLeft; // 0x2838(0x0c)
	struct FVector JointTargetLocationLeft; // 0x2844(0x0c)
	struct FTransform EffectorTransformLeft; // 0x2850(0x30)
	struct FTransform EffectorTransformRight; // 0x2880(0x30)
	struct FHabHandStateStruct HandStateLeft; // 0x28b0(0x30)
	struct FHabHandStateStruct HandStateRight; // 0x28e0(0x30)
	struct TSoftObjectPtr<UBlendSpaceBase> LocomotionBS; // 0x2910(0x28)
	enum class EAnimOverlayState OverlayState; // 0x2938(0x01)
	char pad_2939[0x3]; // 0x2939(0x03)
	float ArmNormalisedTimeRight; // 0x293c(0x04)
	float ArmNormalisedTimeLeft; // 0x2940(0x04)
	float ArmInterpSpeed; // 0x2944(0x04)
	float 6DOFMovement; // 0x2948(0x04)
	float Speed; // 0x294c(0x04)
	float LocalDirection; // 0x2950(0x04)
	struct FVector FootEffectorLocationRight; // 0x2954(0x0c)
	struct FVector FootEffectorLocationLeft; // 0x2960(0x0c)
	struct FRotator HeadRotation; // 0x296c(0x0c)
	float LegIKRatioRight; // 0x2978(0x04)
	float LegIKRatioLeft; // 0x297c(0x04)
	float LegIKDistance; // 0x2980(0x04)
	float HorizontalAngle; // 0x2984(0x04)
	float VerticalAngle; // 0x2988(0x04)
	char pad_298C[0x4]; // 0x298c(0x04)
	struct FFocusableData CurrentFocusableData; // 0x2990(0x1b0)
	float EnableIKLeft; // 0x2b40(0x04)
	char pad_2B44[0x4]; // 0x2b44(0x04)
	struct FHabHandStateStruct FutureHandStateLeft; // 0x2b48(0x30)
	struct FHabHandStateStruct FutureHandStateRight; // 0x2b78(0x30)
	struct FVector PredictedLocalAcceleration; // 0x2ba8(0x0c)
	struct FVector MovementMarker; // 0x2bb4(0x0c)
	struct FVector HandRelativeMarkerOrigin; // 0x2bc0(0x0c)
	struct FVector CSMovementDirection; // 0x2bcc(0x0c)
	struct FRotator MovementOrientationOffset; // 0x2bd8(0x0c)
	int32_t MovementDirState; // 0x2be4(0x04)
	float MovementDirStateBlendTime; // 0x2be8(0x04)
	float VerticalMovementBlend; // 0x2bec(0x04)
	float SpeedTransition; // 0x2bf0(0x04)
	float SpeedScaling; // 0x2bf4(0x04)
	enum class EHandedness Handedness; // 0x2bf8(0x01)
	char pad_2BF9[0x3]; // 0x2bf9(0x03)
	struct FRotator EffectorRotationRight; // 0x2bfc(0x0c)
	struct FRotator EffectorRotationLeft; // 0x2c08(0x0c)
	struct FVector MSMovementDirection; // 0x2c14(0x0c)
	struct FRotator InvertedMovementOrientationOffset; // 0x2c20(0x0c)
	float EnableIKRight; // 0x2c2c(0x04)
	bool TouchOrGripLeft; // 0x2c30(0x01)
	bool TouchOrGripRight; // 0x2c31(0x01)
	char pad_2C32[0x2]; // 0x2c32(0x02)
	float TempGripTransition; // 0x2c34(0x04)
	float GripMovementLeft; // 0x2c38(0x04)
	float GripMovementRight; // 0x2c3c(0x04)
	float GripLerpLeft; // 0x2c40(0x04)
	float GripLerpRight; // 0x2c44(0x04)
	struct FVector LastGripPosLeft; // 0x2c48(0x0c)
	struct FVector LastGripPosRight; // 0x2c54(0x0c)
	bool GrippingGripTarget; // 0x2c60(0x01)
	char pad_2C61[0x3]; // 0x2c61(0x03)
	float MarkerPlacementTime; // 0x2c64(0x04)
	float MarkerSpeedAverage; // 0x2c68(0x04)
	char pad_2C6C[0x4]; // 0x2c6c(0x04)
	struct TArray<struct UObject*> CachedAnims; // 0x2c70(0x10)

	void AnimGraph(struct FPoseLink AnimGraph); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	float CalculateDistanceFromMarker(); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.CalculateDistanceFromMarker // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void UpdateLegIK(bool ForLeftLeg); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.UpdateLegIK // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void UpdateHandDistance(bool ForLeftHand); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.UpdateHandDistance // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void IsHandReaching(bool ForLeftHand, bool Return Value); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.IsHandReaching // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1a38c80
	struct FTransform GetHandTransform(bool ForLeftHand, enum class ERelativeTransformSpace TransformSpace); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.GetHandTransform // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1a38c80
	void UpdateFocusedItemState(); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.UpdateFocusedItemState // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	struct FHabHandStateStruct GetHandState(bool ForLeftHand); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.GetHandState // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1a38c80
	enum class ESpaceHandGripMode GetHandMode(bool ForLeftHand); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.GetHandMode // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1a38c80
	void UpdateHandIK(bool ForLeftHand); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.UpdateHandIK // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void EvaluateGraphExposedInputs_ExecuteUbergraph_3RD_CHA_RIG_Space_AnimBP_AnimGraphNode_TransitionResult_97C53E4E4D99883350EF4FA024CBE2ED(); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_3RD_CHA_RIG_Space_AnimBP_AnimGraphNode_TransitionResult_97C53E4E4D99883350EF4FA024CBE2ED // (BlueprintEvent) // @ game+0x1a38c80
	void EvaluateGraphExposedInputs_ExecuteUbergraph_3RD_CHA_RIG_Space_AnimBP_AnimGraphNode_TransitionResult_EC390B23494B30572AB6088B93623AB9(); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_3RD_CHA_RIG_Space_AnimBP_AnimGraphNode_TransitionResult_EC390B23494B30572AB6088B93623AB9 // (BlueprintEvent) // @ game+0x1a38c80
	void EvaluateGraphExposedInputs_ExecuteUbergraph_3RD_CHA_RIG_Space_AnimBP_AnimGraphNode_TransitionResult_C96CAF9F4D5BBC88BBFCAB92A2D2D612(); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_3RD_CHA_RIG_Space_AnimBP_AnimGraphNode_TransitionResult_C96CAF9F4D5BBC88BBFCAB92A2D2D612 // (BlueprintEvent) // @ game+0x1a38c80
	void EvaluateGraphExposedInputs_ExecuteUbergraph_3RD_CHA_RIG_Space_AnimBP_AnimGraphNode_TransitionResult_530185734784C9A1320330BC59F6F08D(); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_3RD_CHA_RIG_Space_AnimBP_AnimGraphNode_TransitionResult_530185734784C9A1320330BC59F6F08D // (BlueprintEvent) // @ game+0x1a38c80
	void EvaluateGraphExposedInputs_ExecuteUbergraph_3RD_CHA_RIG_Space_AnimBP_AnimGraphNode_TransitionResult_F58A755B4146E0ED69BBD599302F2AE0(); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_3RD_CHA_RIG_Space_AnimBP_AnimGraphNode_TransitionResult_F58A755B4146E0ED69BBD599302F2AE0 // (BlueprintEvent) // @ game+0x1a38c80
	void OnLoaded_2B8B2B624CE5F97DAE6892B7BDDA3108(struct UObject* Loaded); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.OnLoaded_2B8B2B624CE5F97DAE6892B7BDDA3108 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x1a38c80
	void BlueprintBeginPlay(); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.BlueprintBeginPlay // (Event|Public|BlueprintEvent) // @ game+0x1a38c80
	void OnFocusedItemUpdated(struct AIcarusItem* Item); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.OnFocusedItemUpdated // (Event|Public|BlueprintEvent) // @ game+0x1a38c80
	void PlaceMovementMarker(); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.PlaceMovementMarker // (BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void ExecuteUbergraph_3RD_CHA_RIG_Space_AnimBP(int32_t EntryPoint); // Function 3RD_CHA_RIG_Space_AnimBP.3RD_CHA_RIG_Space_AnimBP_C.ExecuteUbergraph_3RD_CHA_RIG_Space_AnimBP // (Final|UbergraphFunction|HasDefaults) // @ game+0x1a38c80
};

