// BlueprintGeneratedClass BP_IcarusPlayerControllerSurvival.BP_IcarusPlayerControllerSurvival_C
// Size: 0xa78 (Inherited: 0x838)
struct ABP_IcarusPlayerControllerSurvival_C : AIcarusPlayerControllerSurvival {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x838(0x08)
	struct UBP_HuntingManager_C* BP_HuntingManager; // 0x840(0x08)
	struct UBP_CriticalHitComponent_C* BP_CriticalHitComponent; // 0x848(0x08)
	struct UBP_NetworkProxyComponent_C* BP_NetworkProxyComponent; // 0x850(0x08)
	struct UUMG_UserInterface_C* UserInterface; // 0x858(0x08)
	struct UInventory* EnvirosuitInventoryReference; // 0x860(0x08)
	struct UInventory* BackpackInventoryReference; // 0x868(0x08)
	struct UInventory* QuickbarInventoryReference; // 0x870(0x08)
	bool FocusedOnObject; // 0x878(0x01)
	char pad_879[0x7]; // 0x879(0x07)
	struct UInventory* EquipmentInventoryReference; // 0x880(0x08)
	int32_t CurrentSessionEndTime; // 0x888(0x04)
	char pad_88C[0x4]; // 0x88c(0x04)
	struct FMulticastInlineDelegate ChatMessageArrived; // 0x890(0x10)
	struct FMulticastInlineDelegate LocalMessageArrived; // 0x8a0(0x10)
	float CharacterProgressionUpdateDelay; // 0x8b0(0x04)
	char pad_8B4[0x4]; // 0x8b4(0x04)
	struct UInventory* UpgradeInventoryRef; // 0x8b8(0x08)
	struct UInventory* VisionInventoryRef; // 0x8c0(0x08)
	int32_t LastFocusedHotbarSlot; // 0x8c8(0x04)
	char pad_8CC[0x4]; // 0x8cc(0x04)
	struct ABP_SpectatorActor_C* SpectatorActor; // 0x8d0(0x08)
	float DBNOHoldLength; // 0x8d8(0x04)
	float DBNOHoldTimestamp; // 0x8dc(0x04)
	struct FCharacterLoadout LastLoadout; // 0x8e0(0x138)
	struct FVector LastCameraLocation; // 0xa18(0x0c)
	bool DebugCameraLocationChanges; // 0xa24(0x01)
	char pad_A25[0x3]; // 0xa25(0x03)
	struct FMulticastInlineDelegate NetworkDebugInfoUpdated; // 0xa28(0x10)
	struct FMulticastInlineDelegate OnRevived; // 0xa38(0x10)
	float OutOfBoundsTimestamp; // 0xa48(0x04)
	float OutOfBoundsMaxTime; // 0xa4c(0x04)
	struct FTimerHandle OutOfBoundsTimerHandle; // 0xa50(0x08)
	bool IsRunningUnStuckEQS; // 0xa58(0x01)
	char pad_A59[0x7]; // 0xa59(0x07)
	struct FTimerHandle HeatmapBoundsTimer; // 0xa60(0x08)
	struct FMulticastInlineDelegate ServerMessage; // 0xa68(0x10)

	void GetUserInterface(struct UUMG_UserInterface_Base_C* UserInterface); // Function BP_IcarusPlayerControllerSurvival.BP_IcarusPlayerControllerSurvival_C.GetUserInterface // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void GatherMetaItems(struct TArray<struct FMetaItem> OutMetaItems, struct TArray<struct FMetaResource> OutMetaResources); // Function BP_IcarusPlayerControllerSurvival.BP_IcarusPlayerControllerSurvival_C.GatherMetaItems // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const) // @ game+0x1a38c80
