// Class Icarus.TraitBehaviour
// Size: 0xc0 (Inherited: 0xb0)
struct UTraitBehaviour : UActorComponent {
	struct UTraitBehaviours* OwningComponent; // 0xb0(0x08)
	bool bBehaviourDelegatesBound; // 0xb8(0x01)
	char pad_B9[0x7]; // 0xb9(0x07)

	void OnTraitAnimNotify(struct FAnimNotifyEvent Notify, struct AActor* AnimInstancePawn); // Function Icarus.TraitBehaviour.OnTraitAnimNotify // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x16dc9b0
	void OnRep_OwningComponent(); // Function Icarus.TraitBehaviour.OnRep_OwningComponent // (Native|Event|Protected|BlueprintEvent) // @ game+0x1500cd0
};

// Class Icarus.ActionableBehaviour
// Size: 0x2c0 (Inherited: 0xc0)
struct UActionableBehaviour : UTraitBehaviour {
	struct TArray<enum class EActionableEventType> ActionEventTypes; // 0xc0(0x10)
	struct FActionsRowHandle ActionRowHandle; // 0xd0(0x18)
	struct TMap<enum class EActionableEventType, struct FStaminaActionCostsRowHandle> StaminaCosts; // 0xe8(0x50)
	struct FMulticastInlineDelegate OnCooldownElapsed; // 0x138(0x10)
	struct FModifierStatesRowHandle ModifierRowHandle; // 0x148(0x18)
	char pad_160[0x50]; // 0x160(0x50)
	struct UCharacterState* OwnerActorState; // 0x1b0(0x08)
	struct AActor* OwnerActor; // 0x1b8(0x08)
	char pad_1C0[0xf8]; // 0x1c0(0xf8)
	struct UIcarusAnimInstance* AnimatingMeshAnimInstance; // 0x2b8(0x08)

	void PerformActionFromMenu(struct AActor* InvokingActor); // Function Icarus.ActionableBehaviour.PerformActionFromMenu // (Event|Public|BlueprintEvent) // @ game+0x1a38c80
	void PerformAction(struct AActor* InvokingActor, enum class EActionableEventType OnActionType, enum class EActionableTrigger ActionTrigger); // Function Icarus.ActionableBehaviour.PerformAction // (Native|Event|Public|BlueprintEvent) // @ game+0x14d07d0
	void OnUsedFromMenu(struct AActor* InvokingActor); // Function Icarus.ActionableBehaviour.OnUsedFromMenu // (Final|Native|Public) // @ game+0x14d0740
	void OnActionNotify(struct FName NotifyName); // Function Icarus.ActionableBehaviour.OnActionNotify // (Final|Native|Private) // @ game+0x14d0570
	void OnActionInsufficientStamina(enum class EActionableTrigger ActionTrigger); // Function Icarus.ActionableBehaviour.OnActionInsufficientStamina // (Native|Event|Public|BlueprintEvent) // @ game+0x14d04f0
	void OnActionInsufficientDurability(enum class EActionableTrigger ActionTrigger); // Function Icarus.ActionableBehaviour.OnActionInsufficientDurability // (Native|Event|Public|BlueprintEvent) // @ game+0x14d0470
	void OnActionHit(struct AActor* InvokingActor, struct UPrimitiveComponent* OverlappedComponent, struct FHitResult SweepResult); // Function Icarus.ActionableBehaviour.OnActionHit // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x14d02e0
	void OnActionAborted(enum class EActionableEventType EventType); // Function Icarus.ActionableBehaviour.OnActionAborted // (Native|Event|Public|BlueprintEvent) // @ game+0x14d0260
	void OnAction(struct AActor* InvokingActor, enum class EActionableEventType OnActionType, enum class EActionableTrigger ActionTrigger); // Function Icarus.ActionableBehaviour.OnAction // (Final|Native|Public) // @ game+0x14d0150
	void NetMulti_OnActionInsufficientStamina(enum class EActionableTrigger ActionTrigger); // Function Icarus.ActionableBehaviour.NetMulti_OnActionInsufficientStamina // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x14cfec0
	void Multicast_NotifyCurrentActionAborted(enum class EActionableEventType EventType); // Function Icarus.ActionableBehaviour.Multicast_NotifyCurrentActionAborted // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x14cfd20
	bool IsActionAborted(enum class EActionableEventType EventType); // Function Icarus.ActionableBehaviour.IsActionAborted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14cf610
	bool HasCooldownElapsed(enum class EActionableEventType ActionType); // Function Icarus.ActionableBehaviour.HasCooldownElapsed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14cf460
	struct FStaminaCost GetStaminaCostForEventType(enum class EActionableEventType EventType); // Function Icarus.ActionableBehaviour.GetStaminaCostForEventType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14cf350
	struct TArray<struct FRowHandle> GetGenericData(); // Function Icarus.ActionableBehaviour.GetGenericData // (Final|Native|Public|BlueprintCallable) // @ game+0x14cf2d0
	float GetCooldownSpeedMultiplier(); // Function Icarus.ActionableBehaviour.GetCooldownSpeedMultiplier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14cf2a0
	float GetCooldownDuration(); // Function Icarus.ActionableBehaviour.GetCooldownDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14cf270
	struct USkeletalMeshComponent* GetAnimatingMesh(); // Function Icarus.ActionableBehaviour.GetAnimatingMesh // (Native|Event|Public|BlueprintEvent) // @ game+0x14cf1a0
	bool GetActionData(struct FActionData OutData); // Function Icarus.ActionableBehaviour.GetActionData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x14ceaf0
	struct UActionableComponent* GetActionableComponent(); // Function Icarus.ActionableBehaviour.GetActionableComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14ced70
	void CheckCurrentActionAborted(struct UActorState* ActorStateIn, int32_t UID); // Function Icarus.ActionableBehaviour.CheckCurrentActionAborted // (Final|Native|Private) // @ game+0x14ce7f0
	void CancelStaminaActionForEventType(enum class EActionableEventType EventType); // Function Icarus.ActionableBehaviour.CancelStaminaActionForEventType // (Final|Native|Public|BlueprintCallable) // @ game+0x14ce650
	bool BP_ShouldApplyEndStaminaCost(enum class EActionableEventType EventType); // Function Icarus.ActionableBehaviour.BP_ShouldApplyEndStaminaCost // (Native|Event|Public|BlueprintEvent) // @ game+0x14ce3e0
	void BeginActionCooldown(enum class EActionableEventType ActionableEvent); // Function Icarus.ActionableBehaviour.BeginActionCooldown // (Final|Native|Public|BlueprintCallable) // @ game+0x14ce470
	void ActionComplete(enum class EActionableEventType ActionType); // Function Icarus.ActionableBehaviour.ActionComplete // (Final|Native|Public|BlueprintCallable) // @ game+0x14ce060
	void AbortAction(enum class EActionableEventType EventType, bool bApplyEndActionStaminaCost); // Function Icarus.ActionableBehaviour.AbortAction // (Final|Native|Public|BlueprintCallable) // @ game+0x14cde40
};

// Class Icarus.TraitComponent
// Size: 0xd0 (Inherited: 0xb0)
struct UTraitComponent : UActorComponent {
	struct FMulticastSparseDelegate DynamicDataUpdated; // 0xb0(0x01)
	char pad_B1[0x3]; // 0xb1(0x03)
	struct FRowHandle DataRowHandle; // 0xb4(0x18)
	char pad_CC[0x4]; // 0xcc(0x04)

	void OnRep_DataRowHandle(); // Function Icarus.TraitComponent.OnRep_DataRowHandle // (Final|Native|Protected) // @ game+0x16dcb30
	void OnDataSet(); // Function Icarus.TraitComponent.OnDataSet // (Native|Event|Protected|BlueprintEvent) // @ game+0x1500cd0
	void OnAnimNotify(struct FAnimNotifyEvent Notify, struct AActor* AnimInstancePawn); // Function Icarus.TraitComponent.OnAnimNotify // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x16dc9b0
	struct UTraitComponent* GetTraitClassFromData(struct FRowHandle ItemDataRow); // Function Icarus.TraitComponent.GetTraitClassFromData // (Native|Public) // @ game+0x16db980
	struct AIcarusItem* GetOwnerIcarusItem(); // Function Icarus.TraitComponent.GetOwnerIcarusItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16db440
	struct AIcarusActor* GetOwnerIcarusActor(); // Function Icarus.TraitComponent.GetOwnerIcarusActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16db410
};

// Class Icarus.TraitBehaviours
// Size: 0xe8 (Inherited: 0xd0)
struct UTraitBehaviours : UTraitComponent {
	struct FMulticastSparseDelegate OnTraitAnimNotify; // 0xd0(0x01)
	char pad_D1[0x7]; // 0xd1(0x07)
	struct TArray<struct UTraitBehaviour*> OwnedBehaviours; // 0xd8(0x10)

	void RegisterBehaviour(struct UTraitBehaviour* Behaviour); // Function Icarus.TraitBehaviours.RegisterBehaviour // (Native|Event|Public|BlueprintEvent) // @ game+0x166e0f0
	struct UTraitBehaviour* GetFirstBehaviourOfType(struct UTraitBehaviour* Class); // Function Icarus.TraitBehaviours.GetFirstBehaviourOfType // (Final|Native|Public|BlueprintCallable) // @ game+0x16db370
	struct TArray<struct UTraitBehaviour*> GetBehaviours(); // Function Icarus.TraitBehaviours.GetBehaviours // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16db2e0
	void CreateBehaviours(); // Function Icarus.TraitBehaviours.CreateBehaviours // (Native|Event|Protected|BlueprintEvent) // @ game+0x15069f0
	struct UTraitBehaviour* CreateBehaviour(struct UTraitBehaviour* BehaviourClass); // Function Icarus.TraitBehaviours.CreateBehaviour // (Final|Native|Protected|BlueprintCallable) // @ game+0x16dade0
};

// Class Icarus.ActionableComponent
// Size: 0x158 (Inherited: 0xe8)
struct UActionableComponent : UTraitBehaviours {
	struct FMulticastSparseDelegate OnAction; // 0xe8(0x01)
	struct FMulticastSparseDelegate OnUsedFromMenu; // 0xe9(0x01)
	struct FMulticastSparseDelegate OnActionHit; // 0xea(0x01)
	struct FMulticastSparseDelegate OnAssociatedItemUpdated; // 0xeb(0x01)
	char pad_EC[0x54]; // 0xec(0x54)
	int32_t AssociatedItemInventoryId; // 0x140(0x04)
	int32_t AssociatedItemInventorySlot; // 0x144(0x04)
	int32_t DynamicState; // 0x148(0x04)
	int32_t GunCurrentMagSize; // 0x14c(0x04)
	int32_t CurrentAmmoType; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)

	void UseFromMenu(struct AActor* InvokingActor); // Function Icarus.ActionableComponent.UseFromMenu // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x14d1560
	void SetNewAssociatedItem(int32_t NewAssociatedItemInventoryId, int32_t NewAssocaitedItemSlot); // Function Icarus.ActionableComponent.SetNewAssociatedItem // (Final|Native|Public|BlueprintCallable) // @ game+0x14d1200
	void SetGunCurrentMagSize(int32_t NewGunCurrentMagSize); // Function Icarus.ActionableComponent.SetGunCurrentMagSize // (Final|Native|Public|BlueprintCallable) // @ game+0x14d1120
	void SetDynamicState(int32_t NewDynamicState); // Function Icarus.ActionableComponent.SetDynamicState // (Final|Native|Public|BlueprintCallable) // @ game+0x14d1090
	void SetCurrentAmmoType(int32_t NewCurrentAmmoType); // Function Icarus.ActionableComponent.SetCurrentAmmoType // (Final|Native|Public|BlueprintCallable) // @ game+0x14d0fb0
	void SetAssociatedItemInventorySlot(int32_t NewAssociatedItemInventorySlot); // Function Icarus.ActionableComponent.SetAssociatedItemInventorySlot // (Final|Native|Public|BlueprintCallable) // @ game+0x14d0e80
	void SetAssociatedItemInventoryId(int32_t NewAssociatedItemInventoryId); // Function Icarus.ActionableComponent.SetAssociatedItemInventoryId // (Final|Native|Public|BlueprintCallable) // @ game+0x14d0d50
	void Server_OwningClientActionableHitNamed(struct AActor* InvokingActor, struct AActor* OverlappedComponentOwner, struct FName OverlappedComponentName, struct FHitResult SweepResult); // Function Icarus.ActionableComponent.Server_OwningClientActionableHitNamed // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14d0bc0
	void Server_OwningClientActionableHit(struct AActor* InvokingActor, struct UPrimitiveComponent* OverlappedComponent, struct FHitResult SweepResult); // Function Icarus.ActionableComponent.Server_OwningClientActionableHit // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14d0a40
	void OnRep_CurrentAmmoType(); // Function Icarus.ActionableComponent.OnRep_CurrentAmmoType // (Final|Native|Public) // @ game+0x14d0720
	void OnHeldTimerExpired(struct AActor* InvokingActor, enum class EActionableEventType ActionType, bool bClientPrediction); // Function Icarus.ActionableComponent.OnHeldTimerExpired // (Final|Native|Public) // @ game+0x14d0600
	void Multicast_ActionableHitNamed(struct AActor* InvokingActor, struct AActor* OverlappedComponentOwner, struct FName OverlappedComponentName, struct FHitResult SweepResult); // Function Icarus.ActionableComponent.Multicast_ActionableHitNamed // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x14cfb90
	void Multicast_ActionableHit(struct AActor* InvokingActor, struct UPrimitiveComponent* OverlappedComponent, struct FHitResult SweepResult); // Function Icarus.ActionableComponent.Multicast_ActionableHit // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x14cfa10
	struct UActionableBehaviour* GetBehaviourForActionType(enum class EActionableEventType EventType); // Function Icarus.ActionableComponent.GetBehaviourForActionType // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x14cf1d0
	bool GetActionData(struct FActionsRowHandle ActionRowHandle, struct FActionData OutData); // Function Icarus.ActionableComponent.GetActionData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x14cebb0
	bool GetActionableData(struct FActionableData OutData); // Function Icarus.ActionableComponent.GetActionableData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x14ceda0
	void Action(struct AActor* InvokingActor, enum class EActionableEventType ActionType, enum class EActionableTrigger ActionTrigger, bool bClientPrediction); // Function Icarus.ActionableComponent.Action // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x14cdf10
};

// Class Icarus.ActionableLibrary
// Size: 0x28 (Inherited: 0x28)
struct UActionableLibrary : URowLibrary {

	struct FActionableRowHandle StructToRowHandle(struct FActionableEnum EnumValue); // Function Icarus.ActionableLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d14b0
	struct FName StructToName(struct FActionableEnum EnumValue); // Function Icarus.ActionableLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d1410
	int32_t StructToInt(struct FActionableEnum EnumValue); // Function Icarus.ActionableLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d1370
	struct FActionableEnum RowHandleToStruct(struct FActionableRowHandle RowHandle); // Function Icarus.ActionableLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d0980
	void RemoveRowFromActionableTable(struct FName Name); // Function Icarus.ActionableLibrary.RemoveRowFromActionableTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14d0900
	void RefreshConstants(); // Function Icarus.ActionableLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14d08e0
	int32_t NumRows(); // Function Icarus.ActionableLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d0120
	bool NotEqual_EnumName(struct FActionableEnum A, struct FName B); // Function Icarus.ActionableLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d0030
	bool NotEqual_EnumEnum(struct FActionableEnum A, struct FActionableEnum B); // Function Icarus.ActionableLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14cff40
	struct FActionableEnum NameToStruct(struct FName NameValue); // Function Icarus.ActionableLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14cfe30
	int32_t NameToInt(struct FName NameValue); // Function Icarus.ActionableLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14cfda0
	struct FActionableRowHandle MakeLiteralActionable(struct FActionableRowHandle RowHandle); // Function Icarus.ActionableLibrary.MakeLiteralActionable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14cf940
	struct FActionableRowHandle MakeActionableFromIndex(int32_t Index); // Function Icarus.ActionableLibrary.MakeActionableFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14cf8b0
	struct FActionableEnum MakeActionableEnum(struct FActionableEnum Enum); // Function Icarus.ActionableLibrary.MakeActionableEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14cf830
	struct FActionableRowHandle MakeActionable(struct FName RowName); // Function Icarus.ActionableLibrary.MakeActionable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14cf790
	bool IsValidName(struct FName NameValue); // Function Icarus.ActionableLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14cf700
	struct FActionableEnum IntToStruct(int32_t IntValue); // Function Icarus.ActionableLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14cf580
	struct FName IntToName(int32_t IntValue); // Function Icarus.ActionableLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14cf4f0
	void GetActionableStruct(struct FActionableRowHandle RowHandle, struct FActionableData Actionable, enum class EValid Paths); // Function Icarus.ActionableLibrary.GetActionableStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14cef90
	bool EqualEqual_FActionableRowHandleFActionableRowHandle(struct FActionableRowHandle RowHandleA, struct FActionableRowHandle RowHandleB); // Function Icarus.ActionableLibrary.EqualEqual_FActionableRowHandleFActionableRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ce9b0
	bool EqualEqual_EnumEnum(struct FActionableEnum A, struct FActionableEnum B); // Function Icarus.ActionableLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ce8c0
	struct FActionableRowHandle CastToActionableRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.ActionableLibrary.CastToActionableRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14ce6d0
	void BreakActionableEnum(struct FActionableEnum Enum, struct FName Name, int32_t Index); // Function Icarus.ActionableLibrary.BreakActionableEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14ce4f0
	void AddRowToActionableTable(struct FName Name, struct FActionableData Data, struct FActionableRowHandle NewRow); // Function Icarus.ActionableLibrary.AddRowToActionableTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14ce0e0
};

// Class Icarus.ActionableTable
// Size: 0xb8 (Inherited: 0xb8)
struct UActionableTable : UIcarusDataTable {
};

// Class Icarus.ActionsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UActionsLibrary : URowLibrary {

	struct FActionsRowHandle StructToRowHandle(struct FActionsEnum EnumValue); // Function Icarus.ActionsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d7590
	struct FName StructToName(struct FActionsEnum EnumValue); // Function Icarus.ActionsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d7450
	int32_t StructToInt(struct FActionsEnum EnumValue); // Function Icarus.ActionsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d7310
	struct FActionsEnum RowHandleToStruct(struct FActionsRowHandle RowHandle); // Function Icarus.ActionsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d6e70
	void RemoveRowFromActionsTable(struct FName Name); // Function Icarus.ActionsLibrary.RemoveRowFromActionsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14d6d30
	void RefreshConstants(); // Function Icarus.ActionsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14d6c60
	int32_t NumRows(); // Function Icarus.ActionsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d6ab0
	bool NotEqual_EnumName(struct FActionsEnum A, struct FName B); // Function Icarus.ActionsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d68d0
	bool NotEqual_EnumEnum(struct FActionsEnum A, struct FActionsEnum B); // Function Icarus.ActionsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d66f0
	struct FActionsEnum NameToStruct(struct FName NameValue); // Function Icarus.ActionsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d65d0
	int32_t NameToInt(struct FName NameValue); // Function Icarus.ActionsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14d64b0
	struct FActionsRowHandle MakeLiteralActions(struct FActionsRowHandle RowHandle); // Function Icarus.ActionsLibrary.MakeLiteralActions // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d61b0
	struct FActionsRowHandle MakeActionsFromIndex(int32_t Index); // Function Icarus.ActionsLibrary.MakeActionsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d5f70
	struct FActionsEnum MakeActionsEnum(struct FActionsEnum Enum); // Function Icarus.ActionsLibrary.MakeActionsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d5ef0
	struct FActionsRowHandle MakeActions(struct FName RowName); // Function Icarus.ActionsLibrary.MakeActions // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d5e50
	bool IsValidName(struct FName NameValue); // Function Icarus.ActionsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14d5d10
	struct FActionsEnum IntToStruct(int32_t IntValue); // Function Icarus.ActionsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d5b30
	struct FName IntToName(int32_t IntValue); // Function Icarus.ActionsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14d5a10
	void GetActionsStruct(struct FActionsRowHandle RowHandle, struct FActionData Actions, enum class EValid Paths); // Function Icarus.ActionsLibrary.GetActionsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14d5640
	bool EqualEqual_FActionsRowHandleFActionsRowHandle(struct FActionsRowHandle RowHandleA, struct FActionsRowHandle RowHandleB); // Function Icarus.ActionsLibrary.EqualEqual_FActionsRowHandleFActionsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d53c0
	bool EqualEqual_EnumEnum(struct FActionsEnum A, struct FActionsEnum B); // Function Icarus.ActionsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d51e0
	struct FActionsRowHandle CastToActionsRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.ActionsLibrary.CastToActionsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14d4f70
	void BreakActionsEnum(struct FActionsEnum Enum, struct FName Name, int32_t Index); // Function Icarus.ActionsLibrary.BreakActionsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14d4c80
	void AddRowToActionsTable(struct FName Name, struct FActionData Data, struct FActionsRowHandle NewRow); // Function Icarus.ActionsLibrary.AddRowToActionsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14d48e0
};

// Class Icarus.ActionsTable
// Size: 0xb8 (Inherited: 0xb8)
struct UActionsTable : UIcarusDataTable {
};

// Class Icarus.ActorState
// Size: 0x1f8 (Inherited: 0xb0)
struct UActorState : UActorComponent {
	struct FIcarusDamagePacket LastDamagePacket; // 0xb0(0xc0)
	char pad_170[0x8]; // 0x170(0x08)
	struct FMulticastInlineDelegate OnActorStateReady; // 0x178(0x10)
	struct FMulticastSparseDelegate OnActorDeath; // 0x188(0x01)
	struct FMulticastSparseDelegate OnAliveStateChanged; // 0x189(0x01)
	struct FMulticastSparseDelegate OnDamaged; // 0x18a(0x01)
	struct FMulticastSparseDelegate OnHealthUpdated; // 0x18b(0x01)
	struct FMulticastSparseDelegate OnShelterUpdated; // 0x18c(0x01)
	struct FMulticastSparseDelegate BiomeUpdated; // 0x18d(0x01)
	char pad_18E[0x2]; // 0x18e(0x02)
	int32_t Health; // 0x190(0x04)
	int32_t MaxHealth; // 0x194(0x04)
	float Shelter; // 0x198(0x04)
	int32_t ExternalTemperature; // 0x19c(0x04)
	struct FBiomesRowHandle CurrentBiome; // 0x1a0(0x18)
	enum class EAliveState CurrentAliveState; // 0x1b8(0x01)
	char pad_1B9[0x7]; // 0x1b9(0x07)
	struct UIcarusStatContainer* OwnerStatContainer; // 0x1c0(0x08)
	char pad_1C8[0xc]; // 0x1c8(0x0c)
	struct FBiomesRowHandle BiomeOverride; // 0x1d4(0x18)
	bool BlockBiomeUpdate; // 0x1ec(0x01)
	char pad_1ED[0x7]; // 0x1ed(0x07)
	bool bHasHealthRegen; // 0x1f4(0x01)
	char pad_1F5[0x3]; // 0x1f5(0x03)

	void WeatherTimeTick(float Delta); // Function Icarus.ActorState.WeatherTimeTick // (Final|Native|Private) // @ game+0x14d7880
	void TakeDamage(struct FIcarusDamagePacket DamagePacket); // Function Icarus.ActorState.TakeDamage // (Final|Native|Public) // @ game+0x14d76f0
	void StatContainerUpdated(); // Function Icarus.ActorState.StatContainerUpdated // (Native|Public) // @ game+0x14d72f0
	void SetShelter(float Amount); // Function Icarus.ActorState.SetShelter // (Final|Native|Public|BlueprintCallable) // @ game+0x14d7270
	void SetHealth(int32_t Amount); // Function Icarus.ActorState.SetHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x14d71e0
	void SetBlockBiomeUpdate(bool bLock); // Function Icarus.ActorState.SetBlockBiomeUpdate // (Final|Native|Public|BlueprintCallable) // @ game+0x14d7150
	void SetBiomeOverride(struct FBiomesRowHandle Biome); // Function Icarus.ActorState.SetBiomeOverride // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14d70a0
	void SetBiome(struct FBiomesRowHandle Biome); // Function Icarus.ActorState.SetBiome // (Final|Native|Public) // @ game+0x14d6ff0
	void Respawn(); // Function Icarus.ActorState.Respawn // (Native|Public|BlueprintCallable) // @ game+0x14d6e50
	void RequestBiomeUpdate(); // Function Icarus.ActorState.RequestBiomeUpdate // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14d6e30
	void RegenTick(float DeltaTime); // Function Icarus.ActorState.RegenTick // (Native|Public) // @ game+0x14d6ca0
	void RecalculateHealthRegenRate(); // Function Icarus.ActorState.RecalculateHealthRegenRate // (Final|Native|Protected) // @ game+0x14d6c40
	void RecalculateCurrentHealth(); // Function Icarus.ActorState.RecalculateCurrentHealth // (Final|Native|Protected) // @ game+0x14d6c20
	void OnRep_Health(); // Function Icarus.ActorState.OnRep_Health // (Final|Native|Protected) // @ game+0x14d6c00
	void OnRep_CurrentBiome(); // Function Icarus.ActorState.OnRep_CurrentBiome // (Final|Native|Protected) // @ game+0x14d6be0
	void OnRep_CurrentAliveState(); // Function Icarus.ActorState.OnRep_CurrentAliveState // (Final|Native|Protected) // @ game+0x14d6bc0
	void OnCurrentBiomeUpdated(struct FBiomesRowHandle NewBiome); // Function Icarus.ActorState.OnCurrentBiomeUpdated // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x14d6b10
	void Multicast_OnDamaged(int32_t InDamage, struct FDamageEvent DamageEvent, struct AController* Instigator, struct AActor* DamageCauser); // Function Icarus.ActorState.Multicast_OnDamaged // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x14d6350
	void Kill(); // Function Icarus.ActorState.Kill // (Final|Native|Public|BlueprintCallable) // @ game+0x14d5e30
	bool IsAlive(); // Function Icarus.ActorState.IsAlive // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14d5ce0
	void InternalTick(float DeltaTime); // Function Icarus.ActorState.InternalTick // (Native|Protected) // @ game+0x14d5c50
	float GetShelter(); // Function Icarus.ActorState.GetShelter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14d59e0
	int32_t GetMaxHealth(); // Function Icarus.ActorState.GetMaxHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14d59b0
	int32_t GetHealth(); // Function Icarus.ActorState.GetHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14d5980
	int32_t GetEnvironmentalTemperature(); // Function Icarus.ActorState.GetEnvironmentalTemperature // (Final|Native|Public) // @ game+0x14d5950
	int32_t ConsumeNextUID(); // Function Icarus.ActorState.ConsumeNextUID // (Final|Native|Public) // @ game+0x14d51b0
	bool CanRegenerateHealth(); // Function Icarus.ActorState.CanRegenerateHealth // (Native|Public|Const) // @ game+0x14d4f40
	void AddHealth(int32_t Amount); // Function Icarus.ActorState.AddHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x14d4850
};

// Class Icarus.IcarusStateRecorderComponent
// Size: 0xd8 (Inherited: 0xb0)
struct UIcarusStateRecorderComponent : UActorComponent {
	bool bBeginRecordingImmediately; // 0xb0(0x01)
	bool bRetainOnDestroy; // 0xb1(0x01)
	enum class EStateRecorderOwnerResolvePolicy OwnerResolvePolicy; // 0xb2(0x01)
	char pad_B3[0x1]; // 0xb3(0x01)
	struct FName ActorClassName; // 0xb4(0x08)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct FString ActorPathName; // 0xc0(0x10)
	bool bIsRecordingGameState; // 0xd0(0x01)
	bool bHasRecordedValidState; // 0xd1(0x01)
	char pad_D2[0x6]; // 0xd2(0x06)

	void OnResolvedOwnerEndPlay(struct AActor* ResolvedOwner, enum class EEndPlayReason EndPlayReason); // Function Icarus.IcarusStateRecorderComponent.OnResolvedOwnerEndPlay // (Final|Native|Public) // @ game+0x15fb7f0
	void EndRecording(); // Function Icarus.IcarusStateRecorderComponent.EndRecording // (Final|Native|Public|BlueprintCallable) // @ game+0x15fa970
	void BeginRecording(); // Function Icarus.IcarusStateRecorderComponent.BeginRecording // (Final|Native|Public|BlueprintCallable) // @ game+0x15fa930
};

// Class Icarus.ActorStateRecorderComponent
// Size: 0x150 (Inherited: 0xd8)
struct UActorStateRecorderComponent : UIcarusStateRecorderComponent {
	char pad_D8[0x8]; // 0xd8(0x08)
	struct FTransform ActorTransform; // 0xe0(0x30)
	struct TArray<struct FInventorySaveData> SavedInventories; // 0x110(0x10)
	struct FFLODActorComponentSaveData FLODComponentData; // 0x120(0x1c)
	int32_t IcarusActorGUID; // 0x13c(0x04)
	struct FName ObjectFName; // 0x140(0x08)
	char pad_148[0x8]; // 0x148(0x08)
};

// Class Icarus.AfflictionChanceLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAfflictionChanceLibrary : URowLibrary {

	struct FAfflictionChanceRowHandle StructToRowHandle(struct FAfflictionChanceEnum EnumValue); // Function Icarus.AfflictionChanceLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d7640
	struct FName StructToName(struct FAfflictionChanceEnum EnumValue); // Function Icarus.AfflictionChanceLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d74f0
	int32_t StructToInt(struct FAfflictionChanceEnum EnumValue); // Function Icarus.AfflictionChanceLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d73b0
	struct FAfflictionChanceEnum RowHandleToStruct(struct FAfflictionChanceRowHandle RowHandle); // Function Icarus.AfflictionChanceLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d6f30
	void RemoveRowFromAfflictionChanceTable(struct FName Name); // Function Icarus.AfflictionChanceLibrary.RemoveRowFromAfflictionChanceTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14d6db0
	void RefreshConstants(); // Function Icarus.AfflictionChanceLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14d6c80
	int32_t NumRows(); // Function Icarus.AfflictionChanceLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d6ae0
	bool NotEqual_EnumName(struct FAfflictionChanceEnum A, struct FName B); // Function Icarus.AfflictionChanceLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d69c0
	bool NotEqual_EnumEnum(struct FAfflictionChanceEnum A, struct FAfflictionChanceEnum B); // Function Icarus.AfflictionChanceLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d67e0
	struct FAfflictionChanceEnum NameToStruct(struct FName NameValue); // Function Icarus.AfflictionChanceLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d6660
	int32_t NameToInt(struct FName NameValue); // Function Icarus.AfflictionChanceLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14d6540
	struct FAfflictionChanceRowHandle MakeLiteralAfflictionChance(struct FAfflictionChanceRowHandle RowHandle); // Function Icarus.AfflictionChanceLibrary.MakeLiteralAfflictionChance // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d6280
	struct FAfflictionChanceRowHandle MakeAfflictionChanceFromIndex(int32_t Index); // Function Icarus.AfflictionChanceLibrary.MakeAfflictionChanceFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d6120
	struct FAfflictionChanceEnum MakeAfflictionChanceEnum(struct FAfflictionChanceEnum Enum); // Function Icarus.AfflictionChanceLibrary.MakeAfflictionChanceEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d60a0
	struct FAfflictionChanceRowHandle MakeAfflictionChance(struct FName RowName); // Function Icarus.AfflictionChanceLibrary.MakeAfflictionChance // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d6000
	bool IsValidName(struct FName NameValue); // Function Icarus.AfflictionChanceLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14d5da0
	struct FAfflictionChanceEnum IntToStruct(int32_t IntValue); // Function Icarus.AfflictionChanceLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d5bc0
	struct FName IntToName(int32_t IntValue); // Function Icarus.AfflictionChanceLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14d5aa0
	void GetAfflictionChanceStruct(struct FAfflictionChanceRowHandle RowHandle, struct FAfflictionChance AfflictionChance, enum class EValid Paths); // Function Icarus.AfflictionChanceLibrary.GetAfflictionChanceStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14d57c0
	bool EqualEqual_FAfflictionChanceRowHandleFAfflictionChanceRowHandle(struct FAfflictionChanceRowHandle RowHandleA, struct FAfflictionChanceRowHandle RowHandleB); // Function Icarus.AfflictionChanceLibrary.EqualEqual_FAfflictionChanceRowHandleFAfflictionChanceRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d5500
	bool EqualEqual_EnumEnum(struct FAfflictionChanceEnum A, struct FAfflictionChanceEnum B); // Function Icarus.AfflictionChanceLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14d52d0
	struct FAfflictionChanceRowHandle CastToAfflictionChanceRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.AfflictionChanceLibrary.CastToAfflictionChanceRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14d5090
	void BreakAfflictionChanceEnum(struct FAfflictionChanceEnum Enum, struct FName Name, int32_t Index); // Function Icarus.AfflictionChanceLibrary.BreakAfflictionChanceEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14d4de0
	void AddRowToAfflictionChanceTable(struct FName Name, struct FAfflictionChance Data, struct FAfflictionChanceRowHandle NewRow); // Function Icarus.AfflictionChanceLibrary.AddRowToAfflictionChanceTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14d4a50
};

// Class Icarus.AfflictionChanceTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAfflictionChanceTable : UIcarusDataTable {
};

// Class Icarus.AIAudioDataLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAIAudioDataLibrary : URowLibrary {

	struct FAIAudioDataRowHandle StructToRowHandle(struct FAIAudioDataEnum EnumValue); // Function Icarus.AIAudioDataLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dd9c0
	struct FName StructToName(struct FAIAudioDataEnum EnumValue); // Function Icarus.AIAudioDataLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dd7e0
	int32_t StructToInt(struct FAIAudioDataEnum EnumValue); // Function Icarus.AIAudioDataLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dd600
	struct FAIAudioDataEnum RowHandleToStruct(struct FAIAudioDataRowHandle RowHandle); // Function Icarus.AIAudioDataLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dd3c0
	void RemoveRowFromAIAudioDataTable(struct FName Name); // Function Icarus.AIAudioDataLibrary.RemoveRowFromAIAudioDataTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14dd240
	void RefreshConstants(); // Function Icarus.AIAudioDataLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14dd1e0
	int32_t NumRows(); // Function Icarus.AIAudioDataLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dd150
	bool NotEqual_EnumName(struct FAIAudioDataEnum A, struct FName B); // Function Icarus.AIAudioDataLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dce80
	bool NotEqual_EnumEnum(struct FAIAudioDataEnum A, struct FAIAudioDataEnum B); // Function Icarus.AIAudioDataLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dcbb0
	struct FAIAudioDataEnum NameToStruct(struct FName NameValue); // Function Icarus.AIAudioDataLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dca00
	int32_t NameToInt(struct FName NameValue); // Function Icarus.AIAudioDataLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14dc850
	struct FAIAudioDataRowHandle MakeLiteralAIAudioData(struct FAIAudioDataRowHandle RowHandle); // Function Icarus.AIAudioDataLibrary.MakeLiteralAIAudioData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dc5e0
	struct FAIAudioDataRowHandle MakeAIAudioDataFromIndex(int32_t Index); // Function Icarus.AIAudioDataLibrary.MakeAIAudioDataFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dc1f0
	struct FAIAudioDataEnum MakeAIAudioDataEnum(struct FAIAudioDataEnum Enum); // Function Icarus.AIAudioDataLibrary.MakeAIAudioDataEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dc170
	struct FAIAudioDataRowHandle MakeAIAudioData(struct FName RowName); // Function Icarus.AIAudioDataLibrary.MakeAIAudioData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dc0d0
	bool IsValidName(struct FName NameValue); // Function Icarus.AIAudioDataLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14dbf20
	struct FAIAudioDataEnum IntToStruct(int32_t IntValue); // Function Icarus.AIAudioDataLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dbd70
	struct FName IntToName(int32_t IntValue); // Function Icarus.AIAudioDataLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14dbbc0
	void GetAIAudioDataStruct(struct FAIAudioDataRowHandle RowHandle, struct FAIAudioData AIAudioData, enum class EValid Paths); // Function Icarus.AIAudioDataLibrary.GetAIAudioDataStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14db650
	bool EqualEqual_FAIAudioDataRowHandleFAIAudioDataRowHandle(struct FAIAudioDataRowHandle RowHandleA, struct FAIAudioDataRowHandle RowHandleB); // Function Icarus.AIAudioDataLibrary.EqualEqual_FAIAudioDataRowHandleFAIAudioDataRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14db290
	bool EqualEqual_EnumEnum(struct FAIAudioDataEnum A, struct FAIAudioDataEnum B); // Function Icarus.AIAudioDataLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dafc0
	struct FAIAudioDataRowHandle CastToAIAudioDataRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.AIAudioDataLibrary.CastToAIAudioDataRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14dac60
	void BreakAIAudioDataEnum(struct FAIAudioDataEnum Enum, struct FName Name, int32_t Index); // Function Icarus.AIAudioDataLibrary.BreakAIAudioDataEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14da840
	void AddRowToAIAudioDataTable(struct FName Name, struct FAIAudioData Data, struct FAIAudioDataRowHandle NewRow); // Function Icarus.AIAudioDataLibrary.AddRowToAIAudioDataTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14da050
};

// Class Icarus.AIAudioDataTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAIAudioDataTable : UIcarusDataTable {
};

// Class Icarus.AICreatureTypeLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAICreatureTypeLibrary : URowLibrary {

	struct FAICreatureTypeRowHandle StructToRowHandle(struct FAICreatureTypeEnum EnumValue); // Function Icarus.AICreatureTypeLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dda70
	struct FName StructToName(struct FAICreatureTypeEnum EnumValue); // Function Icarus.AICreatureTypeLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dd880
	int32_t StructToInt(struct FAICreatureTypeEnum EnumValue); // Function Icarus.AICreatureTypeLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dd6a0
	struct FAICreatureTypeEnum RowHandleToStruct(struct FAICreatureTypeRowHandle RowHandle); // Function Icarus.AICreatureTypeLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dd480
	void RemoveRowFromAICreatureTypeTable(struct FName Name); // Function Icarus.AICreatureTypeLibrary.RemoveRowFromAICreatureTypeTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14dd2c0
	void RefreshConstants(); // Function Icarus.AICreatureTypeLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14dd200
	int32_t NumRows(); // Function Icarus.AICreatureTypeLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dd180
	bool NotEqual_EnumName(struct FAICreatureTypeEnum A, struct FName B); // Function Icarus.AICreatureTypeLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dcf70
	bool NotEqual_EnumEnum(struct FAICreatureTypeEnum A, struct FAICreatureTypeEnum B); // Function Icarus.AICreatureTypeLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dcca0
	struct FAICreatureTypeEnum NameToStruct(struct FName NameValue); // Function Icarus.AICreatureTypeLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dca90
	int32_t NameToInt(struct FName NameValue); // Function Icarus.AICreatureTypeLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14dc8e0
	struct FAICreatureTypeRowHandle MakeLiteralAICreatureType(struct FAICreatureTypeRowHandle RowHandle); // Function Icarus.AICreatureTypeLibrary.MakeLiteralAICreatureType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dc6b0
	struct FAICreatureTypeRowHandle MakeAICreatureTypeFromIndex(int32_t Index); // Function Icarus.AICreatureTypeLibrary.MakeAICreatureTypeFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dc3a0
	struct FAICreatureTypeEnum MakeAICreatureTypeEnum(struct FAICreatureTypeEnum Enum); // Function Icarus.AICreatureTypeLibrary.MakeAICreatureTypeEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dc320
	struct FAICreatureTypeRowHandle MakeAICreatureType(struct FName RowName); // Function Icarus.AICreatureTypeLibrary.MakeAICreatureType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dc280
	bool IsValidName(struct FName NameValue); // Function Icarus.AICreatureTypeLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14dbfb0
	struct FAICreatureTypeEnum IntToStruct(int32_t IntValue); // Function Icarus.AICreatureTypeLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dbe00
	struct FName IntToName(int32_t IntValue); // Function Icarus.AICreatureTypeLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14dbc50
	void GetAICreatureTypeStruct(struct FAICreatureTypeRowHandle RowHandle, struct FAICreatureType AICreatureType, enum class EValid Paths); // Function Icarus.AICreatureTypeLibrary.GetAICreatureTypeStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14db850
	bool EqualEqual_FAICreatureTypeRowHandleFAICreatureTypeRowHandle(struct FAICreatureTypeRowHandle RowHandleA, struct FAICreatureTypeRowHandle RowHandleB); // Function Icarus.AICreatureTypeLibrary.EqualEqual_FAICreatureTypeRowHandleFAICreatureTypeRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14db3d0
	bool EqualEqual_EnumEnum(struct FAICreatureTypeEnum A, struct FAICreatureTypeEnum B); // Function Icarus.AICreatureTypeLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14db0b0
	struct FAICreatureTypeRowHandle CastToAICreatureTypeRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.AICreatureTypeLibrary.CastToAICreatureTypeRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14dad80
	void BreakAICreatureTypeEnum(struct FAICreatureTypeEnum Enum, struct FName Name, int32_t Index); // Function Icarus.AICreatureTypeLibrary.BreakAICreatureTypeEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14da9a0
	void AddRowToAICreatureTypeTable(struct FName Name, struct FAICreatureType Data, struct FAICreatureTypeRowHandle NewRow); // Function Icarus.AICreatureTypeLibrary.AddRowToAICreatureTypeTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14da3d0
};

// Class Icarus.AICreatureTypeTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAICreatureTypeTable : UIcarusDataTable {
};

// Class Icarus.AIDescriptorsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAIDescriptorsLibrary : URowLibrary {

	struct FAIDescriptorsRowHandle StructToRowHandle(struct FAIDescriptorsEnum EnumValue); // Function Icarus.AIDescriptorsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ddb20
	struct FName StructToName(struct FAIDescriptorsEnum EnumValue); // Function Icarus.AIDescriptorsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dd920
	int32_t StructToInt(struct FAIDescriptorsEnum EnumValue); // Function Icarus.AIDescriptorsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dd740
	struct FAIDescriptorsEnum RowHandleToStruct(struct FAIDescriptorsRowHandle RowHandle); // Function Icarus.AIDescriptorsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dd540
	void RemoveRowFromAIDescriptorsTable(struct FName Name); // Function Icarus.AIDescriptorsLibrary.RemoveRowFromAIDescriptorsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14dd340
	void RefreshConstants(); // Function Icarus.AIDescriptorsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14dd220
	int32_t NumRows(); // Function Icarus.AIDescriptorsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dd1b0
	bool NotEqual_EnumName(struct FAIDescriptorsEnum A, struct FName B); // Function Icarus.AIDescriptorsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dd060
	bool NotEqual_EnumEnum(struct FAIDescriptorsEnum A, struct FAIDescriptorsEnum B); // Function Icarus.AIDescriptorsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dcd90
	struct FAIDescriptorsEnum NameToStruct(struct FName NameValue); // Function Icarus.AIDescriptorsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dcb20
	int32_t NameToInt(struct FName NameValue); // Function Icarus.AIDescriptorsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14dc970
	struct FAIDescriptorsRowHandle MakeLiteralAIDescriptors(struct FAIDescriptorsRowHandle RowHandle); // Function Icarus.AIDescriptorsLibrary.MakeLiteralAIDescriptors // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dc780
	struct FAIDescriptorsRowHandle MakeAIDescriptorsFromIndex(int32_t Index); // Function Icarus.AIDescriptorsLibrary.MakeAIDescriptorsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dc550
	struct FAIDescriptorsEnum MakeAIDescriptorsEnum(struct FAIDescriptorsEnum Enum); // Function Icarus.AIDescriptorsLibrary.MakeAIDescriptorsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dc4d0
	struct FAIDescriptorsRowHandle MakeAIDescriptors(struct FName RowName); // Function Icarus.AIDescriptorsLibrary.MakeAIDescriptors // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dc430
	bool IsValidName(struct FName NameValue); // Function Icarus.AIDescriptorsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14dc040
	struct FAIDescriptorsEnum IntToStruct(int32_t IntValue); // Function Icarus.AIDescriptorsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14dbe90
	struct FName IntToName(int32_t IntValue); // Function Icarus.AIDescriptorsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14dbce0
	void GetAIDescriptorsStruct(struct FAIDescriptorsRowHandle RowHandle, struct FAIDescriptor AIDescriptors, enum class EValid Paths); // Function Icarus.AIDescriptorsLibrary.GetAIDescriptorsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14dba40
	bool EqualEqual_FAIDescriptorsRowHandleFAIDescriptorsRowHandle(struct FAIDescriptorsRowHandle RowHandleA, struct FAIDescriptorsRowHandle RowHandleB); // Function Icarus.AIDescriptorsLibrary.EqualEqual_FAIDescriptorsRowHandleFAIDescriptorsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14db510
	bool EqualEqual_EnumEnum(struct FAIDescriptorsEnum A, struct FAIDescriptorsEnum B); // Function Icarus.AIDescriptorsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14db1a0
	struct FAIDescriptorsRowHandle CastToAIDescriptorsRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.AIDescriptorsLibrary.CastToAIDescriptorsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14daea0
	void BreakAIDescriptorsEnum(struct FAIDescriptorsEnum Enum, struct FName Name, int32_t Index); // Function Icarus.AIDescriptorsLibrary.BreakAIDescriptorsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14dab00
	void AddRowToAIDescriptorsTable(struct FName Name, struct FAIDescriptor Data, struct FAIDescriptorsRowHandle NewRow); // Function Icarus.AIDescriptorsLibrary.AddRowToAIDescriptorsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14da660
};

// Class Icarus.AIDescriptorsTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAIDescriptorsTable : UIcarusDataTable {
};

// Class Icarus.AIGrowthLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAIGrowthLibrary : URowLibrary {

	struct FAIGrowthRowHandle StructToRowHandle(struct FAIGrowthEnum EnumValue); // Function Icarus.AIGrowthLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e3bd0
	struct FName StructToName(struct FAIGrowthEnum EnumValue); // Function Icarus.AIGrowthLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e39f0
	int32_t StructToInt(struct FAIGrowthEnum EnumValue); // Function Icarus.AIGrowthLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e3810
	struct FAIGrowthEnum RowHandleToStruct(struct FAIGrowthRowHandle RowHandle); // Function Icarus.AIGrowthLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e35d0
	void RemoveRowFromAIGrowthTable(struct FName Name); // Function Icarus.AIGrowthLibrary.RemoveRowFromAIGrowthTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14e3450
	void RefreshConstants(); // Function Icarus.AIGrowthLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14e33f0
	int32_t NumRows(); // Function Icarus.AIGrowthLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e3360
	bool NotEqual_EnumName(struct FAIGrowthEnum A, struct FName B); // Function Icarus.AIGrowthLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e3090
	bool NotEqual_EnumEnum(struct FAIGrowthEnum A, struct FAIGrowthEnum B); // Function Icarus.AIGrowthLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e2dc0
	struct FAIGrowthEnum NameToStruct(struct FName NameValue); // Function Icarus.AIGrowthLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e2c10
	int32_t NameToInt(struct FName NameValue); // Function Icarus.AIGrowthLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14e2a60
	struct FAIGrowthRowHandle MakeLiteralAIGrowth(struct FAIGrowthRowHandle RowHandle); // Function Icarus.AIGrowthLibrary.MakeLiteralAIGrowth // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e27f0
	struct FAIGrowthRowHandle MakeAIGrowthFromIndex(int32_t Index); // Function Icarus.AIGrowthLibrary.MakeAIGrowthFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e2400
	struct FAIGrowthEnum MakeAIGrowthEnum(struct FAIGrowthEnum Enum); // Function Icarus.AIGrowthLibrary.MakeAIGrowthEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e2380
	struct FAIGrowthRowHandle MakeAIGrowth(struct FName RowName); // Function Icarus.AIGrowthLibrary.MakeAIGrowth // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e22e0
	bool IsValidName(struct FName NameValue); // Function Icarus.AIGrowthLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14e2130
	struct FAIGrowthEnum IntToStruct(int32_t IntValue); // Function Icarus.AIGrowthLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e1f80
	struct FName IntToName(int32_t IntValue); // Function Icarus.AIGrowthLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14e1dd0
	void GetAIGrowthStruct(struct FAIGrowthRowHandle RowHandle, struct FAIGrowth AIGrowth, enum class EValid Paths); // Function Icarus.AIGrowthLibrary.GetAIGrowthStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e1850
	bool EqualEqual_FAIGrowthRowHandleFAIGrowthRowHandle(struct FAIGrowthRowHandle RowHandleA, struct FAIGrowthRowHandle RowHandleB); // Function Icarus.AIGrowthLibrary.EqualEqual_FAIGrowthRowHandleFAIGrowthRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e1490
	bool EqualEqual_EnumEnum(struct FAIGrowthEnum A, struct FAIGrowthEnum B); // Function Icarus.AIGrowthLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e11c0
	struct FAIGrowthRowHandle CastToAIGrowthRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.AIGrowthLibrary.CastToAIGrowthRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e0e60
	void BreakAIGrowthEnum(struct FAIGrowthEnum Enum, struct FName Name, int32_t Index); // Function Icarus.AIGrowthLibrary.BreakAIGrowthEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14e0a40
	void AddRowToAIGrowthTable(struct FName Name, struct FAIGrowth Data, struct FAIGrowthRowHandle NewRow); // Function Icarus.AIGrowthLibrary.AddRowToAIGrowthTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e0280
};

// Class Icarus.AIGrowthTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAIGrowthTable : UIcarusDataTable {
};

// Class Icarus.AIRelationshipsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAIRelationshipsLibrary : URowLibrary {

	struct FAIRelationshipsRowHandle StructToRowHandle(struct FAIRelationshipsEnum EnumValue); // Function Icarus.AIRelationshipsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e3c80
	struct FName StructToName(struct FAIRelationshipsEnum EnumValue); // Function Icarus.AIRelationshipsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e3a90
	int32_t StructToInt(struct FAIRelationshipsEnum EnumValue); // Function Icarus.AIRelationshipsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e38b0
	struct FAIRelationshipsEnum RowHandleToStruct(struct FAIRelationshipsRowHandle RowHandle); // Function Icarus.AIRelationshipsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e3690
	void RemoveRowFromAIRelationshipsTable(struct FName Name); // Function Icarus.AIRelationshipsLibrary.RemoveRowFromAIRelationshipsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14e34d0
	void RefreshConstants(); // Function Icarus.AIRelationshipsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14e3410
	int32_t NumRows(); // Function Icarus.AIRelationshipsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e3390
	bool NotEqual_EnumName(struct FAIRelationshipsEnum A, struct FName B); // Function Icarus.AIRelationshipsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e3180
	bool NotEqual_EnumEnum(struct FAIRelationshipsEnum A, struct FAIRelationshipsEnum B); // Function Icarus.AIRelationshipsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e2eb0
	struct FAIRelationshipsEnum NameToStruct(struct FName NameValue); // Function Icarus.AIRelationshipsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e2ca0
	int32_t NameToInt(struct FName NameValue); // Function Icarus.AIRelationshipsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14e2af0
	struct FAIRelationshipsRowHandle MakeLiteralAIRelationships(struct FAIRelationshipsRowHandle RowHandle); // Function Icarus.AIRelationshipsLibrary.MakeLiteralAIRelationships // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e28c0
	struct FAIRelationshipsRowHandle MakeAIRelationshipsFromIndex(int32_t Index); // Function Icarus.AIRelationshipsLibrary.MakeAIRelationshipsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e25b0
	struct FAIRelationshipsEnum MakeAIRelationshipsEnum(struct FAIRelationshipsEnum Enum); // Function Icarus.AIRelationshipsLibrary.MakeAIRelationshipsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e2530
	struct FAIRelationshipsRowHandle MakeAIRelationships(struct FName RowName); // Function Icarus.AIRelationshipsLibrary.MakeAIRelationships // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e2490
	bool IsValidName(struct FName NameValue); // Function Icarus.AIRelationshipsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14e21c0
	struct FAIRelationshipsEnum IntToStruct(int32_t IntValue); // Function Icarus.AIRelationshipsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e2010
	struct FName IntToName(int32_t IntValue); // Function Icarus.AIRelationshipsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14e1e60
	void GetAIRelationshipsStruct(struct FAIRelationshipsRowHandle RowHandle, struct FAIRelationshipData AIRelationships, enum class EValid Paths); // Function Icarus.AIRelationshipsLibrary.GetAIRelationshipsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e1a70
	bool EqualEqual_FAIRelationshipsRowHandleFAIRelationshipsRowHandle(struct FAIRelationshipsRowHandle RowHandleA, struct FAIRelationshipsRowHandle RowHandleB); // Function Icarus.AIRelationshipsLibrary.EqualEqual_FAIRelationshipsRowHandleFAIRelationshipsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e15d0
	bool EqualEqual_EnumEnum(struct FAIRelationshipsEnum A, struct FAIRelationshipsEnum B); // Function Icarus.AIRelationshipsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e12b0
	struct FAIRelationshipsRowHandle CastToAIRelationshipsRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.AIRelationshipsLibrary.CastToAIRelationshipsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e0f80
	void BreakAIRelationshipsEnum(struct FAIRelationshipsEnum Enum, struct FName Name, int32_t Index); // Function Icarus.AIRelationshipsLibrary.BreakAIRelationshipsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14e0ba0
	void AddRowToAIRelationshipsTable(struct FName Name, struct FAIRelationshipData Data, struct FAIRelationshipsRowHandle NewRow); // Function Icarus.AIRelationshipsLibrary.AddRowToAIRelationshipsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e05c0
};

// Class Icarus.AIRelationshipsTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAIRelationshipsTable : UIcarusDataTable {
};

// Class Icarus.AISetupLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAISetupLibrary : URowLibrary {

	struct FAISetupRowHandle StructToRowHandle(struct FAISetupEnum EnumValue); // Function Icarus.AISetupLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e3d30
	struct FName StructToName(struct FAISetupEnum EnumValue); // Function Icarus.AISetupLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e3b30
	int32_t StructToInt(struct FAISetupEnum EnumValue); // Function Icarus.AISetupLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e3950
	struct FAISetupEnum RowHandleToStruct(struct FAISetupRowHandle RowHandle); // Function Icarus.AISetupLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e3750
	void RemoveRowFromAISetupTable(struct FName Name); // Function Icarus.AISetupLibrary.RemoveRowFromAISetupTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14e3550
	void RefreshConstants(); // Function Icarus.AISetupLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14e3430
	int32_t NumRows(); // Function Icarus.AISetupLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e33c0
	bool NotEqual_EnumName(struct FAISetupEnum A, struct FName B); // Function Icarus.AISetupLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e3270
	bool NotEqual_EnumEnum(struct FAISetupEnum A, struct FAISetupEnum B); // Function Icarus.AISetupLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e2fa0
	struct FAISetupEnum NameToStruct(struct FName NameValue); // Function Icarus.AISetupLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e2d30
	int32_t NameToInt(struct FName NameValue); // Function Icarus.AISetupLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14e2b80
	struct FAISetupRowHandle MakeLiteralAISetup(struct FAISetupRowHandle RowHandle); // Function Icarus.AISetupLibrary.MakeLiteralAISetup // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e2990
	struct FAISetupRowHandle MakeAISetupFromIndex(int32_t Index); // Function Icarus.AISetupLibrary.MakeAISetupFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e2760
	struct FAISetupEnum MakeAISetupEnum(struct FAISetupEnum Enum); // Function Icarus.AISetupLibrary.MakeAISetupEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e26e0
	struct FAISetupRowHandle MakeAISetup(struct FName RowName); // Function Icarus.AISetupLibrary.MakeAISetup // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e2640
	bool IsValidName(struct FName NameValue); // Function Icarus.AISetupLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14e2250
	struct FAISetupEnum IntToStruct(int32_t IntValue); // Function Icarus.AISetupLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e20a0
	struct FName IntToName(int32_t IntValue); // Function Icarus.AISetupLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14e1ef0
	void GetAISetupStruct(struct FAISetupRowHandle RowHandle, struct FAISetup AISetup, enum class EValid Paths); // Function Icarus.AISetupLibrary.GetAISetupStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e1c30
	bool EqualEqual_FAISetupRowHandleFAISetupRowHandle(struct FAISetupRowHandle RowHandleA, struct FAISetupRowHandle RowHandleB); // Function Icarus.AISetupLibrary.EqualEqual_FAISetupRowHandleFAISetupRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e1710
	bool EqualEqual_EnumEnum(struct FAISetupEnum A, struct FAISetupEnum B); // Function Icarus.AISetupLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e13a0
	struct FAISetupRowHandle CastToAISetupRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.AISetupLibrary.CastToAISetupRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e10a0
	void BreakAISetupEnum(struct FAISetupEnum Enum, struct FName Name, int32_t Index); // Function Icarus.AISetupLibrary.BreakAISetupEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14e0d00
	void AddRowToAISetupTable(struct FName Name, struct FAISetup Data, struct FAISetupRowHandle NewRow); // Function Icarus.AISetupLibrary.AddRowToAISetupTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e08b0
};

// Class Icarus.AISetupTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAISetupTable : UIcarusDataTable {
};

// Class Icarus.AISpawnConfigLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAISpawnConfigLibrary : URowLibrary {

	struct FAISpawnConfigRowHandle StructToRowHandle(struct FAISpawnConfigEnum EnumValue); // Function Icarus.AISpawnConfigLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e9700
	struct FName StructToName(struct FAISpawnConfigEnum EnumValue); // Function Icarus.AISpawnConfigLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e95c0
	int32_t StructToInt(struct FAISpawnConfigEnum EnumValue); // Function Icarus.AISpawnConfigLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e9480
	struct FAISpawnConfigEnum RowHandleToStruct(struct FAISpawnConfigRowHandle RowHandle); // Function Icarus.AISpawnConfigLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e92e0
	void RemoveRowFromAISpawnConfigTable(struct FName Name); // Function Icarus.AISpawnConfigLibrary.RemoveRowFromAISpawnConfigTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14e91e0
	void RefreshConstants(); // Function Icarus.AISpawnConfigLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14e91a0
	int32_t NumRows(); // Function Icarus.AISpawnConfigLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e9060
	bool NotEqual_EnumName(struct FAISpawnConfigEnum A, struct FName B); // Function Icarus.AISpawnConfigLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e8e80
	bool NotEqual_EnumEnum(struct FAISpawnConfigEnum A, struct FAISpawnConfigEnum B); // Function Icarus.AISpawnConfigLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e8ca0
	struct FAISpawnConfigEnum NameToStruct(struct FName NameValue); // Function Icarus.AISpawnConfigLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e8b80
	int32_t NameToInt(struct FName NameValue); // Function Icarus.AISpawnConfigLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14e8a60
	struct FAISpawnConfigRowHandle MakeLiteralAISpawnConfig(struct FAISpawnConfigRowHandle RowHandle); // Function Icarus.AISpawnConfigLibrary.MakeLiteralAISpawnConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e88c0
	struct FAISpawnConfigRowHandle MakeAISpawnConfigFromIndex(int32_t Index); // Function Icarus.AISpawnConfigLibrary.MakeAISpawnConfigFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e8680
	struct FAISpawnConfigEnum MakeAISpawnConfigEnum(struct FAISpawnConfigEnum Enum); // Function Icarus.AISpawnConfigLibrary.MakeAISpawnConfigEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e8600
	struct FAISpawnConfigRowHandle MakeAISpawnConfig(struct FName RowName); // Function Icarus.AISpawnConfigLibrary.MakeAISpawnConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e8560
	bool IsValidName(struct FName NameValue); // Function Icarus.AISpawnConfigLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14e8440
	struct FAISpawnConfigEnum IntToStruct(int32_t IntValue); // Function Icarus.AISpawnConfigLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e8050
	struct FName IntToName(int32_t IntValue); // Function Icarus.AISpawnConfigLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14e7f30
	void GetAISpawnConfigStruct(struct FAISpawnConfigRowHandle RowHandle, struct FAISpawnConfigData AISpawnConfig, enum class EValid Paths); // Function Icarus.AISpawnConfigLibrary.GetAISpawnConfigStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e79e0
	bool EqualEqual_FAISpawnConfigRowHandleFAISpawnConfigRowHandle(struct FAISpawnConfigRowHandle RowHandleA, struct FAISpawnConfigRowHandle RowHandleB); // Function Icarus.AISpawnConfigLibrary.EqualEqual_FAISpawnConfigRowHandleFAISpawnConfigRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e7720
	bool EqualEqual_EnumEnum(struct FAISpawnConfigEnum A, struct FAISpawnConfigEnum B); // Function Icarus.AISpawnConfigLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e7540
	struct FAISpawnConfigRowHandle CastToAISpawnConfigRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.AISpawnConfigLibrary.CastToAISpawnConfigRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e7300
	void BreakAISpawnConfigEnum(struct FAISpawnConfigEnum Enum, struct FName Name, int32_t Index); // Function Icarus.AISpawnConfigLibrary.BreakAISpawnConfigEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14e7040
	void AddRowToAISpawnConfigTable(struct FName Name, struct FAISpawnConfigData Data, struct FAISpawnConfigRowHandle NewRow); // Function Icarus.AISpawnConfigLibrary.AddRowToAISpawnConfigTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e6bf0
};

// Class Icarus.AISpawnConfigTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAISpawnConfigTable : UIcarusDataTable {
};

// Class Icarus.AISpawner
// Size: 0x3a8 (Inherited: 0x220)
struct AAISpawner : AActor {
	struct TArray<struct FTileSpawnData> WorldSpawnData; // 0x220(0x10)
	struct UEnvQuery* Template; // 0x230(0x08)
	int32_t NumberOfCachedSpawnPoints; // 0x238(0x04)
	char pad_23C[0x4]; // 0x23c(0x04)
	struct FMulticastInlineDelegate GenerationComplete; // 0x240(0x10)
	int32_t SelectedTile; // 0x250(0x04)
	struct FAISpawnConfigRowHandle SpawnConfig; // 0x254(0x18)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct TArray<struct UIcarusAISpawnFilter*> SpawnRules; // 0x270(0x10)
	struct UIcarusStatContainer* StatContainer; // 0x280(0x08)
	struct FWorldData WorldData; // 0x288(0x110)
	struct AIcarusEQSTestingPawn* TestingPawn; // 0x398(0x08)
	char pad_3A0[0x8]; // 0x3a0(0x08)

	void WorldStatsSet(); // Function Icarus.AISpawner.WorldStatsSet // (Final|Native|Private) // @ game+0x14e9880
	void VisualiseTilePosition(); // Function Icarus.AISpawner.VisualiseTilePosition // (Final|Native|Public|BlueprintCallable) // @ game+0x14e9860
	void SpawnPointGenerationComplete(); // Function Icarus.AISpawner.SpawnPointGenerationComplete // (Native|Event|Public|BlueprintEvent) // @ game+0x14e9460
	bool PerformNextTileEQS(); // Function Icarus.AISpawner.PerformNextTileEQS // (Final|Native|Private) // @ game+0x14e9170
	void OnEQSQueryCompleted(struct TArray<struct FVector> EQSResults); // Function Icarus.AISpawner.OnEQSQueryCompleted // (Final|Native|Private|HasOutParms) // @ game+0x14e90c0
	bool IsSpawnPointValid(struct FVector InLocation, struct FAISetupEnum InAISetup); // Function Icarus.AISpawner.IsSpawnPointValid // (Native|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x14e8340
	void GenerateSingleTileSpawnPoints(); // Function Icarus.AISpawner.GenerateSingleTileSpawnPoints // (Final|Native|Public|BlueprintCallable) // @ game+0x14e79c0
	void GenerateCachedSpawnPoints(); // Function Icarus.AISpawner.GenerateCachedSpawnPoints // (Final|Native|Public|BlueprintCallable) // @ game+0x14e79a0
};

// Class Icarus.AISpawnRulesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAISpawnRulesLibrary : URowLibrary {

	struct FAISpawnRulesRowHandle StructToRowHandle(struct FAISpawnRulesEnum EnumValue); // Function Icarus.AISpawnRulesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e97b0
	struct FName StructToName(struct FAISpawnRulesEnum EnumValue); // Function Icarus.AISpawnRulesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e9660
	int32_t StructToInt(struct FAISpawnRulesEnum EnumValue); // Function Icarus.AISpawnRulesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e9520
	struct FAISpawnRulesEnum RowHandleToStruct(struct FAISpawnRulesRowHandle RowHandle); // Function Icarus.AISpawnRulesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e93a0
	void RemoveRowFromAISpawnRulesTable(struct FName Name); // Function Icarus.AISpawnRulesLibrary.RemoveRowFromAISpawnRulesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14e9260
	void RefreshConstants(); // Function Icarus.AISpawnRulesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14e91c0
	int32_t NumRows(); // Function Icarus.AISpawnRulesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e9090
	bool NotEqual_EnumName(struct FAISpawnRulesEnum A, struct FName B); // Function Icarus.AISpawnRulesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e8f70
	bool NotEqual_EnumEnum(struct FAISpawnRulesEnum A, struct FAISpawnRulesEnum B); // Function Icarus.AISpawnRulesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e8d90
	struct FAISpawnRulesEnum NameToStruct(struct FName NameValue); // Function Icarus.AISpawnRulesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e8c10
	int32_t NameToInt(struct FName NameValue); // Function Icarus.AISpawnRulesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14e8af0
	struct FAISpawnRulesRowHandle MakeLiteralAISpawnRules(struct FAISpawnRulesRowHandle RowHandle); // Function Icarus.AISpawnRulesLibrary.MakeLiteralAISpawnRules // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e8990
	struct FAISpawnRulesRowHandle MakeAISpawnRulesFromIndex(int32_t Index); // Function Icarus.AISpawnRulesLibrary.MakeAISpawnRulesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e8830
	struct FAISpawnRulesEnum MakeAISpawnRulesEnum(struct FAISpawnRulesEnum Enum); // Function Icarus.AISpawnRulesLibrary.MakeAISpawnRulesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e87b0
	struct FAISpawnRulesRowHandle MakeAISpawnRules(struct FName RowName); // Function Icarus.AISpawnRulesLibrary.MakeAISpawnRules // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e8710
	bool IsValidName(struct FName NameValue); // Function Icarus.AISpawnRulesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14e84d0
	struct FAISpawnRulesEnum IntToStruct(int32_t IntValue); // Function Icarus.AISpawnRulesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e80e0
	struct FName IntToName(int32_t IntValue); // Function Icarus.AISpawnRulesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14e7fc0
	void GetAISpawnRulesStruct(struct FAISpawnRulesRowHandle RowHandle, struct FAISpawnRuleData AISpawnRules, enum class EValid Paths); // Function Icarus.AISpawnRulesLibrary.GetAISpawnRulesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e7b80
	bool EqualEqual_FAISpawnRulesRowHandleFAISpawnRulesRowHandle(struct FAISpawnRulesRowHandle RowHandleA, struct FAISpawnRulesRowHandle RowHandleB); // Function Icarus.AISpawnRulesLibrary.EqualEqual_FAISpawnRulesRowHandleFAISpawnRulesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e7860
	bool EqualEqual_EnumEnum(struct FAISpawnRulesEnum A, struct FAISpawnRulesEnum B); // Function Icarus.AISpawnRulesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e7630
	struct FAISpawnRulesRowHandle CastToAISpawnRulesRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.AISpawnRulesLibrary.CastToAISpawnRulesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e7420
	void BreakAISpawnRulesEnum(struct FAISpawnRulesEnum Enum, struct FName Name, int32_t Index); // Function Icarus.AISpawnRulesLibrary.BreakAISpawnRulesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14e71a0
	void AddRowToAISpawnRulesTable(struct FName Name, struct FAISpawnRuleData Data, struct FAISpawnRulesRowHandle NewRow); // Function Icarus.AISpawnRulesLibrary.AddRowToAISpawnRulesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e6d80
};

// Class Icarus.AISpawnRulesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAISpawnRulesTable : UIcarusDataTable {
};

// Class Icarus.AITargetable
// Size: 0x28 (Inherited: 0x28)
struct UAITargetable : UInterface {

	bool IsHidden(); // Function Icarus.AITargetable.IsHidden // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x14e81a0
	bool IsActorAlive(); // Function Icarus.AITargetable.IsActorAlive // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x14e8170
	struct FVector GetTargetLocation(); // Function Icarus.AITargetable.GetTargetLocation // (Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x14e7e60
	int32_t GetTargetAlertness(); // Function Icarus.AITargetable.GetTargetAlertness // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x14e7e30
	struct FAIRelationshipsRowHandle GetRelationshipData(); // Function Icarus.AITargetable.GetRelationshipData // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x14e7df0
	struct TArray<struct FCriticalHitLocation> GetCriticalHitBones(); // Function Icarus.AITargetable.GetCriticalHitBones // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x14e7d70
};

// Class Icarus.AITargetableFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAITargetableFunctionLibrary : UBlueprintFunctionLibrary {

	void IsHostileTowards(struct AActor* SelfTargetable, struct AActor* OtherActorTargetable, enum class ERelationshipType OutRelationshipSwitch, enum class ERelationshipType OutRelationshipType); // Function Icarus.AITargetableFunctionLibrary.IsHostileTowards // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14e81d0
	enum class EStealthAttackType GetTargetStealth(struct AActor* TargetableActor); // Function Icarus.AITargetableFunctionLibrary.GetTargetStealth // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14e7ea0
};

// Class Icarus.VocalisationComponent
// Size: 0x110 (Inherited: 0xb0)
struct UVocalisationComponent : UActorComponent {
	struct UFMODAudioComponent* AudioComponent; // 0xb0(0x08)
	char pad_B8[0x58]; // 0xb8(0x58)

	enum class EVocalisationPlayResult TryPlayVocalisation(struct FVocalisationsRowHandle Vocalisation); // Function Icarus.VocalisationComponent.TryPlayVocalisation // (Final|Native|Public|BlueprintCallable) // @ game+0x16fa340
	void OnEventStopped(); // Function Icarus.VocalisationComponent.OnEventStopped // (Final|Native|Protected) // @ game+0x16f9c80
	void Initialise(struct USceneComponent* TargetComponent, struct FName TargetSocket); // Function Icarus.VocalisationComponent.Initialise // (Native|Public|BlueprintCallable) // @ game+0x16f8b90
	float GetVocalisationLength(struct FVocalisationsRowHandle Vocalisation); // Function Icarus.VocalisationComponent.GetVocalisationLength // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x16f8940
	float GetCurrentVocalisationLength(); // Function Icarus.VocalisationComponent.GetCurrentVocalisationLength // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16f8710
};

// Class Icarus.AIVocalisationComponent
// Size: 0x120 (Inherited: 0x110)
struct UAIVocalisationComponent : UVocalisationComponent {
	char pad_110[0x10]; // 0x110(0x10)

	void SetAIState(enum class EAIAudioState State); // Function Icarus.AIVocalisationComponent.SetAIState // (Final|Native|Public|BlueprintCallable) // @ game+0x14f01d0
	void PlayAIVocalisation(enum class EAIVocalisationType Type); // Function Icarus.AIVocalisationComponent.PlayAIVocalisation // (Final|Native|Public|BlueprintCallable) // @ game+0x14efd30
};

// Class Icarus.AmmoTypesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAmmoTypesLibrary : URowLibrary {

	struct FAmmoTypesRowHandle StructToRowHandle(struct FAmmoTypesEnum EnumValue); // Function Icarus.AmmoTypesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f0610
	struct FName StructToName(struct FAmmoTypesEnum EnumValue); // Function Icarus.AmmoTypesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f0430
	int32_t StructToInt(struct FAmmoTypesEnum EnumValue); // Function Icarus.AmmoTypesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f0250
	struct FAmmoTypesEnum RowHandleToStruct(struct FAmmoTypesRowHandle RowHandle); // Function Icarus.AmmoTypesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14eff90
	void RemoveRowFromAmmoTypesTable(struct FName Name); // Function Icarus.AmmoTypesLibrary.RemoveRowFromAmmoTypesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14efe10
	void RefreshConstants(); // Function Icarus.AmmoTypesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14efdb0
	int32_t NumRows(); // Function Icarus.AmmoTypesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14efca0
	bool NotEqual_EnumName(struct FAmmoTypesEnum A, struct FName B); // Function Icarus.AmmoTypesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ef9d0
	bool NotEqual_EnumEnum(struct FAmmoTypesEnum A, struct FAmmoTypesEnum B); // Function Icarus.AmmoTypesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ef700
	struct FAmmoTypesEnum NameToStruct(struct FName NameValue); // Function Icarus.AmmoTypesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ef550
	int32_t NameToInt(struct FName NameValue); // Function Icarus.AmmoTypesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14ef3a0
	struct FAmmoTypesRowHandle MakeLiteralAmmoTypes(struct FAmmoTypesRowHandle RowHandle); // Function Icarus.AmmoTypesLibrary.MakeLiteralAmmoTypes // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ef130
	struct FAmmoTypesRowHandle MakeAmmoTypesFromIndex(int32_t Index); // Function Icarus.AmmoTypesLibrary.MakeAmmoTypesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14eed40
	struct FAmmoTypesEnum MakeAmmoTypesEnum(struct FAmmoTypesEnum Enum); // Function Icarus.AmmoTypesLibrary.MakeAmmoTypesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14eecc0
	struct FAmmoTypesRowHandle MakeAmmoTypes(struct FName RowName); // Function Icarus.AmmoTypesLibrary.MakeAmmoTypes // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14eec20
	bool IsValidName(struct FName NameValue); // Function Icarus.AmmoTypesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14eea70
	struct FAmmoTypesEnum IntToStruct(int32_t IntValue); // Function Icarus.AmmoTypesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ee8c0
	struct FName IntToName(int32_t IntValue); // Function Icarus.AmmoTypesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14ee710
	void GetAmmoTypesStruct(struct FAmmoTypesRowHandle RowHandle, struct FAmmoTypeData AmmoTypes, enum class EValid Paths); // Function Icarus.AmmoTypesLibrary.GetAmmoTypesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14edf00
	bool EqualEqual_FAmmoTypesRowHandleFAmmoTypesRowHandle(struct FAmmoTypesRowHandle RowHandleA, struct FAmmoTypesRowHandle RowHandleB); // Function Icarus.AmmoTypesLibrary.EqualEqual_FAmmoTypesRowHandleFAmmoTypesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14edb40
	bool EqualEqual_EnumEnum(struct FAmmoTypesEnum A, struct FAmmoTypesEnum B); // Function Icarus.AmmoTypesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ed870
	struct FAmmoTypesRowHandle CastToAmmoTypesRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.AmmoTypesLibrary.CastToAmmoTypesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14ed510
	void BreakAmmoTypesEnum(struct FAmmoTypesEnum Enum, struct FName Name, int32_t Index); // Function Icarus.AmmoTypesLibrary.BreakAmmoTypesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14ed0f0
	void AddRowToAmmoTypesTable(struct FName Name, struct FAmmoTypeData Data, struct FAmmoTypesRowHandle NewRow); // Function Icarus.AmmoTypesLibrary.AddRowToAmmoTypesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14ec9a0
};

// Class Icarus.AmmoTypesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAmmoTypesTable : UIcarusDataTable {
};

// Class Icarus.AnimNotify_IcarusPlaySound
// Size: 0x58 (Inherited: 0x38)
struct UAnimNotify_IcarusPlaySound : UAnimNotify {
	struct UFMODEvent* FMODEvent; // 0x38(0x08)
	bool bFollow; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FName AttachSocket; // 0x44(0x08)
	bool bUseListenerRotation; // 0x4c(0x01)
	bool bUseOcclusion; // 0x4d(0x01)
	char pad_4E[0x2]; // 0x4e(0x02)
	struct FName OcclusionTrace; // 0x50(0x08)
};

// Class Icarus.AnimNotify_PlaySoundPlayer
// Size: 0x50 (Inherited: 0x38)
struct UAnimNotify_PlaySoundPlayer : UAnimNotify {
	struct UFMODEvent* FMODEvent; // 0x38(0x08)
	bool bUseItemAnimData; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FName ItemAnimName; // 0x44(0x08)
	int32_t ItemAnimIndex; // 0x4c(0x04)

	struct UFMODEvent* GetFMODEvent(struct AIcarusPlayerCharacter* PlayerCharacter); // Function Icarus.AnimNotify_PlaySoundPlayer.GetFMODEvent // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x14ee670
};

// Class Icarus.ArmourComponent
// Size: 0xd0 (Inherited: 0xd0)
struct UArmourComponent : UTraitComponent {

	bool GetArmourData(struct FArmourData OutData); // Function Icarus.ArmourComponent.GetArmourData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x14ee110
};

// Class Icarus.ArmourLibrary
// Size: 0x28 (Inherited: 0x28)
struct UArmourLibrary : URowLibrary {

	struct FArmourRowHandle StructToRowHandle(struct FArmourEnum EnumValue); // Function Icarus.ArmourLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f06c0
	struct FName StructToName(struct FArmourEnum EnumValue); // Function Icarus.ArmourLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f04d0
	int32_t StructToInt(struct FArmourEnum EnumValue); // Function Icarus.ArmourLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f02f0
	struct FArmourEnum RowHandleToStruct(struct FArmourRowHandle RowHandle); // Function Icarus.ArmourLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f0050
	void RemoveRowFromArmourTable(struct FName Name); // Function Icarus.ArmourLibrary.RemoveRowFromArmourTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14eff10
	void RefreshConstants(); // Function Icarus.ArmourLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14efdd0
	int32_t NumRows(); // Function Icarus.ArmourLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14efcd0
	bool NotEqual_EnumName(struct FArmourEnum A, struct FName B); // Function Icarus.ArmourLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14efac0
	bool NotEqual_EnumEnum(struct FArmourEnum A, struct FArmourEnum B); // Function Icarus.ArmourLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ef7f0
	struct FArmourEnum NameToStruct(struct FName NameValue); // Function Icarus.ArmourLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ef5e0
	int32_t NameToInt(struct FName NameValue); // Function Icarus.ArmourLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14ef430
	struct FArmourRowHandle MakeLiteralArmour(struct FArmourRowHandle RowHandle); // Function Icarus.ArmourLibrary.MakeLiteralArmour // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ef200
	struct FArmourRowHandle MakeArmourFromIndex(int32_t Index); // Function Icarus.ArmourLibrary.MakeArmourFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14eeef0
	struct FArmourEnum MakeArmourEnum(struct FArmourEnum Enum); // Function Icarus.ArmourLibrary.MakeArmourEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14eee70
	struct FArmourRowHandle MakeArmour(struct FName RowName); // Function Icarus.ArmourLibrary.MakeArmour // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14eedd0
	bool IsValidName(struct FName NameValue); // Function Icarus.ArmourLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14eeb00
	struct FArmourEnum IntToStruct(int32_t IntValue); // Function Icarus.ArmourLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ee950
	struct FName IntToName(int32_t IntValue); // Function Icarus.ArmourLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14ee7a0
	void GetArmourStruct(struct FArmourRowHandle RowHandle, struct FArmourData Armour, enum class EValid Paths); // Function Icarus.ArmourLibrary.GetArmourStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14ee4d0
	bool EqualEqual_FArmourRowHandleFArmourRowHandle(struct FArmourRowHandle RowHandleA, struct FArmourRowHandle RowHandleB); // Function Icarus.ArmourLibrary.EqualEqual_FArmourRowHandleFArmourRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14edc80
	bool EqualEqual_EnumEnum(struct FArmourEnum A, struct FArmourEnum B); // Function Icarus.ArmourLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ed960
	struct FArmourRowHandle CastToArmourRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.ArmourLibrary.CastToArmourRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14ed630
	void BreakArmourEnum(struct FArmourEnum Enum, struct FName Name, int32_t Index); // Function Icarus.ArmourLibrary.BreakArmourEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14ed250
	void AddRowToArmourTable(struct FName Name, struct FArmourData Data, struct FArmourRowHandle NewRow); // Function Icarus.ArmourLibrary.AddRowToArmourTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14ecf60
};

// Class Icarus.ArmourSetBonusLibrary
// Size: 0x28 (Inherited: 0x28)
struct UArmourSetBonusLibrary : URowLibrary {

	struct FArmourSetBonusRowHandle StructToRowHandle(struct FArmourSetBonusEnum EnumValue); // Function Icarus.ArmourSetBonusLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f0770
	struct FName StructToName(struct FArmourSetBonusEnum EnumValue); // Function Icarus.ArmourSetBonusLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f0570
	int32_t StructToInt(struct FArmourSetBonusEnum EnumValue); // Function Icarus.ArmourSetBonusLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f0390
	struct FArmourSetBonusEnum RowHandleToStruct(struct FArmourSetBonusRowHandle RowHandle); // Function Icarus.ArmourSetBonusLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f0110
	void RemoveRowFromArmourSetBonusTable(struct FName Name); // Function Icarus.ArmourSetBonusLibrary.RemoveRowFromArmourSetBonusTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14efe90
	void RefreshConstants(); // Function Icarus.ArmourSetBonusLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14efdf0
	int32_t NumRows(); // Function Icarus.ArmourSetBonusLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14efd00
	bool NotEqual_EnumName(struct FArmourSetBonusEnum A, struct FName B); // Function Icarus.ArmourSetBonusLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14efbb0
	bool NotEqual_EnumEnum(struct FArmourSetBonusEnum A, struct FArmourSetBonusEnum B); // Function Icarus.ArmourSetBonusLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ef8e0
	struct FArmourSetBonusEnum NameToStruct(struct FName NameValue); // Function Icarus.ArmourSetBonusLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ef670
	int32_t NameToInt(struct FName NameValue); // Function Icarus.ArmourSetBonusLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14ef4c0
	struct FArmourSetBonusRowHandle MakeLiteralArmourSetBonus(struct FArmourSetBonusRowHandle RowHandle); // Function Icarus.ArmourSetBonusLibrary.MakeLiteralArmourSetBonus // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ef2d0
	struct FArmourSetBonusRowHandle MakeArmourSetBonusFromIndex(int32_t Index); // Function Icarus.ArmourSetBonusLibrary.MakeArmourSetBonusFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ef0a0
	struct FArmourSetBonusEnum MakeArmourSetBonusEnum(struct FArmourSetBonusEnum Enum); // Function Icarus.ArmourSetBonusLibrary.MakeArmourSetBonusEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ef020
	struct FArmourSetBonusRowHandle MakeArmourSetBonus(struct FName RowName); // Function Icarus.ArmourSetBonusLibrary.MakeArmourSetBonus // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14eef80
	bool IsValidName(struct FName NameValue); // Function Icarus.ArmourSetBonusLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14eeb90
	struct FArmourSetBonusEnum IntToStruct(int32_t IntValue); // Function Icarus.ArmourSetBonusLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14ee9e0
	struct FName IntToName(int32_t IntValue); // Function Icarus.ArmourSetBonusLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14ee830
	void GetArmourSetBonusStruct(struct FArmourSetBonusRowHandle RowHandle, struct FArmourSetBonus ArmourSetBonus, enum class EValid Paths); // Function Icarus.ArmourSetBonusLibrary.GetArmourSetBonusStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14ee280
	bool EqualEqual_FArmourSetBonusRowHandleFArmourSetBonusRowHandle(struct FArmourSetBonusRowHandle RowHandleA, struct FArmourSetBonusRowHandle RowHandleB); // Function Icarus.ArmourSetBonusLibrary.EqualEqual_FArmourSetBonusRowHandleFArmourSetBonusRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14eddc0
	bool EqualEqual_EnumEnum(struct FArmourSetBonusEnum A, struct FArmourSetBonusEnum B); // Function Icarus.ArmourSetBonusLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14eda50
	struct FArmourSetBonusRowHandle CastToArmourSetBonusRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.ArmourSetBonusLibrary.CastToArmourSetBonusRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14ed750
	void BreakArmourSetBonusEnum(struct FArmourSetBonusEnum Enum, struct FName Name, int32_t Index); // Function Icarus.ArmourSetBonusLibrary.BreakArmourSetBonusEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14ed3b0
	void AddRowToArmourSetBonusTable(struct FName Name, struct FArmourSetBonus Data, struct FArmourSetBonusRowHandle NewRow); // Function Icarus.ArmourSetBonusLibrary.AddRowToArmourSetBonusTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14ecc60
};

// Class Icarus.ArmourSetBonusTable
// Size: 0xb8 (Inherited: 0xb8)
struct UArmourSetBonusTable : UIcarusDataTable {
};

// Class Icarus.ArmourSetsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UArmourSetsLibrary : URowLibrary {

	struct FArmourSetsRowHandle StructToRowHandle(struct FArmourSetsEnum EnumValue); // Function Icarus.ArmourSetsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f5870
	struct FName StructToName(struct FArmourSetsEnum EnumValue); // Function Icarus.ArmourSetsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f5730
	int32_t StructToInt(struct FArmourSetsEnum EnumValue); // Function Icarus.ArmourSetsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f55f0
	struct FArmourSetsEnum RowHandleToStruct(struct FArmourSetsRowHandle RowHandle); // Function Icarus.ArmourSetsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f5360
	void RemoveRowFromArmourSetsTable(struct FName Name); // Function Icarus.ArmourSetsLibrary.RemoveRowFromArmourSetsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14f5260
	void RefreshConstants(); // Function Icarus.ArmourSetsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14f5150
	int32_t NumRows(); // Function Icarus.ArmourSetsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f5070
	bool NotEqual_EnumName(struct FArmourSetsEnum A, struct FName B); // Function Icarus.ArmourSetsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f4e90
	bool NotEqual_EnumEnum(struct FArmourSetsEnum A, struct FArmourSetsEnum B); // Function Icarus.ArmourSetsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f4cb0
	struct FArmourSetsEnum NameToStruct(struct FName NameValue); // Function Icarus.ArmourSetsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f4b90
	int32_t NameToInt(struct FName NameValue); // Function Icarus.ArmourSetsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14f4a70
	struct FArmourSetsRowHandle MakeLiteralArmourSets(struct FArmourSetsRowHandle RowHandle); // Function Icarus.ArmourSetsLibrary.MakeLiteralArmourSets // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f48d0
	struct FArmourSetsRowHandle MakeArmourSetsFromIndex(int32_t Index); // Function Icarus.ArmourSetsLibrary.MakeArmourSetsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f4690
	struct FArmourSetsEnum MakeArmourSetsEnum(struct FArmourSetsEnum Enum); // Function Icarus.ArmourSetsLibrary.MakeArmourSetsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f4610
	struct FArmourSetsRowHandle MakeArmourSets(struct FName RowName); // Function Icarus.ArmourSetsLibrary.MakeArmourSets // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f4570
	bool IsValidName(struct FName NameValue); // Function Icarus.ArmourSetsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14f4450
	struct FArmourSetsEnum IntToStruct(int32_t IntValue); // Function Icarus.ArmourSetsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f4330
	struct FName IntToName(int32_t IntValue); // Function Icarus.ArmourSetsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14f4210
	void GetArmourSetsStruct(struct FArmourSetsRowHandle RowHandle, struct FArmourSet ArmourSets, enum class EValid Paths); // Function Icarus.ArmourSetsLibrary.GetArmourSetsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14f3ce0
	bool EqualEqual_FArmourSetsRowHandleFArmourSetsRowHandle(struct FArmourSetsRowHandle RowHandleA, struct FArmourSetsRowHandle RowHandleB); // Function Icarus.ArmourSetsLibrary.EqualEqual_FArmourSetsRowHandleFArmourSetsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f3a60
	bool EqualEqual_EnumEnum(struct FArmourSetsEnum A, struct FArmourSetsEnum B); // Function Icarus.ArmourSetsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f3880
	struct FArmourSetsRowHandle CastToArmourSetsRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.ArmourSetsLibrary.CastToArmourSetsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14f3640
	void BreakArmourSetsEnum(struct FArmourSetsEnum Enum, struct FName Name, int32_t Index); // Function Icarus.ArmourSetsLibrary.BreakArmourSetsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14f3380
	void AddRowToArmourSetsTable(struct FName Name, struct FArmourSet Data, struct FArmourSetsRowHandle NewRow); // Function Icarus.ArmourSetsLibrary.AddRowToArmourSetsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14f2fb0
};

// Class Icarus.ArmourSetsTable
// Size: 0xb8 (Inherited: 0xb8)
struct UArmourSetsTable : UIcarusDataTable {
};

// Class Icarus.ArmourTable
// Size: 0xb8 (Inherited: 0xb8)
struct UArmourTable : UIcarusDataTable {
};

// Class Icarus.AssetReferencesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAssetReferencesLibrary : URowLibrary {

	struct FAssetReferencesRowHandle StructToRowHandle(struct FAssetReferencesEnum EnumValue); // Function Icarus.AssetReferencesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f5920
	struct FName StructToName(struct FAssetReferencesEnum EnumValue); // Function Icarus.AssetReferencesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f57d0
	int32_t StructToInt(struct FAssetReferencesEnum EnumValue); // Function Icarus.AssetReferencesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f5690
	struct FAssetReferencesEnum RowHandleToStruct(struct FAssetReferencesRowHandle RowHandle); // Function Icarus.AssetReferencesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f5420
	void RemoveRowFromAssetReferencesTable(struct FName Name); // Function Icarus.AssetReferencesLibrary.RemoveRowFromAssetReferencesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x14f52e0
	void RefreshConstants(); // Function Icarus.AssetReferencesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x14f5170
	int32_t NumRows(); // Function Icarus.AssetReferencesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f50a0
	bool NotEqual_EnumName(struct FAssetReferencesEnum A, struct FName B); // Function Icarus.AssetReferencesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f4f80
	bool NotEqual_EnumEnum(struct FAssetReferencesEnum A, struct FAssetReferencesEnum B); // Function Icarus.AssetReferencesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f4da0
	struct FAssetReferencesEnum NameToStruct(struct FName NameValue); // Function Icarus.AssetReferencesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f4c20
	int32_t NameToInt(struct FName NameValue); // Function Icarus.AssetReferencesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x14f4b00
	struct FAssetReferencesRowHandle MakeLiteralAssetReferences(struct FAssetReferencesRowHandle RowHandle); // Function Icarus.AssetReferencesLibrary.MakeLiteralAssetReferences // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f49a0
	struct FAssetReferencesRowHandle MakeAssetReferencesFromIndex(int32_t Index); // Function Icarus.AssetReferencesLibrary.MakeAssetReferencesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f4840
	struct FAssetReferencesEnum MakeAssetReferencesEnum(struct FAssetReferencesEnum Enum); // Function Icarus.AssetReferencesLibrary.MakeAssetReferencesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f47c0
	struct FAssetReferencesRowHandle MakeAssetReferences(struct FName RowName); // Function Icarus.AssetReferencesLibrary.MakeAssetReferences // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f4720
	bool IsValidName(struct FName NameValue); // Function Icarus.AssetReferencesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x14f44e0
	struct FAssetReferencesEnum IntToStruct(int32_t IntValue); // Function Icarus.AssetReferencesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f43c0
	struct FName IntToName(int32_t IntValue); // Function Icarus.AssetReferencesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x14f42a0
	void GetAssetReferencesStruct(struct FAssetReferencesRowHandle RowHandle, struct FAssetReferenceData AssetReferences, enum class EValid Paths); // Function Icarus.AssetReferencesLibrary.GetAssetReferencesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14f3e70
	bool EqualEqual_FAssetReferencesRowHandleFAssetReferencesRowHandle(struct FAssetReferencesRowHandle RowHandleA, struct FAssetReferencesRowHandle RowHandleB); // Function Icarus.AssetReferencesLibrary.EqualEqual_FAssetReferencesRowHandleFAssetReferencesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f3ba0
	bool EqualEqual_EnumEnum(struct FAssetReferencesEnum A, struct FAssetReferencesEnum B); // Function Icarus.AssetReferencesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f3970
	struct FAssetReferencesRowHandle CastToAssetReferencesRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.AssetReferencesLibrary.CastToAssetReferencesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14f3760
	void BreakAssetReferencesEnum(struct FAssetReferencesEnum Enum, struct FName Name, int32_t Index); // Function Icarus.AssetReferencesLibrary.BreakAssetReferencesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14f34e0
	void AddRowToAssetReferencesTable(struct FName Name, struct FAssetReferenceData Data, struct FAssetReferencesRowHandle NewRow); // Function Icarus.AssetReferencesLibrary.AddRowToAssetReferencesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14f31e0
};

// Class Icarus.AssetReferencesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAssetReferencesTable : UIcarusDataTable {
};

// Class Icarus.AtmosphereController
// Size: 0x220 (Inherited: 0x220)
struct AAtmosphereController : AInfo {
};

// Class Icarus.AudioContextComponent
// Size: 0x160 (Inherited: 0xb0)
struct UAudioContextComponent : UActorComponent {
	float MaxUpdateDistance; // 0xb0(0x04)
	float OcclusionShelterContextThreshold; // 0xb4(0x04)
	struct FMulticastInlineDelegate OnEnteredCave; // 0xb8(0x10)
	struct FMulticastInlineDelegate OnExitedCave; // 0xc8(0x10)
	char pad_D8[0x1]; // 0xd8(0x01)
	enum class EAudioShelterState ShelterState; // 0xd9(0x01)
	char pad_DA[0x16]; // 0xda(0x16)
	struct UAudioOcclusionComponent* OcclusionComponent; // 0xf0(0x08)
	struct TArray<struct FAudioContextSubscriber> Subscribers; // 0xf8(0x10)
	struct TMap<struct ACave*, struct FAudioContextCaveColliderSet> CaveOverlaps; // 0x108(0x50)
	char pad_158[0x8]; // 0x158(0x08)

	void SubscribeAudioComponentToUpdates(struct UFMODAudioComponent* AudioComponent, bool bUsesOcclusionParameter, struct FName OcclusionTraceName, bool bUsesWaterImmersionParameter); // Function Icarus.AudioContextComponent.SubscribeAudioComponentToUpdates // (Final|Native|Public|BlueprintCallable) // @ game+0x14f59d0
	void SetCaveOverlapOnceByLocation(struct FVector Location); // Function Icarus.AudioContextComponent.SetCaveOverlapOnceByLocation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x14f5560
	void RemoveCaveOverlap(struct ACave* Cave, struct UPrimitiveComponent* Collider); // Function Icarus.AudioContextComponent.RemoveCaveOverlap // (Final|Native|Public|BlueprintCallable) // @ game+0x14f5190
	enum class EAudioShelterState GetShelterState(); // Function Icarus.AudioContextComponent.GetShelterState // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14f41e0
	enum class EOcclusionShelterContextFMODParam GetOcclusionShelterContextFMODParam(float OcclusionValue); // Function Icarus.AudioContextComponent.GetOcclusionShelterContextFMODParam // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14f4150
	float GetListenerCaveSpaceCorrelation(); // Function Icarus.AudioContextComponent.GetListenerCaveSpaceCorrelation // (Final|Native|Public|BlueprintCallable) // @ game+0x14f4120
	float GetCurrentWaterImmersion(); // Function Icarus.AudioContextComponent.GetCurrentWaterImmersion // (Native|Public|BlueprintCallable) // @ game+0x14f40e0
	float GetCurrentOcclusion(struct FName TracePointName); // Function Icarus.AudioContextComponent.GetCurrentOcclusion // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x14f4040
	enum class ECaveContextFMODParam GetCaveContextFMODParam(); // Function Icarus.AudioContextComponent.GetCaveContextFMODParam // (Final|Native|Public|BlueprintCallable) // @ game+0x14f4010
	void AddCaveOverlap(struct ACave* Cave, struct UPrimitiveComponent* Collider); // Function Icarus.AudioContextComponent.AddCaveOverlap // (Final|Native|Public|BlueprintCallable) // @ game+0x14f2ee0
};

// Class Icarus.AudioContextCreatureComponent
// Size: 0x168 (Inherited: 0x160)
struct UAudioContextCreatureComponent : UAudioContextComponent {
	struct UCreatureAudioComponent* CreatureAudio; // 0x160(0x08)
};

// Class Icarus.AudioContextPlayerComponent
// Size: 0x170 (Inherited: 0x160)
struct UAudioContextPlayerComponent : UAudioContextComponent {
	float ShelterStateLowThreshold; // 0x160(0x04)
	float ShelterStateHighThreshold; // 0x164(0x04)
	struct UPlayerMovementAudioComponent* PlayerMovementAudioComponent; // 0x168(0x08)

	void ServerSetNewShelter(enum class EAudioShelterState NewShelterState); // Function Icarus.AudioContextPlayerComponent.ServerSetNewShelter // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x14f54e0
	void OnShelterUpdated(float NewShelter); // Function Icarus.AudioContextPlayerComponent.OnShelterUpdated // (Final|Native|Private) // @ game+0x14f50d0
};

// Class Icarus.AudioOccluderInterface
// Size: 0x28 (Inherited: 0x28)
struct UAudioOccluderInterface : UInterface {

	float GetOcclusionValue(); // Function Icarus.AudioOccluderInterface.GetOcclusionValue // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x14fa000
};

// Class Icarus.AudioOcclusionComponent
// Size: 0x270 (Inherited: 0x200)
struct UAudioOcclusionComponent : USceneComponent {
	bool bDebug; // 0x1f8(0x01)
	char pad_201[0x6f]; // 0x201(0x6f)

	struct TArray<struct FAudioOcclusionTracePoint> GetTracePoints(struct FVector ListenerLocation); // Function Icarus.AudioOcclusionComponent.GetTracePoints // (Native|Event|Protected|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x14fa0b0
};

// Class Icarus.AudioOcclusionSocketTraceComponent
// Size: 0x280 (Inherited: 0x270)
struct UAudioOcclusionSocketTraceComponent : UAudioOcclusionComponent {
	struct TArray<struct FAudioOcclusionSocketTracePoint> TracePointDefinitions; // 0x268(0x10)

	void SetTracePointTargets(struct USceneComponent* TargetComponent); // Function Icarus.AudioOcclusionSocketTraceComponent.SetTracePointTargets // (Final|Native|Protected|BlueprintCallable) // @ game+0x1500710
};

// Class Icarus.AudioOcclusionCharacterComponent
// Size: 0x280 (Inherited: 0x280)
struct UAudioOcclusionCharacterComponent : UAudioOcclusionSocketTraceComponent {
};

// Class Icarus.AudioSettingsSubsystem
// Size: 0x30 (Inherited: 0x30)
struct UAudioSettingsSubsystem : UGameInstanceSubsystem {

	void OnSFXVolumeChanged(float Volume); // Function Icarus.AudioSettingsSubsystem.OnSFXVolumeChanged // (Final|Native|Public) // @ game+0x14fde30
	void OnMusicVolumeChanged(float Volume); // Function Icarus.AudioSettingsSubsystem.OnMusicVolumeChanged // (Final|Native|Public) // @ game+0x14fc810
	void OnMasterVolumeChanged(float Volume); // Function Icarus.AudioSettingsSubsystem.OnMasterVolumeChanged // (Final|Native|Public) // @ game+0x14fc270
	void OnDialogueVolumeChanged(float Volume); // Function Icarus.AudioSettingsSubsystem.OnDialogueVolumeChanged // (Final|Native|Public) // @ game+0x14fb2c0
	void OnAmbientVolumeChanged(float Volume); // Function Icarus.AudioSettingsSubsystem.OnAmbientVolumeChanged // (Final|Native|Public) // @ game+0x14fa2e0
};

// Class Icarus.AudioSplineComponent
// Size: 0x570 (Inherited: 0x540)
struct UAudioSplineComponent : USplineComponent {
	struct UFMODEvent* Event; // 0x538(0x08)
	float UpdateFrequencyInListenerRange; // 0x540(0x04)
	float UpdateFrequencyOutsideListenerRange; // 0x544(0x04)
	float InterpSpeed; // 0x548(0x04)
	struct UFMODAudioComponent* AudioComponent; // 0x550(0x08)
	char pad_55C[0x14]; // 0x55c(0x14)
};

// Class Icarus.BackendProxyComponent
// Size: 0x440 (Inherited: 0xb0)
struct UBackendProxyComponent : UActorComponent {
	struct FMulticastSparseDelegate MetaResourcesUpdated; // 0xb0(0x01)
	struct FMulticastSparseDelegate MetaInventoryUpdated; // 0xb1(0x01)
	struct FMulticastSparseDelegate WorkshopPacksUpdated; // 0xb2(0x01)
	struct FMulticastSparseDelegate WorkshopPurchaseResult; // 0xb3(0x01)
	struct FMulticastSparseDelegate DropshipsUpdated; // 0xb4(0x01)
	struct FMulticastSparseDelegate DropshipCreationResult; // 0xb5(0x01)
	struct FMulticastSparseDelegate DropshipModificationResult; // 0xb6(0x01)
	struct FMulticastSparseDelegate DropshipDeletionResult; // 0xb7(0x01)
	struct FMulticastSparseDelegate PreparedLoadoutUpdated; // 0xb8(0x01)
	struct FMulticastSparseDelegate CharacterLoadoutUpdated; // 0xb9(0x01)
	struct FMulticastSparseDelegate LoadoutInventoryUpdated; // 0xba(0x01)
	struct FMulticastSparseDelegate LoadoutPackaged; // 0xbb(0x01)
	struct FMulticastSparseDelegate CreditsUpdated; // 0xbc(0x01)
	struct FMulticastSparseDelegate ProspectsUpdated; // 0xbd(0x01)
	struct FMulticastSparseDelegate ClaimedProspectResult; // 0xbe(0x01)
	struct FMulticastSparseDelegate SettleProspectResult; // 0xbf(0x01)
	struct FMulticastSparseDelegate NotificationsUpdated; // 0xc0(0x01)
	struct FMulticastSparseDelegate TalentModelUpdated; // 0xc1(0x01)
	struct FMulticastSparseDelegate TalentUnlocked; // 0xc2(0x01)
	struct FMulticastSparseDelegate TrackedStatisticsUpdateResult; // 0xc3(0x01)
	struct FMulticastSparseDelegate FactionMissionUpdateResult; // 0xc4(0x01)
	struct FMulticastSparseDelegate BackToHabResult; // 0xc5(0x01)
	struct FMulticastSparseDelegate GetCharacterProfileResult; // 0xc6(0x01)
	struct FMulticastSparseDelegate PackageLoadoutResult; // 0xc7(0x01)
	struct FMulticastSparseDelegate UpdateCharacterProgressResult; // 0xc8(0x01)
	struct FMulticastSparseDelegate UpdateCharacterTalentsResult; // 0xc9(0x01)
	char pad_CA[0x6]; // 0xca(0x06)
	struct UGetMetaResourceCallbackProxyGen* MetaResourcesCallback; // 0xd0(0x08)
	struct UGetMetaInventoryCallbackProxyGen* MetaInventoryCallback; // 0xd8(0x08)
	struct UGetLoadoutInventoryCallbackProxyGen* LoadoutInventoryCallback; // 0xe0(0x08)
	struct UGetWorkshopPacksCallbackProxyGen* WorkshopPacksCallback; // 0xe8(0x08)
	struct UBuyWorkshopPackCallbackProxyGen* BuyWorkshopPackCallback; // 0xf0(0x08)
	struct UMoveMetaInventoryItemCallbackProxyGen* ShiftMetaItemCallbackProxy; // 0xf8(0x08)
	struct URemoveMetaItemCallbackProxyGen* RemoveMetaItemCallbackProxy; // 0x100(0x08)
	struct UGetDropshipsCallbackProxyGen* GetDropshipsCallbackProxy; // 0x108(0x08)
	struct UCreateDropshipCallbackProxyGen* CreateDropshipsCallbackProxy; // 0x110(0x08)
	struct UModifyDropshipCallbackProxyGen* ModifyDropshipsCallbackProxy; // 0x118(0x08)
	struct UDeleteDropshipCallbackProxyGen* DeleteDropshipsCallbackProxy; // 0x120(0x08)
	struct USelectDropshipCallbackProxyGen* SelectDropshipCallbackProxy; // 0x128(0x08)
	struct URemoveSelectedDropshipCallbackProxyGen* RemoveSelectedDropshipCallbackProxy; // 0x130(0x08)
	struct USelectEnvirosuitCallbackProxyGen* SelectEnvirosuitCallbackProxy; // 0x138(0x08)
	struct URemoveEnvirosuitCallbackProxyGen* RemoveEnvirosuitCallbackProxy; // 0x140(0x08)
	struct UPackageLoadoutCallbackProxyGen* PackageLoadoutCallbackProxy; // 0x148(0x08)
	struct UUnpackageLoadoutCallbackProxyGen* UnpackageLoadoutCallbackProxy; // 0x150(0x08)
	struct UGetCharacterLoadoutCallbackProxyGen* CharacterLoadoutCallbackProxy; // 0x158(0x08)
	struct UGetPreparedLoadoutCallbackProxyGen* PreparedLoadoutCallbackProxy; // 0x160(0x08)
	struct UGetCreditsCallbackProxyGen* GetCreditsCallbackProxy; // 0x168(0x08)
	struct UGetAvailableProspectsCallbackProxyGen* GetAvailableProspectsCallbackProxy; // 0x170(0x08)
	struct UClaimProspectCallbackProxyGen* ClaimProspectCallbackProxy; // 0x178(0x08)
	struct USettleProspectCallbackProxyGen* SettleProspectCallbackProxy; // 0x180(0x08)
	struct UGetNotificationsCallbackProxyGen* GetNotificationsCallbackProxy; // 0x188(0x08)
	struct UClaimNotificationAttachmentsCallbackProxyGen* ClaimNotificationAttachmentsCallbackProxy; // 0x190(0x08)
	struct UDeleteNotificationCallbackProxyGen* DeleteNotificationCallbackProxy; // 0x198(0x08)
	struct UReadNotificationCallbackProxyGen* ReadNotificationCallbackProxy; // 0x1a0(0x08)
	struct UUpdateCharacterProgressCallbackProxyGen* UpdateCharacterProgressProxy; // 0x1a8(0x08)
	struct UUpdateTrackedStatsCallbackProxyGen* UpdateTrackedStatsCallbackProxy; // 0x1b0(0x08)
	struct UUpdateFactionMissionProgressCallbackProxyGen* UpdateFactionMissionProgressCallbackProxy; // 0x1b8(0x08)
	struct USyncTalentsCallbackProxyGen* SyncTalentsCallbackProxy; // 0x1c0(0x08)
	struct UGetCharacterProfileCallbackProxyGen* GetCharacterProfileCallbackProxy; // 0x1c8(0x08)
	struct UBackToHabCallbackProxyGen* BackToHabCallbackProxy; // 0x1d0(0x08)
	struct TMap<enum class ERateLimitedRequests, int32_t> RequestTimers; // 0x1d8(0x50)
	float CurrentTime; // 0x228(0x04)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct TArray<struct FMetaResource> MetaResources; // 0x230(0x10)
	int32_t Credits; // 0x240(0x04)
	char pad_244[0x4]; // 0x244(0x04)
	struct TArray<struct FMetaItem> MetaInventory; // 0x248(0x10)
	struct TArray<struct FMetaItem> LoadoutInventory; // 0x258(0x10)
	struct TArray<struct FBackendTalent> Talents; // 0x268(0x10)
	struct TArray<struct FWorkshopPack> WorkshopPacks; // 0x278(0x10)
	struct TArray<struct FDropship> Dropships; // 0x288(0x10)
	int32_t PreparedDropship; // 0x298(0x04)
	int32_t PreparedDropshipID; // 0x29c(0x04)
	struct FMetaItem PreparedEnvirosuit; // 0x2a0(0x40)
	struct FCharacterLoadout CharacterLoadout; // 0x2e0(0x138)
	bool PreparedLoadout; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct TArray<struct FProspectInfo> Prospects; // 0x420(0x10)
	struct TArray<struct FNotification> Notifications; // 0x430(0x10)

	void UpdateSelectedDropship(); // Function Icarus.BackendProxyComponent.UpdateSelectedDropship // (Final|Native|Public) // @ game+0x15010b0
	void TriggerWorkshopPurchaseResult(bool Success); // Function Icarus.BackendProxyComponent.TriggerWorkshopPurchaseResult // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1501020
	void TriggerTalentUnlocked(struct FTalentsRowHandle Talent, int32_t Rank, bool Success); // Function Icarus.BackendProxyComponent.TriggerTalentUnlocked // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1500eb0
	void TriggerProspectSettleResult(bool Success, struct FProspectInfo ProspectInfo); // Function Icarus.BackendProxyComponent.TriggerProspectSettleResult // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1500cf0
	void TriggerLoadoutPackage(); // Function Icarus.BackendProxyComponent.TriggerLoadoutPackage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1500cd0
	void TriggerDropshipModificationResult(bool Success); // Function Icarus.BackendProxyComponent.TriggerDropshipModificationResult // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1500c40
	void TriggerDropshipDeletionResult(bool Success); // Function Icarus.BackendProxyComponent.TriggerDropshipDeletionResult // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1500bb0
	void TriggerDropshipCreationResult(bool Success); // Function Icarus.BackendProxyComponent.TriggerDropshipCreationResult // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1500b20
	void TriggerClaimProspectResult(bool Success, struct FProspectInfo ProspectInfo); // Function Icarus.BackendProxyComponent.TriggerClaimProspectResult // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x15007a0
	void SetInitialTalents(struct TArray<struct FBackendTalent> InitialTalents); // Function Icarus.BackendProxyComponent.SetInitialTalents // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1500640
	void RetrieveCharacterLoadout(); // Function Icarus.BackendProxyComponent.RetrieveCharacterLoadout // (Final|Native|Public|BlueprintCallable) // @ game+0x1500620
	void Request_WorkshopPurchaseWorkshopPack(int32_t Index); // Function Icarus.BackendProxyComponent.Request_WorkshopPurchaseWorkshopPack // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1500590
	void Request_WorkshopPacks(); // Function Icarus.BackendProxyComponent.Request_WorkshopPacks // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x1500570
	void Request_UpdateTrackedStats(); // Function Icarus.BackendProxyComponent.Request_UpdateTrackedStats // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1500550
	void Request_UpdateFactionMissionProgress(struct FFactionMissionsRowHandle Mission, int32_t Progress); // Function Icarus.BackendProxyComponent.Request_UpdateFactionMissionProgress // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1500470
	void Request_UpdateCharacterProgress(); // Function Icarus.BackendProxyComponent.Request_UpdateCharacterProgress // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1500450
	void Request_UnpackageLoadout(); // Function Icarus.BackendProxyComponent.Request_UnpackageLoadout // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1500430
	void Request_UnlockTalent(struct FTalentsRowHandle Talent); // Function Icarus.BackendProxyComponent.Request_UnlockTalent // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1500380
	void Request_SyncTalents(); // Function Icarus.BackendProxyComponent.Request_SyncTalents // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1500360
	void Request_ShiftInventoryItem(struct UInventory* SourceInventory, struct UInventory* DestinationInventory, int32_t SourceSlot, int32_t DestinationSlot, int32_t Amount); // Function Icarus.BackendProxyComponent.Request_ShiftInventoryItem // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x15001d0
	void Request_SettleProspect(struct FString ProspectUID, bool SettleProspect); // Function Icarus.BackendProxyComponent.Request_SettleProspect // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x15000e0
	void Request_RemovePreparedEnvirosuit(); // Function Icarus.BackendProxyComponent.Request_RemovePreparedEnvirosuit // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x15000c0
	void Request_RemovePreparedDropship(); // Function Icarus.BackendProxyComponent.Request_RemovePreparedDropship // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x15000a0
	void Request_RemoveMetaItem(struct UInventory* SourceInventory, int32_t SourceSlot, int32_t Amount); // Function Icarus.BackendProxyComponent.Request_RemoveMetaItem // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14fffa0
	void Request_ReadNotification(struct FString NotificationID); // Function Icarus.BackendProxyComponent.Request_ReadNotification // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14ffef0
	void Request_PrepareEnvirosuit(struct UInventory* Inventory, int32_t Slot); // Function Icarus.BackendProxyComponent.Request_PrepareEnvirosuit // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x14ffe00
	void Request_PrepareDropship(int32_t Index); // Function Icarus.BackendProxyComponent.Request_PrepareDropship // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x14ffd70
	void Request_PreparedLoadout(); // Function Icarus.BackendProxyComponent.Request_PreparedLoadout // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14ffed0
	void Request_PackageLoadout(); // Function Icarus.BackendProxyComponent.Request_PackageLoadout // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14ffd50
	void Request_ModifyDropship(int32_t Index, struct FDropshipModification Dropship); // Function Icarus.BackendProxyComponent.Request_ModifyDropship // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14ffc20
	void Request_MetaResources(); // Function Icarus.BackendProxyComponent.Request_MetaResources // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x14ffc00
	void Request_MetaInventory(); // Function Icarus.BackendProxyComponent.Request_MetaInventory // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x14ffbe0
	void Request_LoadoutInventory(); // Function Icarus.BackendProxyComponent.Request_LoadoutInventory // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x14ffbc0
	void Request_LeaveProspectByDropship(); // Function Icarus.BackendProxyComponent.Request_LeaveProspectByDropship // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14ffba0
	void Request_GetNotifications(bool RequestCompleteList); // Function Icarus.BackendProxyComponent.Request_GetNotifications // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x14ffb10
	void Request_GetCharacterProfile(int32_t CharSlot); // Function Icarus.BackendProxyComponent.Request_GetCharacterProfile // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14ffa80
	void Request_Dropships(); // Function Icarus.BackendProxyComponent.Request_Dropships // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x14ffa60
	void Request_DeleteNotification(struct FString NotificationID); // Function Icarus.BackendProxyComponent.Request_DeleteNotification // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14ff9b0
	void Request_DeleteDropship(int32_t Index); // Function Icarus.BackendProxyComponent.Request_DeleteDropship // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14ff920
	void Request_Credits(); // Function Icarus.BackendProxyComponent.Request_Credits // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x14ff900
	void Request_CreateDropship(); // Function Icarus.BackendProxyComponent.Request_CreateDropship // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14ff8e0
	void Request_ClaimProspect(struct FProspectInfo ProspectInfo); // Function Icarus.BackendProxyComponent.Request_ClaimProspect // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14ff770
	void Request_ClaimNotificationAttachements(struct FString NotificationID); // Function Icarus.BackendProxyComponent.Request_ClaimNotificationAttachements // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14ff6c0
	void Request_CharacterLoadout(); // Function Icarus.BackendProxyComponent.Request_CharacterLoadout // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x14ff6a0
	void Request_AvailableProspects(); // Function Icarus.BackendProxyComponent.Request_AvailableProspects // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x14ff680
	void RemoveDropship(int32_t DropshipID); // Function Icarus.BackendProxyComponent.RemoveDropship // (Final|Native|Public) // @ game+0x14ff5f0
	bool RateLimitCheck(enum class ERateLimitedRequests RequestType); // Function Icarus.BackendProxyComponent.RateLimitCheck // (Final|Native|Public) // @ game+0x14ff560
	void ProcessResourceDelta(struct TArray<struct FMetaResource> ResourcesDelta); // Function Icarus.BackendProxyComponent.ProcessResourceDelta // (Final|Native|Public) // @ game+0x14ff3e0
	void ProcessInventoryDelta(struct FInventoryDelta InventoryDelta); // Function Icarus.BackendProxyComponent.ProcessInventoryDelta // (Final|Native|Public|HasOutParms) // @ game+0x14ff2d0
	void ProcessDropshipDelta(struct FDropshipDelta DropshipDelta); // Function Icarus.BackendProxyComponent.ProcessDropshipDelta // (Final|Native|Public) // @ game+0x14fed90
	void PrepareEnvirosuit(struct UInventory* Inventory, int32_t InventorySlot); // Function Icarus.BackendProxyComponent.PrepareEnvirosuit // (Final|Native|Public|BlueprintCallable) // @ game+0x14fecc0
	void PrepareDropship(int32_t Index); // Function Icarus.BackendProxyComponent.PrepareDropship // (Final|Native|Public|BlueprintCallable) // @ game+0x14fec30
	void OnWorkshopPacksRequestSuccess(struct FResGetWorkshopPacks Response); // Function Icarus.BackendProxyComponent.OnWorkshopPacksRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fea70
	void OnWorkshopPacksRequestFailure(struct FResGetWorkshopPacks Response); // Function Icarus.BackendProxyComponent.OnWorkshopPacksRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fe8b0
	void OnUpdateCharacterProgressSuccess(struct FResUpdateCharacterProgress Response); // Function Icarus.BackendProxyComponent.OnUpdateCharacterProgressSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fe820
	void OnUpdateCharacterProgressFailure(struct FResUpdateCharacterProgress Response); // Function Icarus.BackendProxyComponent.OnUpdateCharacterProgressFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fe790
	void OnUnpackageLoadoutRequestSuccess(struct FResUnpackageLoadout Response); // Function Icarus.BackendProxyComponent.OnUnpackageLoadoutRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fe6f0
	void OnUnpackageLoadoutRequestFailure(struct FResUnpackageLoadout Response); // Function Icarus.BackendProxyComponent.OnUnpackageLoadoutRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fe650
	void OnTrackedStatsUpdatedSuccess(struct FResUpdateTrackedStats Response); // Function Icarus.BackendProxyComponent.OnTrackedStatsUpdatedSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fe5c0
	void OnTrackedStatsUpdatedFailure(struct FResUpdateTrackedStats Response); // Function Icarus.BackendProxyComponent.OnTrackedStatsUpdatedFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fe530
	void OnSyncTalentsSuccess(struct FResSyncTalents Response); // Function Icarus.BackendProxyComponent.OnSyncTalentsSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fe450
	void OnSyncTalentsFailure(struct FResSyncTalents Response); // Function Icarus.BackendProxyComponent.OnSyncTalentsFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fe370
	void OnShiftMetaItemRequestSuccess(struct FResMoveMetaInventoryItem Response); // Function Icarus.BackendProxyComponent.OnShiftMetaItemRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fe290
	void OnShiftMetaItemRequestFailure(struct FResMoveMetaInventoryItem Response); // Function Icarus.BackendProxyComponent.OnShiftMetaItemRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fe1b0
	void OnSettleProspectSuccess(struct FResSettleProspect Response); // Function Icarus.BackendProxyComponent.OnSettleProspectSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fe030
	void OnSettleProspectFailure(struct FResSettleProspect Response); // Function Icarus.BackendProxyComponent.OnSettleProspectFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fdeb0
	void OnRep_WorkshopPacks(); // Function Icarus.BackendProxyComponent.OnRep_WorkshopPacks // (Final|Native|Public) // @ game+0x14fde10
	void OnRep_Talents(); // Function Icarus.BackendProxyComponent.OnRep_Talents // (Final|Native|Public) // @ game+0x14fddf0
	void OnRep_PreparedLoadout(); // Function Icarus.BackendProxyComponent.OnRep_PreparedLoadout // (Final|Native|Public) // @ game+0x14fddd0
	void OnRep_PreparedEnvirosuit(); // Function Icarus.BackendProxyComponent.OnRep_PreparedEnvirosuit // (Final|Native|Public) // @ game+0x14fddd0
	void OnRep_PreparedDropship(); // Function Icarus.BackendProxyComponent.OnRep_PreparedDropship // (Final|Native|Public) // @ game+0x14fddd0
	void OnRep_Notifications(); // Function Icarus.BackendProxyComponent.OnRep_Notifications // (Final|Native|Public) // @ game+0x14fddb0
	void OnRep_MetaResources(); // Function Icarus.BackendProxyComponent.OnRep_MetaResources // (Final|Native|Public) // @ game+0x14fdd90
	void OnRep_MetaInventory(); // Function Icarus.BackendProxyComponent.OnRep_MetaInventory // (Final|Native|Public) // @ game+0x14fdd70
	void OnRep_LoadoutInventory(); // Function Icarus.BackendProxyComponent.OnRep_LoadoutInventory // (Final|Native|Public) // @ game+0x14fdd50
	void OnRep_Dropships(); // Function Icarus.BackendProxyComponent.OnRep_Dropships // (Final|Native|Public) // @ game+0x14fdd30
	void OnRep_Credits(); // Function Icarus.BackendProxyComponent.OnRep_Credits // (Final|Native|Public) // @ game+0x14fdd10
	void OnRep_CharacterLoadout(); // Function Icarus.BackendProxyComponent.OnRep_CharacterLoadout // (Final|Native|Public) // @ game+0x14fdcf0
	void OnRep_AvailableProspects(); // Function Icarus.BackendProxyComponent.OnRep_AvailableProspects // (Final|Native|Public) // @ game+0x14fdcd0
	void OnRemovePreparedEnvirosuitRequestSuccess(struct FResRemoveEnvirosuit Response); // Function Icarus.BackendProxyComponent.OnRemovePreparedEnvirosuitRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fdb50
	void OnRemovePreparedEnvirosuitRequestFailure(struct FResRemoveEnvirosuit Response); // Function Icarus.BackendProxyComponent.OnRemovePreparedEnvirosuitRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fd9d0
	void OnRemovePreparedDropshipRequestSuccess(struct FResRemoveSelectedDropship Response); // Function Icarus.BackendProxyComponent.OnRemovePreparedDropshipRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fd930
	void OnRemovePreparedDropshipRequestFailure(struct FResRemoveSelectedDropship Response); // Function Icarus.BackendProxyComponent.OnRemovePreparedDropshipRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fd890
	void OnRemoveMetaItemRequestSuccess(struct FResRemoveMetaInventoryItem Response); // Function Icarus.BackendProxyComponent.OnRemoveMetaItemRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fd770
	void OnRemoveMetaItemRequestFailure(struct FResRemoveMetaInventoryItem Response); // Function Icarus.BackendProxyComponent.OnRemoveMetaItemRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fd650
	void OnReadNotificationSuccess(struct FResReadNotification Response); // Function Icarus.BackendProxyComponent.OnReadNotificationSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fd5a0
	void OnReadNotificationFailure(struct FResReadNotification Response); // Function Icarus.BackendProxyComponent.OnReadNotificationFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fd4f0
	void OnPurchaseWorkshopPackRequestSuccess(struct FResPurchaseWorkshopPack Response); // Function Icarus.BackendProxyComponent.OnPurchaseWorkshopPackRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fd390
	void OnPurchaseWorkshopPackRequestFailure(struct FResPurchaseWorkshopPack Response); // Function Icarus.BackendProxyComponent.OnPurchaseWorkshopPackRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fd230
	void OnPrepareEnvirosuitRequestSuccess(struct FResSelectEnvirosuit Response); // Function Icarus.BackendProxyComponent.OnPrepareEnvirosuitRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fceb0
	void OnPrepareEnvirosuitRequestFailure(struct FResSelectEnvirosuit Response); // Function Icarus.BackendProxyComponent.OnPrepareEnvirosuitRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fcd30
	void OnPrepareDropshipRequestSuccess(struct FResSelectDropship Response); // Function Icarus.BackendProxyComponent.OnPrepareDropshipRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fcc90
	void OnPrepareDropshipRequestFailure(struct FResSelectDropship Response); // Function Icarus.BackendProxyComponent.OnPrepareDropshipRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fcbf0
	void OnPreparedLoadoutRequestSuccess(struct FResPreparedLoadout Response); // Function Icarus.BackendProxyComponent.OnPreparedLoadoutRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fd130
	void OnPreparedLoadoutRequestFailure(struct FResPreparedLoadout Response); // Function Icarus.BackendProxyComponent.OnPreparedLoadoutRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fd030
	void OnPackageLoadoutRequestFailure(struct FResPackageLoadout Response); // Function Icarus.BackendProxyComponent.OnPackageLoadoutRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fca40
	void OnOnPackageLoadoutRequestSuccess(struct FResPackageLoadout Response); // Function Icarus.BackendProxyComponent.OnOnPackageLoadoutRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fc890
	void OnModifyDropshipsRequestSuccess(struct FResModifyDropship Response); // Function Icarus.BackendProxyComponent.OnModifyDropshipsRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fc660
	void OnModifyDropshipsRequestFailure(struct FResModifyDropship Response); // Function Icarus.BackendProxyComponent.OnModifyDropshipsRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fc4b0
	void OnMetaResourcesRequestSuccess(struct FResGetMetaResources Response); // Function Icarus.BackendProxyComponent.OnMetaResourcesRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fc3d0
	void OnMetaResourcesRequestFailure(struct FResGetMetaResources Response); // Function Icarus.BackendProxyComponent.OnMetaResourcesRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fc2f0
	void OnLoadoutInventoryRequest(struct FResLoadoutInventory Response); // Function Icarus.BackendProxyComponent.OnLoadoutInventoryRequest // (Final|Native|Public|HasOutParms) // @ game+0x14fc160
	void OnInventoryRequestSuccess(struct FResGetMetaInventory Response); // Function Icarus.BackendProxyComponent.OnInventoryRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fc040
	void OnInventoryRequestFailure(struct FResGetMetaInventory Response); // Function Icarus.BackendProxyComponent.OnInventoryRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fbf20
	void OnGetNotificationsSuccess(struct FResGetNotifications Response); // Function Icarus.BackendProxyComponent.OnGetNotificationsSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fbdd0
	void OnGetNotificationsFailure(struct FResGetNotifications Response); // Function Icarus.BackendProxyComponent.OnGetNotificationsFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fbc80
	void OnGetDropshipsRequestSuccess(struct FResGetDropships Response); // Function Icarus.BackendProxyComponent.OnGetDropshipsRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fbae0
	void OnGetDropshipsRequestFailure(struct FResGetDropships Response); // Function Icarus.BackendProxyComponent.OnGetDropshipsRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fb940
	void OnGetCreditsRequestSuccess(struct FResGetCredits Response); // Function Icarus.BackendProxyComponent.OnGetCreditsRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fb8a0
	void OnGetCreditsRequestFailure(struct FResGetCredits Response); // Function Icarus.BackendProxyComponent.OnGetCreditsRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fb800
	void OnGetCharacterProfileSuccess(struct FResGetCharacterProfile Response); // Function Icarus.BackendProxyComponent.OnGetCharacterProfileSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fb750
	void OnGetCharacterProfileFailure(struct FResGetCharacterProfile Response); // Function Icarus.BackendProxyComponent.OnGetCharacterProfileFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fb6a0
	void OnGetAvailableProspectsSuccess(struct FResGetAvailableProspects Response); // Function Icarus.BackendProxyComponent.OnGetAvailableProspectsSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fb580
	void OnGetAvailableProspectsFailure(struct FResGetAvailableProspects Response); // Function Icarus.BackendProxyComponent.OnGetAvailableProspectsFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fb460
	void OnFactionMissionUpdateSuccess(struct FResUpdateFactionMissionProgress Response); // Function Icarus.BackendProxyComponent.OnFactionMissionUpdateSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fb3d0
	void OnFactionMissionUpdateFailure(struct FResUpdateFactionMissionProgress Response); // Function Icarus.BackendProxyComponent.OnFactionMissionUpdateFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fb340
	void OnDeleteNotificationSuccess(struct FResDeleteNotification Response); // Function Icarus.BackendProxyComponent.OnDeleteNotificationSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fb210
	void OnDeleteNotificationFailure(struct FResDeleteNotification Response); // Function Icarus.BackendProxyComponent.OnDeleteNotificationFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fb160
	void OnDeleteDropshipsRequestSuccess(struct FResDeleteDropship Response); // Function Icarus.BackendProxyComponent.OnDeleteDropshipsRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fb040
	void OnDeleteDropshipsRequestFailure(struct FResDeleteDropship Response); // Function Icarus.BackendProxyComponent.OnDeleteDropshipsRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14faf20
	void OnCreateDropshipsRequestSuccess(struct FResCreateDropship Response); // Function Icarus.BackendProxyComponent.OnCreateDropshipsRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fad70
	void OnCreateDropshipsRequestFailure(struct FResCreateDropship Response); // Function Icarus.BackendProxyComponent.OnCreateDropshipsRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fabc0
	void OnClaimProspectSuccess(struct FResClaimProspect Response); // Function Icarus.BackendProxyComponent.OnClaimProspectSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14faa40
	void OnClaimProspectFailure(struct FResClaimProspect Response); // Function Icarus.BackendProxyComponent.OnClaimProspectFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fa8c0
	void OnClaimNotificationAttachmentsSuccess(struct FResClaimNotificationAttachments Response); // Function Icarus.BackendProxyComponent.OnClaimNotificationAttachmentsSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fa750
	void OnClaimNotificationAttachmentsFailure(struct FResClaimNotificationAttachments Response); // Function Icarus.BackendProxyComponent.OnClaimNotificationAttachmentsFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fa5e0
	void OnCharacterLoadoutRequestSuccess(struct FResGetCharacterLoadout Response); // Function Icarus.BackendProxyComponent.OnCharacterLoadoutRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fa530
	void OnCharacterLoadoutRequestFailure(struct FResGetCharacterLoadout Response); // Function Icarus.BackendProxyComponent.OnCharacterLoadoutRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fa480
	void OnBackToHabSuccess(struct FResBackToHab Response); // Function Icarus.BackendProxyComponent.OnBackToHabSuccess // (Final|Native|Public|HasOutParms) // @ game+0x14fa3f0
	void OnBackToHabFailure(struct FResBackToHab Response); // Function Icarus.BackendProxyComponent.OnBackToHabFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fa360
	void LoadoutInventoryRequestFailure(struct FResLoadoutInventory Response); // Function Icarus.BackendProxyComponent.LoadoutInventoryRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x14fa1d0
	struct TArray<struct FWorkshopPack> GetWorkshopPacks(); // Function Icarus.BackendProxyComponent.GetWorkshopPacks // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x14fa190
	struct TArray<struct FBackendTalent> GetTalents(); // Function Icarus.BackendProxyComponent.GetTalents // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x14fa070
	struct TArray<struct FProspectInfo> GetProspects(); // Function Icarus.BackendProxyComponent.GetProspects // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x14fa030
	struct TArray<struct FNotification> GetNotifications(); // Function Icarus.BackendProxyComponent.GetNotifications // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f9fc0
	struct TArray<struct FMetaResource> GetMetaResources(); // Function Icarus.BackendProxyComponent.GetMetaResources // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f9f80
	struct TArray<struct FMetaItem> GetMetaInventory(); // Function Icarus.BackendProxyComponent.GetMetaInventory // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f9f40
	struct TArray<struct FMetaItem> GetLoadoutInventory(); // Function Icarus.BackendProxyComponent.GetLoadoutInventory // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f9f00
	struct TArray<struct FDropship> GetDropships(); // Function Icarus.BackendProxyComponent.GetDropships // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f9ec0
	int32_t GetCredits(); // Function Icarus.BackendProxyComponent.GetCredits // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f9e90
	struct FCharacterLoadout GetCharacterLoadout(); // Function Icarus.BackendProxyComponent.GetCharacterLoadout // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x14f9e50
};

// Class Icarus.BallisticComponent
// Size: 0x360 (Inherited: 0xd0)
struct UBallisticComponent : UTraitComponent {
	struct FMulticastSparseDelegate OnFireProjectile; // 0xd0(0x01)
	bool bHasBeenFired; // 0xd1(0x01)
	char pad_D2[0x6]; // 0xd2(0x06)
	struct UIcarusProjectileComponent* ProjectileMovementComponent; // 0xd8(0x08)
	struct USphereComponent* CollisionComponent; // 0xe0(0x08)
	struct FMulticastSparseDelegate OnProjectileHit; // 0xe8(0x01)
	bool bIsProjectileActive; // 0xe9(0x01)
	char pad_EA[0x6]; // 0xea(0x06)
	struct FBallisticData CachedBallisticData; // 0xf0(0x148)
	struct AActor* FiringActor; // 0x238(0x08)
	char pad_240[0x120]; // 0x240(0x120)

	void SetProjectileActive(bool Active); // Function Icarus.BallisticComponent.SetProjectileActive // (Final|Native|Public|BlueprintCallable) // @ game+0x1507230
	void ProjectileHit(struct FHitResult Hit); // Function Icarus.BallisticComponent.ProjectileHit // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1506b60
	void ProjectileBounce(struct FHitResult Hit, struct FVector ImpactVelocity); // Function Icarus.BallisticComponent.ProjectileBounce // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x1506a30
	void OnRep_bIsProjectileActive(); // Function Icarus.BallisticComponent.OnRep_bIsProjectileActive // (Final|Native|Protected) // @ game+0x1506a10
	void OnProjectileDeactivated(); // Function Icarus.BallisticComponent.OnProjectileDeactivated // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x15069f0
	void OnProjectileActivated(); // Function Icarus.BallisticComponent.OnProjectileActivated // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x14d6e50
	struct FStatContainer GetDamageStatContainer(); // Function Icarus.BallisticComponent.GetDamageStatContainer // (Final|Native|Public) // @ game+0x1505940
	int32_t GetDamageStat(struct FStatsEnum InStat); // Function Icarus.BallisticComponent.GetDamageStat // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1505890
	bool GetBallisticData(struct FBallisticData OutData); // Function Icarus.BallisticComponent.GetBallisticData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1505370
	void FireProjectile_Internal(struct FVector Impulse, struct FVector InstigatorVelocity, struct FProjectileFireParams AdvancedParameters); // Function Icarus.BallisticComponent.FireProjectile_Internal // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x1505250
	void FireProjectile(struct FVector Impulse, struct FVector InstigatorVelocity, struct FProjectileFireParams AdvancedParameters, struct AActor* Instigator); // Function Icarus.BallisticComponent.FireProjectile // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|BlueprintCallable) // @ game+0x15050e0
	bool CleanupBallistic(); // Function Icarus.BallisticComponent.CleanupBallistic // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1504a50
	void CheckWithinCullDistance(); // Function Icarus.BallisticComponent.CheckWithinCullDistance // (Final|Native|Protected) // @ game+0x1504a30
};

// Class Icarus.BallisticLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBallisticLibrary : URowLibrary {

	struct FBallisticRowHandle StructToRowHandle(struct FBallisticEnum EnumValue); // Function Icarus.BallisticLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1507540
	struct FName StructToName(struct FBallisticEnum EnumValue); // Function Icarus.BallisticLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1507400
	int32_t StructToInt(struct FBallisticEnum EnumValue); // Function Icarus.BallisticLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15072c0
	struct FBallisticEnum RowHandleToStruct(struct FBallisticRowHandle RowHandle); // Function Icarus.BallisticLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1506fe0
	void RemoveRowFromBallisticTable(struct FName Name); // Function Icarus.BallisticLibrary.RemoveRowFromBallisticTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1506c80
	void RefreshConstants(); // Function Icarus.BallisticLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1506c40
	int32_t NumRows(); // Function Icarus.BallisticLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1506990
	bool NotEqual_EnumName(struct FBallisticEnum A, struct FName B); // Function Icarus.BallisticLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15067b0
	bool NotEqual_EnumEnum(struct FBallisticEnum A, struct FBallisticEnum B); // Function Icarus.BallisticLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15065d0
	struct FBallisticEnum NameToStruct(struct FName NameValue); // Function Icarus.BallisticLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15064b0
	int32_t NameToInt(struct FName NameValue); // Function Icarus.BallisticLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1506390
	struct FBallisticRowHandle MakeLiteralBallistic(struct FBallisticRowHandle RowHandle); // Function Icarus.BallisticLibrary.MakeLiteralBallistic // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15061f0
	struct FBallisticRowHandle MakeBallisticFromIndex(int32_t Index); // Function Icarus.BallisticLibrary.MakeBallisticFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1505e80
	struct FBallisticEnum MakeBallisticEnum(struct FBallisticEnum Enum); // Function Icarus.BallisticLibrary.MakeBallisticEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1505e00
	struct FBallisticRowHandle MakeBallistic(struct FName RowName); // Function Icarus.BallisticLibrary.MakeBallistic // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1505d60
	bool IsValidName(struct FName NameValue); // Function Icarus.BallisticLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1505c40
	struct FBallisticEnum IntToStruct(int32_t IntValue); // Function Icarus.BallisticLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1505b20
	struct FName IntToName(int32_t IntValue); // Function Icarus.BallisticLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1505a00
	void GetBallisticStruct(struct FBallisticRowHandle RowHandle, struct FBallisticData Ballistic, enum class EValid Paths); // Function Icarus.BallisticLibrary.GetBallisticStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1505520
	bool EqualEqual_FBallisticRowHandleFBallisticRowHandle(struct FBallisticRowHandle RowHandleA, struct FBallisticRowHandle RowHandleB); // Function Icarus.BallisticLibrary.EqualEqual_FBallisticRowHandleFBallisticRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1504dd0
	bool EqualEqual_EnumEnum(struct FBallisticEnum A, struct FBallisticEnum B); // Function Icarus.BallisticLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1504bf0
	struct FBallisticRowHandle CastToBallisticRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.BallisticLibrary.CastToBallisticRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x15047f0
	void BreakBallisticEnum(struct FBallisticEnum Enum, struct FName Name, int32_t Index); // Function Icarus.BallisticLibrary.BreakBallisticEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x15043d0
	void AddRowToBallisticTable(struct FName Name, struct FBallisticData Data, struct FBallisticRowHandle NewRow); // Function Icarus.BallisticLibrary.AddRowToBallisticTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1503ff0
};

// Class Icarus.BallisticPoolManager
// Size: 0x100 (Inherited: 0xb0)
struct UBallisticPoolManager : UActorComponent {
	char pad_B0[0x50]; // 0xb0(0x50)

	struct AIcarusItem* RequestProjectile(struct FItemData ProjectileData, struct FTransform SpawnTransform, struct AActor* Owner); // Function Icarus.BallisticPoolManager.RequestProjectile // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1506d80
	void DestroyProjectile(struct AIcarusItem* InProjectile, bool bSkipPoolRemoval); // Function Icarus.BallisticPoolManager.DestroyProjectile // (Final|Native|Public|BlueprintCallable) // @ game+0x1504b20
	bool DeactivateProjectile(struct AIcarusItem* InProjectile); // Function Icarus.BallisticPoolManager.DeactivateProjectile // (Final|Native|Public|BlueprintCallable) // @ game+0x1504a80
};

// Class Icarus.BallisticTable
// Size: 0xb8 (Inherited: 0xb8)
struct UBallisticTable : UIcarusDataTable {
};

// Class Icarus.StatsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UStatsLibrary : URowLibrary {

	struct FStatsRowHandle StructToRowHandle(struct FStatsEnum EnumValue); // Function Icarus.StatsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b8980
	struct FName StructToName(struct FStatsEnum EnumValue); // Function Icarus.StatsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b8830
	int32_t StructToInt(struct FStatsEnum EnumValue); // Function Icarus.StatsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b86f0
	struct FStatsEnum RowHandleToStruct(struct FStatsRowHandle RowHandle); // Function Icarus.StatsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b8420
	void RemoveRowFromStatsTable(struct FName Name); // Function Icarus.StatsLibrary.RemoveRowFromStatsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x16b81f0
	void RefreshConstants(); // Function Icarus.StatsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x16b8150
	int32_t NumRows(); // Function Icarus.StatsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b7e20
	bool NotEqual_EnumName(struct FStatsEnum A, struct FName B); // Function Icarus.StatsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b7d00
	bool NotEqual_EnumEnum(struct FStatsEnum A, struct FStatsEnum B); // Function Icarus.StatsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b7b20
	struct FStatsEnum NameToStruct(struct FName NameValue); // Function Icarus.StatsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b79a0
	int32_t NameToInt(struct FName NameValue); // Function Icarus.StatsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x16b7880
	struct FStatsRowHandle MakeStatsFromIndex(int32_t Index); // Function Icarus.StatsLibrary.MakeStatsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b7690
	struct FStatsEnum MakeStatsEnum(struct FStatsEnum Enum); // Function Icarus.StatsLibrary.MakeStatsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b7610
	struct FStatsRowHandle MakeStats(struct FName RowName); // Function Icarus.StatsLibrary.MakeStats // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b7570
	struct FStatsRowHandle MakeLiteralStats(struct FStatsRowHandle RowHandle); // Function Icarus.StatsLibrary.MakeLiteralStats // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b72f0
	bool IsValidName(struct FName NameValue); // Function Icarus.StatsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x16b7190
	struct FStatsEnum IntToStruct(int32_t IntValue); // Function Icarus.StatsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b7070
	struct FName IntToName(int32_t IntValue); // Function Icarus.StatsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x16b6f50
	void GetStatsStruct(struct FStatsRowHandle RowHandle, struct FIcarusStatDescription Stats, enum class EValid Paths); // Function Icarus.StatsLibrary.GetStatsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16b6a80
	bool EqualEqual_FStatsRowHandleFStatsRowHandle(struct FStatsRowHandle RowHandleA, struct FStatsRowHandle RowHandleB); // Function Icarus.StatsLibrary.EqualEqual_FStatsRowHandleFStatsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b61d0
	bool EqualEqual_EnumEnum(struct FStatsEnum A, struct FStatsEnum B); // Function Icarus.StatsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16b5fa0
	struct FStatsRowHandle CastToStatsRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.StatsLibrary.CastToStatsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16b5be0
	void BreakStatsEnum(struct FStatsEnum Enum, struct FName Name, int32_t Index); // Function Icarus.StatsLibrary.BreakStatsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x16b5960
	void AddRowToStatsTable(struct FName Name, struct FIcarusStatDescription Data, struct FStatsRowHandle NewRow); // Function Icarus.StatsLibrary.AddRowToStatsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16b5690
};

// Class Icarus.BaseStatsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBaseStatsLibrary : UStatsLibrary {

	struct FBaseStatsEnum MakeBaseStatsEnum(struct FBaseStatsEnum Enum); // Function Icarus.BaseStatsLibrary.MakeBaseStatsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1505f10
	bool Filter(int32_t Index); // Function Icarus.BaseStatsLibrary.Filter // (Final|Native|Static|Public) // @ game+0x1505050
	void BreakBaseStatsEnum(struct FBaseStatsEnum Enum, struct FName Name, int32_t Index); // Function Icarus.BaseStatsLibrary.BreakBaseStatsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1504530
};

// Class Icarus.BedRecorderInterface
// Size: 0x28 (Inherited: 0x28)
struct UBedRecorderInterface : UInterface {

	void SetPlayerUIDArray(struct TArray<struct FString> PlayerUIDArray); // Function Icarus.BedRecorderInterface.SetPlayerUIDArray // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1507160
	struct TArray<struct FString> GetPlayerUIDArray(); // Function Icarus.BedRecorderInterface.GetPlayerUIDArray // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1505980
};

// Class Icarus.ItemStateRecorderComponent
// Size: 0x1b0 (Inherited: 0x150)
struct UItemStateRecorderComponent : UActorStateRecorderComponent {
	struct FName StaticItemDataRowName; // 0x148(0x08)
	struct FString DatabaseGUID; // 0x150(0x10)
	struct TArray<struct FItemRecordDynamicData> DynamicData; // 0x160(0x10)
	struct TArray<struct FItemRecordStatData> Stats; // 0x170(0x10)
	enum class EIcarusItemContext SpawnedContext; // 0x180(0x01)
	struct FIcarusItemConstructionParameters ConstructionParameters; // 0x188(0x28)
};

// Class Icarus.DeployableRecorderComponent
// Size: 0x1d0 (Inherited: 0x1b0)
struct UDeployableRecorderComponent : UItemStateRecorderComponent {
	struct FDeployableRecord DeployableRecord; // 0x1b0(0x20)
};

// Class Icarus.BedRecorderComponent
// Size: 0x1e0 (Inherited: 0x1d0)
struct UBedRecorderComponent : UDeployableRecorderComponent {
	struct TArray<struct FString> PlayerUIDArrayRecord; // 0x1d0(0x10)
};

// Class Icarus.BiomesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBiomesLibrary : URowLibrary {

	struct FBiomesRowHandle StructToRowHandle(struct FBiomesEnum EnumValue); // Function Icarus.BiomesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15075f0
	struct FName StructToName(struct FBiomesEnum EnumValue); // Function Icarus.BiomesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15074a0
	int32_t StructToInt(struct FBiomesEnum EnumValue); // Function Icarus.BiomesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1507360
	struct FBiomesEnum RowHandleToStruct(struct FBiomesRowHandle RowHandle); // Function Icarus.BiomesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15070a0
	void RemoveRowFromBiomesTable(struct FName Name); // Function Icarus.BiomesLibrary.RemoveRowFromBiomesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1506d00
	void RefreshConstants(); // Function Icarus.BiomesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1506c60
	int32_t NumRows(); // Function Icarus.BiomesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15069c0
	bool NotEqual_EnumName(struct FBiomesEnum A, struct FName B); // Function Icarus.BiomesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15068a0
	bool NotEqual_EnumEnum(struct FBiomesEnum A, struct FBiomesEnum B); // Function Icarus.BiomesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15066c0
	struct FBiomesEnum NameToStruct(struct FName NameValue); // Function Icarus.BiomesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1506540
	int32_t NameToInt(struct FName NameValue); // Function Icarus.BiomesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1506420
	struct FBiomesRowHandle MakeLiteralBiomes(struct FBiomesRowHandle RowHandle); // Function Icarus.BiomesLibrary.MakeLiteralBiomes // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15062c0
	struct FBiomesRowHandle MakeBiomesRowFromColor(struct FColor InColor); // Function Icarus.BiomesLibrary.MakeBiomesRowFromColor // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1506150
	struct FBiomesRowHandle MakeBiomesFromIndex(int32_t Index); // Function Icarus.BiomesLibrary.MakeBiomesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15060c0
	struct FBiomesEnum MakeBiomesEnum(struct FBiomesEnum Enum); // Function Icarus.BiomesLibrary.MakeBiomesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1506040
	struct FBiomesRowHandle MakeBiomes(struct FName RowName); // Function Icarus.BiomesLibrary.MakeBiomes // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1505fa0
	bool IsValidName(struct FName NameValue); // Function Icarus.BiomesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1505cd0
	struct FBiomesEnum IntToStruct(int32_t IntValue); // Function Icarus.BiomesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1505bb0
	struct FName IntToName(int32_t IntValue); // Function Icarus.BiomesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1505a90
	void GetBiomesStruct(struct FBiomesRowHandle RowHandle, struct FIcarusBiome Biomes, enum class EValid Paths); // Function Icarus.BiomesLibrary.GetBiomesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x15056f0
	bool EqualEqual_FBiomesRowHandleFBiomesRowHandle(struct FBiomesRowHandle RowHandleA, struct FBiomesRowHandle RowHandleB); // Function Icarus.BiomesLibrary.EqualEqual_FBiomesRowHandleFBiomesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1504f10
	bool EqualEqual_EnumEnum(struct FBiomesEnum A, struct FBiomesEnum B); // Function Icarus.BiomesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1504ce0
	struct FBiomesRowHandle CastToBiomesRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.BiomesLibrary.CastToBiomesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1504910
	void BreakBiomesEnum(struct FBiomesEnum Enum, struct FName Name, int32_t Index); // Function Icarus.BiomesLibrary.BreakBiomesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1504690
	void AddRowToBiomesTable(struct FName Name, struct FIcarusBiome Data, struct FBiomesRowHandle NewRow); // Function Icarus.BiomesLibrary.AddRowToBiomesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x15041a0
};

// Class Icarus.BiomesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UBiomesTable : UIcarusDataTable {
};

// Class Icarus.TalentControllerComponent
// Size: 0xf8 (Inherited: 0xb0)
struct UTalentControllerComponent : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
	struct FMulticastInlineDelegate OnModelViewChangedEvent; // 0xb8(0x10)
	struct UTalentModelInterface* Model; // 0xc8(0x08)
	struct UTalentViewInterface* View; // 0xd0(0x08)
	char pad_D8[0x20]; // 0xd8(0x20)

	void TriggerModelStateRefresh(); // Function Icarus.TalentControllerComponent.TriggerModelStateRefresh // (Final|Native|Protected) // @ game+0x16c5560
	void Setup(struct UActorState* ActorState); // Function Icarus.TalentControllerComponent.Setup // (Native|Public) // @ game+0x16c5060
	void OnTalentUnlocked(struct FTalentsRowHandle Talent, int32_t Rank); // Function Icarus.TalentControllerComponent.OnTalentUnlocked // (Final|Native|Protected) // @ game+0x16c4880
	void OnModelViewChanged(struct UTalentModelInterface* InModel, struct UTalentViewInterface* InView); // Function Icarus.TalentControllerComponent.OnModelViewChanged // (Event|Public|BlueprintEvent) // @ game+0x1a38c80
	void OnLevelUp(); // Function Icarus.TalentControllerComponent.OnLevelUp // (Final|Native|Protected) // @ game+0x16c4860
	void OnFlagsUpdated(); // Function Icarus.TalentControllerComponent.OnFlagsUpdated // (Final|Native|Protected) // @ game+0x16c4840
	void NativeModelStateChanged(struct UTalentModelInterface_Const* InModel); // Function Icarus.TalentControllerComponent.NativeModelStateChanged // (Final|Native|Public) // @ game+0x16c4390
};

// Class Icarus.BlueprintTalentControllerComponent
// Size: 0xf8 (Inherited: 0xf8)
struct UBlueprintTalentControllerComponent : UTalentControllerComponent {
};

// Class Icarus.TalentModelInterface_Const
// Size: 0xd8 (Inherited: 0x28)
struct UTalentModelInterface_Const : UObject {
	struct FMulticastInlineDelegate OnModelStateChanged; // 0x28(0x10)
	char pad_38[0xa0]; // 0x38(0xa0)

	void OnModelViewChanged(struct UTalentModelInterface* InModel, struct UTalentViewInterface* InView); // Function Icarus.TalentModelInterface_Const.OnModelViewChanged // (Event|Public|BlueprintEvent) // @ game+0x1a38c80
	bool IsTalentUnlocked(struct FTalentsRowHandle Talent); // Function Icarus.TalentModelInterface_Const.IsTalentUnlocked // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c3a80
	int32_t GetTotalPoints(); // Function Icarus.TalentModelInterface_Const.GetTotalPoints // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c3780
	struct TArray<struct FTalentTreesRowHandle> GetTalentTreesForArchetype(struct FTalentArchetypesRowHandle Archetype); // Function Icarus.TalentModelInterface_Const.GetTalentTreesForArchetype // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c34e0
	struct TArray<struct FTalentTreesRowHandle> GetTalentTrees(); // Function Icarus.TalentModelInterface_Const.GetTalentTrees // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c3440
	bool GetTalentState(struct FTalentsRowHandle Talent, struct FTalentModelData OutData); // Function Icarus.TalentModelInterface_Const.GetTalentState // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c3250
	struct TArray<struct FTalentsRowHandle> GetTalents(); // Function Icarus.TalentModelInterface_Const.GetTalents // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c35e0
	int32_t GetSpentPointsForTree(struct FTalentTreesRowHandle TalentTree); // Function Icarus.TalentModelInterface_Const.GetSpentPointsForTree // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c2e40
	int32_t GetSpentPoints(); // Function Icarus.TalentModelInterface_Const.GetSpentPoints // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c2e10
	struct FTalentModelsRowHandle GetModelRowHandle(); // Function Icarus.TalentModelInterface_Const.GetModelRowHandle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c2c80
	struct FTalentModelsRowHandle GetModelData(); // Function Icarus.TalentModelInterface_Const.GetModelData // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c2c40
	int32_t GetLevel(); // Function Icarus.TalentModelInterface_Const.GetLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c2b10
	struct TScriptInterface<ITalentControllerInterface> GetController(); // Function Icarus.TalentModelInterface_Const.GetController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c2ad0
	int32_t GetAvailablePoints(); // Function Icarus.TalentModelInterface_Const.GetAvailablePoints // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c2aa0
	struct TArray<struct FTalentArchetypesRowHandle> GetArchetypes(); // Function Icarus.TalentModelInterface_Const.GetArchetypes // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c2a00
	bool CanUnlockTalent(struct FTalentsRowHandle Talent, int32_t Rank); // Function Icarus.TalentModelInterface_Const.CanUnlockTalent // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x16c2190
};

// Class Icarus.TalentModelInterface
// Size: 0xd8 (Inherited: 0xd8)
struct UTalentModelInterface : UTalentModelInterface_Const {

	void SpendPoints(int32_t NumPoints); // Function Icarus.TalentModelInterface.SpendPoints // (Final|Native|Public|BlueprintCallable) // @ game+0x16c50f0
	void SetLevel(int32_t InLevel); // Function Icarus.TalentModelInterface.SetLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x16c4d90
	void SetController(struct TScriptInterface<ITalentControllerInterface> InController); // Function Icarus.TalentModelInterface.SetController // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x16c4c60
	void ResetTalents(); // Function Icarus.TalentModelInterface.ResetTalents // (Final|Native|Public|BlueprintCallable) // @ game+0x16c4ac0
};

// Class Icarus.BlueprintTalentModel
// Size: 0xd8 (Inherited: 0xd8)
struct UBlueprintTalentModel : UTalentModelInterface {
};

// Class Icarus.BlueprintUnlocksLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBlueprintUnlocksLibrary : URowLibrary {

	struct FBlueprintUnlocksRowHandle StructToRowHandle(struct FBlueprintUnlocksEnum EnumValue); // Function Icarus.BlueprintUnlocksLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150eab0
	struct FName StructToName(struct FBlueprintUnlocksEnum EnumValue); // Function Icarus.BlueprintUnlocksLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150e8d0
	int32_t StructToInt(struct FBlueprintUnlocksEnum EnumValue); // Function Icarus.BlueprintUnlocksLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150e6f0
	struct FBlueprintUnlocksEnum RowHandleToStruct(struct FBlueprintUnlocksRowHandle RowHandle); // Function Icarus.BlueprintUnlocksLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150e420
	void RemoveRowFromBlueprintUnlocksTable(struct FName Name); // Function Icarus.BlueprintUnlocksLibrary.RemoveRowFromBlueprintUnlocksTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x150e2a0
	void RefreshConstants(); // Function Icarus.BlueprintUnlocksLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x150e240
	int32_t NumRows(); // Function Icarus.BlueprintUnlocksLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150e1b0
	bool NotEqual_EnumName(struct FBlueprintUnlocksEnum A, struct FName B); // Function Icarus.BlueprintUnlocksLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150dee0
	bool NotEqual_EnumEnum(struct FBlueprintUnlocksEnum A, struct FBlueprintUnlocksEnum B); // Function Icarus.BlueprintUnlocksLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150dc10
	struct FBlueprintUnlocksEnum NameToStruct(struct FName NameValue); // Function Icarus.BlueprintUnlocksLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150da60
	int32_t NameToInt(struct FName NameValue); // Function Icarus.BlueprintUnlocksLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x150d8b0
	struct FBlueprintUnlocksRowHandle MakeLiteralBlueprintUnlocks(struct FBlueprintUnlocksRowHandle RowHandle); // Function Icarus.BlueprintUnlocksLibrary.MakeLiteralBlueprintUnlocks // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150d640
	struct FBlueprintUnlocksRowHandle MakeBlueprintUnlocksFromIndex(int32_t Index); // Function Icarus.BlueprintUnlocksLibrary.MakeBlueprintUnlocksFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150d250
	struct FBlueprintUnlocksEnum MakeBlueprintUnlocksEnum(struct FBlueprintUnlocksEnum Enum); // Function Icarus.BlueprintUnlocksLibrary.MakeBlueprintUnlocksEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150d1d0
	struct FBlueprintUnlocksRowHandle MakeBlueprintUnlocks(struct FName RowName); // Function Icarus.BlueprintUnlocksLibrary.MakeBlueprintUnlocks // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150d130
	bool IsValidName(struct FName NameValue); // Function Icarus.BlueprintUnlocksLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x150cf80
	struct FBlueprintUnlocksEnum IntToStruct(int32_t IntValue); // Function Icarus.BlueprintUnlocksLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150cdd0
	struct FName IntToName(int32_t IntValue); // Function Icarus.BlueprintUnlocksLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x150cc20
	void GetBlueprintUnlocksStruct(struct FBlueprintUnlocksRowHandle RowHandle, struct FBlueprintUnlock BlueprintUnlocks, enum class EValid Paths); // Function Icarus.BlueprintUnlocksLibrary.GetBlueprintUnlocksStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x150c3d0
	bool EqualEqual_FBlueprintUnlocksRowHandleFBlueprintUnlocksRowHandle(struct FBlueprintUnlocksRowHandle RowHandleA, struct FBlueprintUnlocksRowHandle RowHandleB); // Function Icarus.BlueprintUnlocksLibrary.EqualEqual_FBlueprintUnlocksRowHandleFBlueprintUnlocksRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150c010
	bool EqualEqual_EnumEnum(struct FBlueprintUnlocksEnum A, struct FBlueprintUnlocksEnum B); // Function Icarus.BlueprintUnlocksLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150bd40
	struct FBlueprintUnlocksRowHandle CastToBlueprintUnlocksRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.BlueprintUnlocksLibrary.CastToBlueprintUnlocksRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x150b9e0
	void BreakBlueprintUnlocksEnum(struct FBlueprintUnlocksEnum Enum, struct FName Name, int32_t Index); // Function Icarus.BlueprintUnlocksLibrary.BreakBlueprintUnlocksEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x150b5c0
	void AddRowToBlueprintUnlocksTable(struct FName Name, struct FBlueprintUnlock Data, struct FBlueprintUnlocksRowHandle NewRow); // Function Icarus.BlueprintUnlocksLibrary.AddRowToBlueprintUnlocksTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x150ad20
};

// Class Icarus.BlueprintUnlocksTable
// Size: 0xb8 (Inherited: 0xb8)
struct UBlueprintUnlocksTable : UIcarusDataTable {
};

// Class Icarus.BTTask_IcarusMoveTo
// Size: 0xe0 (Inherited: 0xb0)
struct UBTTask_IcarusMoveTo : UBTTask_MoveTo {
	bool bUseBlackboardDefinedAcceptanceRadius; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct FBlackboardKeySelector AcceptableRadiusKey; // 0xb8(0x28)
};

// Class Icarus.BuildableAudioDataLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBuildableAudioDataLibrary : URowLibrary {

	struct FBuildableAudioDataRowHandle StructToRowHandle(struct FBuildableAudioDataEnum EnumValue); // Function Icarus.BuildableAudioDataLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150eb60
	struct FName StructToName(struct FBuildableAudioDataEnum EnumValue); // Function Icarus.BuildableAudioDataLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150e970
	int32_t StructToInt(struct FBuildableAudioDataEnum EnumValue); // Function Icarus.BuildableAudioDataLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150e790
	struct FBuildableAudioDataEnum RowHandleToStruct(struct FBuildableAudioDataRowHandle RowHandle); // Function Icarus.BuildableAudioDataLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150e4e0
	void RemoveRowFromBuildableAudioDataTable(struct FName Name); // Function Icarus.BuildableAudioDataLibrary.RemoveRowFromBuildableAudioDataTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x150e320
	void RefreshConstants(); // Function Icarus.BuildableAudioDataLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x150e260
	int32_t NumRows(); // Function Icarus.BuildableAudioDataLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150e1e0
	bool NotEqual_EnumName(struct FBuildableAudioDataEnum A, struct FName B); // Function Icarus.BuildableAudioDataLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150dfd0
	bool NotEqual_EnumEnum(struct FBuildableAudioDataEnum A, struct FBuildableAudioDataEnum B); // Function Icarus.BuildableAudioDataLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150dd00
	struct FBuildableAudioDataEnum NameToStruct(struct FName NameValue); // Function Icarus.BuildableAudioDataLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150daf0
	int32_t NameToInt(struct FName NameValue); // Function Icarus.BuildableAudioDataLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x150d940
	struct FBuildableAudioDataRowHandle MakeLiteralBuildableAudioData(struct FBuildableAudioDataRowHandle RowHandle); // Function Icarus.BuildableAudioDataLibrary.MakeLiteralBuildableAudioData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150d7e0
	struct FBuildableAudioDataRowHandle MakeBuildableAudioDataFromIndex(int32_t Index); // Function Icarus.BuildableAudioDataLibrary.MakeBuildableAudioDataFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150d4a0
	struct FBuildableAudioDataEnum MakeBuildableAudioDataEnum(struct FBuildableAudioDataEnum Enum); // Function Icarus.BuildableAudioDataLibrary.MakeBuildableAudioDataEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150d420
	struct FBuildableAudioDataRowHandle MakeBuildableAudioData(struct FName RowName); // Function Icarus.BuildableAudioDataLibrary.MakeBuildableAudioData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150d380
	bool IsValidName(struct FName NameValue); // Function Icarus.BuildableAudioDataLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x150d010
	struct FBuildableAudioDataEnum IntToStruct(int32_t IntValue); // Function Icarus.BuildableAudioDataLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150ce60
	struct FName IntToName(int32_t IntValue); // Function Icarus.BuildableAudioDataLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x150ccb0
	void GetBuildableAudioDataStruct(struct FBuildableAudioDataRowHandle RowHandle, struct FBuildableAudioData BuildableAudioData, enum class EValid Paths); // Function Icarus.BuildableAudioDataLibrary.GetBuildableAudioDataStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x150c5a0
	bool EqualEqual_FBuildableAudioDataRowHandleFBuildableAudioDataRowHandle(struct FBuildableAudioDataRowHandle RowHandleA, struct FBuildableAudioDataRowHandle RowHandleB); // Function Icarus.BuildableAudioDataLibrary.EqualEqual_FBuildableAudioDataRowHandleFBuildableAudioDataRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150c150
	bool EqualEqual_EnumEnum(struct FBuildableAudioDataEnum A, struct FBuildableAudioDataEnum B); // Function Icarus.BuildableAudioDataLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150be30
	struct FBuildableAudioDataRowHandle CastToBuildableAudioDataRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.BuildableAudioDataLibrary.CastToBuildableAudioDataRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x150bb00
	void BreakBuildableAudioDataEnum(struct FBuildableAudioDataEnum Enum, struct FName Name, int32_t Index); // Function Icarus.BuildableAudioDataLibrary.BreakBuildableAudioDataEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x150b720
	void AddRowToBuildableAudioDataTable(struct FName Name, struct FBuildableAudioData Data, struct FBuildableAudioDataRowHandle NewRow); // Function Icarus.BuildableAudioDataLibrary.AddRowToBuildableAudioDataTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x150aff0
};

// Class Icarus.BuildableAudioDataTable
// Size: 0xb8 (Inherited: 0xb8)
struct UBuildableAudioDataTable : UIcarusDataTable {
};

// Class Icarus.BuildableComponent
// Size: 0xe0 (Inherited: 0xd0)
struct UBuildableComponent : UTraitComponent {
	struct AIcarusActor* ClassToBuild; // 0xd0(0x08)
	int32_t Variation; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)

	void SetVariation(int32_t NewVariation); // Function Icarus.BuildableComponent.SetVariation // (Final|Native|Public|BlueprintCallable) // @ game+0x150e660
	bool GetBuildableData(struct FBuildableData OutData); // Function Icarus.BuildableComponent.GetBuildableData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x150c720
};

// Class Icarus.BuildableLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBuildableLibrary : URowLibrary {

	struct FBuildableRowHandle StructToRowHandle(struct FBuildableEnum EnumValue); // Function Icarus.BuildableLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150ec10
	struct FName StructToName(struct FBuildableEnum EnumValue); // Function Icarus.BuildableLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150ea10
	int32_t StructToInt(struct FBuildableEnum EnumValue); // Function Icarus.BuildableLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150e830
	struct FBuildableEnum RowHandleToStruct(struct FBuildableRowHandle RowHandle); // Function Icarus.BuildableLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150e5a0
	void RemoveRowFromBuildableTable(struct FName Name); // Function Icarus.BuildableLibrary.RemoveRowFromBuildableTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x150e3a0
	void RefreshConstants(); // Function Icarus.BuildableLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x150e280
	int32_t NumRows(); // Function Icarus.BuildableLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150e210
	bool NotEqual_EnumName(struct FBuildableEnum A, struct FName B); // Function Icarus.BuildableLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150e0c0
	bool NotEqual_EnumEnum(struct FBuildableEnum A, struct FBuildableEnum B); // Function Icarus.BuildableLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150ddf0
	struct FBuildableEnum NameToStruct(struct FName NameValue); // Function Icarus.BuildableLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150db80
	int32_t NameToInt(struct FName NameValue); // Function Icarus.BuildableLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x150d9d0
	struct FBuildableRowHandle MakeLiteralBuildable(struct FBuildableRowHandle RowHandle); // Function Icarus.BuildableLibrary.MakeLiteralBuildable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150d710
	struct FBuildableRowHandle MakeBuildableFromIndex(int32_t Index); // Function Icarus.BuildableLibrary.MakeBuildableFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150d5b0
	struct FBuildableEnum MakeBuildableEnum(struct FBuildableEnum Enum); // Function Icarus.BuildableLibrary.MakeBuildableEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150d530
	struct FBuildableRowHandle MakeBuildable(struct FName RowName); // Function Icarus.BuildableLibrary.MakeBuildable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150d2e0
	bool IsValidName(struct FName NameValue); // Function Icarus.BuildableLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x150d0a0
	struct FBuildableEnum IntToStruct(int32_t IntValue); // Function Icarus.BuildableLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150cef0
	struct FName IntToName(int32_t IntValue); // Function Icarus.BuildableLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x150cd40
	void GetBuildableStruct(struct FBuildableRowHandle RowHandle, struct FBuildableData Buildable, enum class EValid Paths); // Function Icarus.BuildableLibrary.GetBuildableStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x150c990
	bool EqualEqual_FBuildableRowHandleFBuildableRowHandle(struct FBuildableRowHandle RowHandleA, struct FBuildableRowHandle RowHandleB); // Function Icarus.BuildableLibrary.EqualEqual_FBuildableRowHandleFBuildableRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150c290
	bool EqualEqual_EnumEnum(struct FBuildableEnum A, struct FBuildableEnum B); // Function Icarus.BuildableLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150bf20
	struct FBuildableRowHandle CastToBuildableRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.BuildableLibrary.CastToBuildableRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x150bc20
	void BreakBuildableEnum(struct FBuildableEnum Enum, struct FName Name, int32_t Index); // Function Icarus.BuildableLibrary.BreakBuildableEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x150b880
	void AddRowToBuildableTable(struct FName Name, struct FBuildableData Data, struct FBuildableRowHandle NewRow); // Function Icarus.BuildableLibrary.AddRowToBuildableTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x150b270
};

// Class Icarus.BuildableTable
// Size: 0xb8 (Inherited: 0xb8)
struct UBuildableTable : UIcarusDataTable {
};

// Class Icarus.IcarusActor
// Size: 0x2a0 (Inherited: 0x220)
struct AIcarusActor : AActor {
	char pad_220[0x18]; // 0x220(0x18)
	struct UIcarusStatContainer* StatContainer; // 0x238(0x08)
	struct UActorState* ActorState; // 0x240(0x08)
	enum class EProgressState ProgressState; // 0x248(0x01)
	struct FMulticastSparseDelegate OnActorPreDestroy; // 0x249(0x01)
	char pad_24A[0x6]; // 0x24a(0x06)
	struct UTerrainAnchorComponent* TerrainAnchor; // 0x250(0x08)
	struct UTerrainAnchorComponent* TerrainAnchorClass; // 0x258(0x08)
	char pad_260[0x8]; // 0x260(0x08)
	struct FGameplayTagContainer GameplayTags; // 0x268(0x20)
	char pad_288[0x8]; // 0x288(0x08)
	struct UIcarusStateRecorderComponent* RecorderClass; // 0x290(0x08)
	struct UIcarusStateRecorderComponent* Recorder; // 0x298(0x08)

	void SetRecorderShouldRetainOnDestroy(bool bShouldRetain); // Function Icarus.IcarusActor.SetRecorderShouldRetainOnDestroy // (Final|Native|Public|BlueprintCallable) // @ game+0x15bfe40
	void SetIcarusUID(int32_t ForcedUID); // Function Icarus.IcarusActor.SetIcarusUID // (Native|Public|BlueprintCallable) // @ game+0x15bfd20
	void RepairObject(); // Function Icarus.IcarusActor.RepairObject // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x846c20
	void RecorderEndRecording(); // Function Icarus.IcarusActor.RecorderEndRecording // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x15bf7f0
	void RecorderBeginRecording(); // Function Icarus.IcarusActor.RecorderBeginRecording // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x15bf7d0
	void RaiseTheCurtain(); // Function Icarus.IcarusActor.RaiseTheCurtain // (Native|Event|Public|BlueprintEvent) // @ game+0x8e94d0
	void OnTerrainAnchorStateChanged(); // Function Icarus.IcarusActor.OnTerrainAnchorStateChanged // (Native|Event|Public|BlueprintEvent) // @ game+0x15bf7b0
	void OnDatabaseLoadComplete(); // Function Icarus.IcarusActor.OnDatabaseLoadComplete // (Native|Event|Public|BlueprintEvent) // @ game+0x15bf790
	void IcarusBeginPlay(); // Function Icarus.IcarusActor.IcarusBeginPlay // (Native|Event|Public|BlueprintEvent) // @ game+0x15becf0
	bool HasRecorder(); // Function Icarus.IcarusActor.HasRecorder // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x15becc0
	int32_t GetIcarusUID(); // Function Icarus.IcarusActor.GetIcarusUID // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x15be4d0
	void ClaimUniqueIcarusUIDFromLibrary(int32_t SuggestedUID); // Function Icarus.IcarusActor.ClaimUniqueIcarusUIDFromLibrary // (Final|Native|Public|BlueprintCallable) // @ game+0x15bdc80
};

// Class Icarus.IcarusItem
// Size: 0x3c0 (Inherited: 0x2a0)
struct AIcarusItem : AIcarusActor {
	struct UInventory* ItemInventory; // 0x2a0(0x08)
	int32_t ItemInventoryLocation; // 0x2a8(0x04)
	bool HasLink; // 0x2ac(0x01)
	struct FMulticastSparseDelegate PickedUp; // 0x2ad(0x01)
	char pad_2AE[0x2]; // 0x2ae(0x02)
	struct TArray<struct UTraitComponent*> TraitComponents; // 0x2b0(0x10)
	struct FItemData ItemData; // 0x2c0(0x80)
	struct FIcarusItemConstructionParameters ConstructionParameters; // 0x340(0x28)
	enum class EIcarusItemContext SpawnedContext; // 0x368(0x01)
	char pad_369[0x3]; // 0x369(0x03)
	struct FItemTemplateRowHandle OverrideInstanceItemTemplate; // 0x36c(0x18)
	char pad_384[0x4]; // 0x384(0x04)
	struct USmoothSync* SmoothSyncComponent; // 0x388(0x08)
	struct FTransform ConstructionTransfrom; // 0x390(0x30)

	bool WorldPickup(struct UItemableComponent* ItemIn, struct AActor* Interactor, struct FHitResult HitResult); // Function Icarus.IcarusItem.WorldPickup // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x15dfea0
	void StackUpdated(); // Function Icarus.IcarusItem.StackUpdated // (Final|Native|Private) // @ game+0x15dfad0
	void SetItemVisible(bool bVisible); // Function Icarus.IcarusItem.SetItemVisible // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xe36140
	bool ServerSetupTraitComponents(); // Function Icarus.IcarusItem.ServerSetupTraitComponents // (Final|Native|Public|BlueprintCallable) // @ game+0x15df960
	void ServerSetItemData(struct FItemData InItemData); // Function Icarus.IcarusItem.ServerSetItemData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x15df7e0
	bool ServerLoadItemData(struct FItemTemplateRowHandle ItemTemplate); // Function Icarus.IcarusItem.ServerLoadItemData // (Final|Native|Public|BlueprintCallable) // @ game+0x15df720
	void SerializeItemData(struct FItemData OutItemData); // Function Icarus.IcarusItem.SerializeItemData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x15df5a0
	void ReconstructItem(struct FIcarusItemConstructionParameters NewConstructionParameters); // Function Icarus.IcarusItem.ReconstructItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x15df4b0
	void OnWorldPickup(struct UItemableComponent* ItemIn, struct AActor* Interactor, struct FHitResult HitResult); // Function Icarus.IcarusItem.OnWorldPickup // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x15df1d0
	void OnRep_ItemData(); // Function Icarus.IcarusItem.OnRep_ItemData // (Final|Native|Protected) // @ game+0x15df1b0
	void OnRep_ConstructionParameters(); // Function Icarus.IcarusItem.OnRep_ConstructionParameters // (Native|Protected) // @ game+0x846e80
	bool OnPickedUp(); // Function Icarus.IcarusItem.OnPickedUp // (Final|Native|Public|BlueprintCallable) // @ game+0x15df180
	void OnItemDataChanged(); // Function Icarus.IcarusItem.OnItemDataChanged // (Native|Event|Protected|BlueprintEvent) // @ game+0x846ea0
	void OnDynamicDataUpdated(); // Function Icarus.IcarusItem.OnDynamicDataUpdated // (Final|Native|Private) // @ game+0x15defa0
	bool OnDropped(); // Function Icarus.IcarusItem.OnDropped // (Final|Native|Public|BlueprintCallable) // @ game+0x15def80
	bool HasInventoryItemLink(); // Function Icarus.IcarusItem.HasInventoryItemLink // (Final|Native|Public|BlueprintCallable) // @ game+0x15de9e0
	struct FItemData GetSerialisedItemData(); // Function Icarus.IcarusItem.GetSerialisedItemData // (Final|Native|Public|BlueprintCallable) // @ game+0x15de930
	struct UMeshComponent* GetRootMeshComponent(); // Function Icarus.IcarusItem.GetRootMeshComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x15de900
	struct AIcarusPlayerCharacter* GetOwningIcarusPlayerCharacter(); // Function Icarus.IcarusItem.GetOwningIcarusPlayerCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x15de8d0
	struct TArray<struct FItemDynamicData> GetMutableItemDynamicData(); // Function Icarus.IcarusItem.GetMutableItemDynamicData // (Final|Native|Public) // @ game+0x15de890
	struct FItemData GetItemData(); // Function Icarus.IcarusItem.GetItemData // (Final|Native|Public|Const) // @ game+0x15de780
	void FillableUpdated(); // Function Icarus.IcarusItem.FillableUpdated // (Final|Native|Private) // @ game+0x15de170
	void EstablishLink(struct UInventory* Inventory, int32_t Location); // Function Icarus.IcarusItem.EstablishLink // (Final|Native|Public|BlueprintCallable) // @ game+0x15ddf20
	void DurabilityUpdated(); // Function Icarus.IcarusItem.DurabilityUpdated // (Final|Native|Private) // @ game+0x15ddf00
	void DestroyLinkedInventoryItem(); // Function Icarus.IcarusItem.DestroyLinkedInventoryItem // (Final|Native|Public|BlueprintCallable) // @ game+0x15ddee0
	void DestroyLink(); // Function Icarus.IcarusItem.DestroyLink // (Final|Native|Public|BlueprintCallable) // @ game+0x15ddec0
	void DeserializeItemData(struct FItemData InItemData); // Function Icarus.IcarusItem.DeserializeItemData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x15ddd40
	void DecayableDataUpdated(); // Function Icarus.IcarusItem.DecayableDataUpdated // (Final|Native|Private) // @ game+0x15ddd20
	void ActionableUpdated(); // Function Icarus.IcarusItem.ActionableUpdated // (Final|Native|Private) // @ game+0x15ddac0
};

// Class Icarus.BuildingBase
// Size: 0x3c0 (Inherited: 0x3c0)
struct ABuildingBase : AIcarusItem {
};

// Class Icarus.BuildingGridBase
// Size: 0x2a0 (Inherited: 0x2a0)
struct ABuildingGridBase : AIcarusActor {

	void LoadGridAndBuildingsFromRecord(struct UBuildingGridRecorderComponent* RecorderComponent); // Function Icarus.BuildingGridBase.LoadGridAndBuildingsFromRecord // (Event|Public|BlueprintEvent) // @ game+0x1a38c80
	void GetGridBuildingDataForRecord(struct UBuildingGridRecorderComponent* RecorderComponent); // Function Icarus.BuildingGridBase.GetGridBuildingDataForRecord // (Event|Public|BlueprintEvent) // @ game+0x1a38c80
};

// Class Icarus.BuildingGridRecorderComponent
// Size: 0x1a0 (Inherited: 0x150)
struct UBuildingGridRecorderComponent : UActorStateRecorderComponent {
	struct FBuildingGridSaveData BuildingGridRecord; // 0x150(0x50)

	void AddBuildingToGrid(int32_t IcarusUID, struct FTransform GridTransform, struct FTransform BuildingTransform, struct FName BuildableRowName, int32_t BuildableVariation, struct FName BuildingItemName, float BurnTimeRemaining); // Function Icarus.BuildingGridRecorderComponent.AddBuildingToGrid // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x15124f0
};

// Class Icarus.BuildingSubsystem
// Size: 0x50 (Inherited: 0x30)
struct UBuildingSubsystem : UWorldSubsystem {
	struct FMulticastInlineDelegate OnBuildingPiecePlacedNotify; // 0x30(0x10)
	struct FMulticastInlineDelegate OnBuildingPieceRemovedNotify; // 0x40(0x10)

	void BroadcastBuildingPieceRemovedDelegate(struct AIcarusPlayerCharacter* Player, struct ABuildingBase* Building); // Function Icarus.BuildingSubsystem.BroadcastBuildingPieceRemovedDelegate // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1512f30
	void BroadcastBuildingPiecePlacedDelegate(struct AIcarusPlayerCharacter* Player, struct ABuildingBase* Building); // Function Icarus.BuildingSubsystem.BroadcastBuildingPiecePlacedDelegate // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1512e50
};

// Class Icarus.FloatableComponent
// Size: 0xe8 (Inherited: 0xd0)
struct UFloatableComponent : UTraitComponent {
	struct TArray<struct UPrimitiveComponent*> OverlappedComponents; // 0xd0(0x10)
	struct FMulticastSparseDelegate OnFloatableUpdated; // 0xe0(0x01)
	char pad_E1[0x7]; // 0xe1(0x07)

	void UpdateOverlappedState(); // Function Icarus.FloatableComponent.UpdateOverlappedState // (Native|Event|Public|BlueprintEvent) // @ game+0x1584f60
	void RemoveOverlap(struct UPrimitiveComponent* Component); // Function Icarus.FloatableComponent.RemoveOverlap // (Final|Native|Public|BlueprintCallable) // @ game+0x15845c0
	bool GetFloatableData(struct FFloatableData OutData); // Function Icarus.FloatableComponent.GetFloatableData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1582710
	void FloatableUpdated(bool bNewFloating); // Function Icarus.FloatableComponent.FloatableUpdated // (Native|Public|BlueprintCallable) // @ game+0x1500bb0
	void CheckOverlapArray(); // Function Icarus.FloatableComponent.CheckOverlapArray // (Final|Native|Public|BlueprintCallable) // @ game+0x1581c20
	void AddOverlap(struct UPrimitiveComponent* Component); // Function Icarus.FloatableComponent.AddOverlap // (Final|Native|Public|BlueprintCallable) // @ game+0x15810e0
};

// Class Icarus.BuoyancyBehaviour
// Size: 0x118 (Inherited: 0xe8)
struct UBuoyancyBehaviour : UFloatableComponent {
	struct FVector VelocityDamper; // 0xe8(0x0c)
	bool bBuoyancyEnabled; // 0xf4(0x01)
	bool bAutoGenerateFloatingPoints; // 0xf5(0x01)
	char pad_F6[0x2]; // 0xf6(0x02)
	float FloatingPointRadius; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct TArray<struct FVector> FloatingPoints; // 0x100(0x10)
	char pad_110[0x8]; // 0x110(0x08)

	void GenerateFloatingPoints(); // Function Icarus.BuoyancyBehaviour.GenerateFloatingPoints // (Native|Event|Public|BlueprintEvent) // @ game+0x14d6e50
	float FindWaterHeight(); // Function Icarus.BuoyancyBehaviour.FindWaterHeight // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x15136b0
};

// Class Icarus.Cave
// Size: 0x220 (Inherited: 0x220)
struct ACave : AActor {

	float GetSpelunkingDepth(struct FVector Location); // Function Icarus.Cave.GetSpelunkingDepth // (Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1513a00
};

// Class Icarus.CaveEntranceRecorderInterface
// Size: 0x28 (Inherited: 0x28)
struct UCaveEntranceRecorderInterface : UInterface {

	void SetVoxelBlockerSaveData(struct TArray<struct FVoxelMinedSphere> VoxelBlockerSaveData); // Function Icarus.CaveEntranceRecorderInterface.SetVoxelBlockerSaveData // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1514c50
	struct AVoxelResource* GetVoxelActor(); // Function Icarus.CaveEntranceRecorderInterface.GetVoxelActor // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1513aa0
};

// Class Icarus.CaveEntranceRecorderComponent
// Size: 0x170 (Inherited: 0x150)
struct UCaveEntranceRecorderComponent : UActorStateRecorderComponent {
	struct FVoxelSaveData VoxelBlockerSaveData; // 0x148(0x20)
};

// Class Icarus.ChallengesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UChallengesLibrary : URowLibrary {

	struct FChallengesRowHandle StructToRowHandle(struct FChallengesEnum EnumValue); // Function Icarus.ChallengesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514f80
	struct FName StructToName(struct FChallengesEnum EnumValue); // Function Icarus.ChallengesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514e40
	int32_t StructToInt(struct FChallengesEnum EnumValue); // Function Icarus.ChallengesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514d00
	struct FChallengesEnum RowHandleToStruct(struct FChallengesRowHandle RowHandle); // Function Icarus.ChallengesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514ad0
	void RemoveRowFromChallengesTable(struct FName Name); // Function Icarus.ChallengesLibrary.RemoveRowFromChallengesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x15149d0
	void RefreshConstants(); // Function Icarus.ChallengesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1514990
	int32_t NumRows(); // Function Icarus.ChallengesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514930
	bool NotEqual_EnumName(struct FChallengesEnum A, struct FName B); // Function Icarus.ChallengesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514750
	bool NotEqual_EnumEnum(struct FChallengesEnum A, struct FChallengesEnum B); // Function Icarus.ChallengesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514570
	struct FChallengesEnum NameToStruct(struct FName NameValue); // Function Icarus.ChallengesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514450
	int32_t NameToInt(struct FName NameValue); // Function Icarus.ChallengesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1514330
	struct FChallengesRowHandle MakeLiteralChallenges(struct FChallengesRowHandle RowHandle); // Function Icarus.ChallengesLibrary.MakeLiteralChallenges // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514190
	struct FChallengesRowHandle MakeChallengesFromIndex(int32_t Index); // Function Icarus.ChallengesLibrary.MakeChallengesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1513f50
	struct FChallengesEnum MakeChallengesEnum(struct FChallengesEnum Enum); // Function Icarus.ChallengesLibrary.MakeChallengesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1513ed0
	struct FChallengesRowHandle MakeChallenges(struct FName RowName); // Function Icarus.ChallengesLibrary.MakeChallenges // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1513e30
	bool IsValidName(struct FName NameValue); // Function Icarus.ChallengesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1513d10
	struct FChallengesEnum IntToStruct(int32_t IntValue); // Function Icarus.ChallengesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1513bf0
	struct FName IntToName(int32_t IntValue); // Function Icarus.ChallengesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1513ad0
	void GetChallengesStruct(struct FChallengesRowHandle RowHandle, struct FChallenge Challenges, enum class EValid Paths); // Function Icarus.ChallengesLibrary.GetChallengesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x15136e0
	bool EqualEqual_FChallengesRowHandleFChallengesRowHandle(struct FChallengesRowHandle RowHandleA, struct FChallengesRowHandle RowHandleB); // Function Icarus.ChallengesLibrary.EqualEqual_FChallengesRowHandleFChallengesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1513430
	bool EqualEqual_EnumEnum(struct FChallengesEnum A, struct FChallengesEnum B); // Function Icarus.ChallengesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1513250
	struct FChallengesRowHandle CastToChallengesRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.ChallengesLibrary.CastToChallengesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1513010
	void BreakChallengesEnum(struct FChallengesEnum Enum, struct FName Name, int32_t Index); // Function Icarus.ChallengesLibrary.BreakChallengesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1512b90
	void AddRowToChallengesTable(struct FName Name, struct FChallenge Data, struct FChallengesRowHandle NewRow); // Function Icarus.ChallengesLibrary.AddRowToChallengesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x15127c0
};

// Class Icarus.ChallengesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UChallengesTable : UIcarusDataTable {
};

// Class Icarus.CharacterCreationDataLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCharacterCreationDataLibrary : URowLibrary {

	struct FCharacterCreationDataRowHandle StructToRowHandle(struct FCharacterCreationDataEnum EnumValue); // Function Icarus.CharacterCreationDataLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1515030
	struct FName StructToName(struct FCharacterCreationDataEnum EnumValue); // Function Icarus.CharacterCreationDataLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514ee0
	int32_t StructToInt(struct FCharacterCreationDataEnum EnumValue); // Function Icarus.CharacterCreationDataLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514da0
	struct FCharacterCreationDataEnum RowHandleToStruct(struct FCharacterCreationDataRowHandle RowHandle); // Function Icarus.CharacterCreationDataLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514b90
	void RemoveRowFromCharacterCreationDataTable(struct FName Name); // Function Icarus.CharacterCreationDataLibrary.RemoveRowFromCharacterCreationDataTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1514a50
	void RefreshConstants(); // Function Icarus.CharacterCreationDataLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x15149b0
	int32_t NumRows(); // Function Icarus.CharacterCreationDataLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514960
	bool NotEqual_EnumName(struct FCharacterCreationDataEnum A, struct FName B); // Function Icarus.CharacterCreationDataLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514840
	bool NotEqual_EnumEnum(struct FCharacterCreationDataEnum A, struct FCharacterCreationDataEnum B); // Function Icarus.CharacterCreationDataLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514660
	struct FCharacterCreationDataEnum NameToStruct(struct FName NameValue); // Function Icarus.CharacterCreationDataLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15144e0
	int32_t NameToInt(struct FName NameValue); // Function Icarus.CharacterCreationDataLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x15143c0
	struct FCharacterCreationDataRowHandle MakeLiteralCharacterCreationData(struct FCharacterCreationDataRowHandle RowHandle); // Function Icarus.CharacterCreationDataLibrary.MakeLiteralCharacterCreationData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514260
	struct FCharacterCreationDataRowHandle MakeCharacterCreationDataFromIndex(int32_t Index); // Function Icarus.CharacterCreationDataLibrary.MakeCharacterCreationDataFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514100
	struct FCharacterCreationDataEnum MakeCharacterCreationDataEnum(struct FCharacterCreationDataEnum Enum); // Function Icarus.CharacterCreationDataLibrary.MakeCharacterCreationDataEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514080
	struct FCharacterCreationDataRowHandle MakeCharacterCreationData(struct FName RowName); // Function Icarus.CharacterCreationDataLibrary.MakeCharacterCreationData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1513fe0
	bool IsValidName(struct FName NameValue); // Function Icarus.CharacterCreationDataLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1513da0
	struct FCharacterCreationDataEnum IntToStruct(int32_t IntValue); // Function Icarus.CharacterCreationDataLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1513c80
	struct FName IntToName(int32_t IntValue); // Function Icarus.CharacterCreationDataLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1513b60
	void GetCharacterCreationDataStruct(struct FCharacterCreationDataRowHandle RowHandle, struct FCharacterCreationData CharacterCreationData, enum class EValid Paths); // Function Icarus.CharacterCreationDataLibrary.GetCharacterCreationDataStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1513860
	bool EqualEqual_FCharacterCreationDataRowHandleFCharacterCreationDataRowHandle(struct FCharacterCreationDataRowHandle RowHandleA, struct FCharacterCreationDataRowHandle RowHandleB); // Function Icarus.CharacterCreationDataLibrary.EqualEqual_FCharacterCreationDataRowHandleFCharacterCreationDataRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1513570
	bool EqualEqual_EnumEnum(struct FCharacterCreationDataEnum A, struct FCharacterCreationDataEnum B); // Function Icarus.CharacterCreationDataLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1513340
	struct FCharacterCreationDataRowHandle CastToCharacterCreationDataRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.CharacterCreationDataLibrary.CastToCharacterCreationDataRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1513130
	void BreakCharacterCreationDataEnum(struct FCharacterCreationDataEnum Enum, struct FName Name, int32_t Index); // Function Icarus.CharacterCreationDataLibrary.BreakCharacterCreationDataEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1512cf0
	void AddRowToCharacterCreationDataTable(struct FName Name, struct FCharacterCreationData Data, struct FCharacterCreationDataRowHandle NewRow); // Function Icarus.CharacterCreationDataLibrary.AddRowToCharacterCreationDataTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1512a00
};

// Class Icarus.CharacterCreationDataTable
// Size: 0xb8 (Inherited: 0xb8)
struct UCharacterCreationDataTable : UIcarusDataTable {
};

// Class Icarus.CharacterFlagsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCharacterFlagsLibrary : URowLibrary {

	struct FCharacterFlagsRowHandle StructToRowHandle(struct FCharacterFlagsEnum EnumValue); // Function Icarus.CharacterFlagsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151a7a0
	struct FName StructToName(struct FCharacterFlagsEnum EnumValue); // Function Icarus.CharacterFlagsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151a5c0
	int32_t StructToInt(struct FCharacterFlagsEnum EnumValue); // Function Icarus.CharacterFlagsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151a3e0
	struct FCharacterFlagsEnum RowHandleToStruct(struct FCharacterFlagsRowHandle RowHandle); // Function Icarus.CharacterFlagsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151a1a0
	void RemoveRowFromCharacterFlagsTable(struct FName Name); // Function Icarus.CharacterFlagsLibrary.RemoveRowFromCharacterFlagsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x151a020
	void RefreshConstants(); // Function Icarus.CharacterFlagsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1519fc0
	int32_t NumRows(); // Function Icarus.CharacterFlagsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519f30
	bool NotEqual_EnumName(struct FCharacterFlagsEnum A, struct FName B); // Function Icarus.CharacterFlagsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519c60
	bool NotEqual_EnumEnum(struct FCharacterFlagsEnum A, struct FCharacterFlagsEnum B); // Function Icarus.CharacterFlagsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519990
	struct FCharacterFlagsEnum NameToStruct(struct FName NameValue); // Function Icarus.CharacterFlagsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15197e0
	int32_t NameToInt(struct FName NameValue); // Function Icarus.CharacterFlagsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1519630
	struct FCharacterFlagsRowHandle MakeLiteralCharacterFlags(struct FCharacterFlagsRowHandle RowHandle); // Function Icarus.CharacterFlagsLibrary.MakeLiteralCharacterFlags // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15193c0
	struct FCharacterFlagsRowHandle MakeCharacterFlagsFromIndex(int32_t Index); // Function Icarus.CharacterFlagsLibrary.MakeCharacterFlagsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1518fd0
	struct FCharacterFlagsEnum MakeCharacterFlagsEnum(struct FCharacterFlagsEnum Enum); // Function Icarus.CharacterFlagsLibrary.MakeCharacterFlagsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1518f50
	struct FCharacterFlagsRowHandle MakeCharacterFlags(struct FName RowName); // Function Icarus.CharacterFlagsLibrary.MakeCharacterFlags // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1518eb0
	bool IsValidName(struct FName NameValue); // Function Icarus.CharacterFlagsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1518d00
	struct FCharacterFlagsEnum IntToStruct(int32_t IntValue); // Function Icarus.CharacterFlagsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1518b50
	struct FName IntToName(int32_t IntValue); // Function Icarus.CharacterFlagsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x15189a0
	void GetCharacterFlagsStruct(struct FCharacterFlagsRowHandle RowHandle, struct FCharacterFlag CharacterFlags, enum class EValid Paths); // Function Icarus.CharacterFlagsLibrary.GetCharacterFlagsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x15184f0
	bool EqualEqual_FCharacterFlagsRowHandleFCharacterFlagsRowHandle(struct FCharacterFlagsRowHandle RowHandleA, struct FCharacterFlagsRowHandle RowHandleB); // Function Icarus.CharacterFlagsLibrary.EqualEqual_FCharacterFlagsRowHandleFCharacterFlagsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1518130
	bool EqualEqual_EnumEnum(struct FCharacterFlagsEnum A, struct FCharacterFlagsEnum B); // Function Icarus.CharacterFlagsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1517e60
	struct FCharacterFlagsRowHandle CastToCharacterFlagsRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.CharacterFlagsLibrary.CastToCharacterFlagsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1517b00
	void BreakCharacterFlagsEnum(struct FCharacterFlagsEnum Enum, struct FName Name, int32_t Index); // Function Icarus.CharacterFlagsLibrary.BreakCharacterFlagsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x15176e0
	void AddRowToCharacterFlagsTable(struct FName Name, struct FCharacterFlag Data, struct FCharacterFlagsRowHandle NewRow); // Function Icarus.CharacterFlagsLibrary.AddRowToCharacterFlagsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x15171b0
};

// Class Icarus.CharacterFlagsTable
// Size: 0xb8 (Inherited: 0xb8)
struct UCharacterFlagsTable : UIcarusDataTable {
};

// Class Icarus.CharacterGrowthLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCharacterGrowthLibrary : URowLibrary {

	struct FCharacterGrowthRowHandle StructToRowHandle(struct FCharacterGrowthEnum EnumValue); // Function Icarus.CharacterGrowthLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151a850
	struct FName StructToName(struct FCharacterGrowthEnum EnumValue); // Function Icarus.CharacterGrowthLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151a660
	int32_t StructToInt(struct FCharacterGrowthEnum EnumValue); // Function Icarus.CharacterGrowthLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151a480
	struct FCharacterGrowthEnum RowHandleToStruct(struct FCharacterGrowthRowHandle RowHandle); // Function Icarus.CharacterGrowthLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151a260
	void RemoveRowFromCharacterGrowthTable(struct FName Name); // Function Icarus.CharacterGrowthLibrary.RemoveRowFromCharacterGrowthTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x151a0a0
	void RefreshConstants(); // Function Icarus.CharacterGrowthLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1519fe0
	int32_t NumRows(); // Function Icarus.CharacterGrowthLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519f60
	bool NotEqual_EnumName(struct FCharacterGrowthEnum A, struct FName B); // Function Icarus.CharacterGrowthLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519d50
	bool NotEqual_EnumEnum(struct FCharacterGrowthEnum A, struct FCharacterGrowthEnum B); // Function Icarus.CharacterGrowthLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519a80
	struct FCharacterGrowthEnum NameToStruct(struct FName NameValue); // Function Icarus.CharacterGrowthLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519870
	int32_t NameToInt(struct FName NameValue); // Function Icarus.CharacterGrowthLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x15196c0
	struct FCharacterGrowthRowHandle MakeLiteralCharacterGrowth(struct FCharacterGrowthRowHandle RowHandle); // Function Icarus.CharacterGrowthLibrary.MakeLiteralCharacterGrowth // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519490
	struct FCharacterGrowthRowHandle MakeCharacterGrowthFromIndex(int32_t Index); // Function Icarus.CharacterGrowthLibrary.MakeCharacterGrowthFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519180
	struct FCharacterGrowthEnum MakeCharacterGrowthEnum(struct FCharacterGrowthEnum Enum); // Function Icarus.CharacterGrowthLibrary.MakeCharacterGrowthEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519100
	struct FCharacterGrowthRowHandle MakeCharacterGrowth(struct FName RowName); // Function Icarus.CharacterGrowthLibrary.MakeCharacterGrowth // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519060
	bool IsValidName(struct FName NameValue); // Function Icarus.CharacterGrowthLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1518d90
	struct FCharacterGrowthEnum IntToStruct(int32_t IntValue); // Function Icarus.CharacterGrowthLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1518be0
	struct FName IntToName(int32_t IntValue); // Function Icarus.CharacterGrowthLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1518a30
	void GetCharacterGrowthStruct(struct FCharacterGrowthRowHandle RowHandle, struct FCharacterGrowth CharacterGrowth, enum class EValid Paths); // Function Icarus.CharacterGrowthLibrary.GetCharacterGrowthStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1518670
	bool EqualEqual_FCharacterGrowthRowHandleFCharacterGrowthRowHandle(struct FCharacterGrowthRowHandle RowHandleA, struct FCharacterGrowthRowHandle RowHandleB); // Function Icarus.CharacterGrowthLibrary.EqualEqual_FCharacterGrowthRowHandleFCharacterGrowthRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1518270
	bool EqualEqual_EnumEnum(struct FCharacterGrowthEnum A, struct FCharacterGrowthEnum B); // Function Icarus.CharacterGrowthLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1517f50
	struct FCharacterGrowthRowHandle CastToCharacterGrowthRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.CharacterGrowthLibrary.CastToCharacterGrowthRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1517c20
	void BreakCharacterGrowthEnum(struct FCharacterGrowthEnum Enum, struct FName Name, int32_t Index); // Function Icarus.CharacterGrowthLibrary.BreakCharacterGrowthEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1517840
	void AddRowToCharacterGrowthTable(struct FName Name, struct FCharacterGrowth Data, struct FCharacterGrowthRowHandle NewRow); // Function Icarus.CharacterGrowthLibrary.AddRowToCharacterGrowthTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1517360
};

// Class Icarus.CharacterGrowthTable
// Size: 0xb8 (Inherited: 0xb8)
struct UCharacterGrowthTable : UIcarusDataTable {
};

// Class Icarus.CharacterPerksLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCharacterPerksLibrary : URowLibrary {

	struct FCharacterPerksRowHandle StructToRowHandle(struct FCharacterPerksEnum EnumValue); // Function Icarus.CharacterPerksLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151a900
	struct FName StructToName(struct FCharacterPerksEnum EnumValue); // Function Icarus.CharacterPerksLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151a700
	int32_t StructToInt(struct FCharacterPerksEnum EnumValue); // Function Icarus.CharacterPerksLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151a520
	struct FCharacterPerksEnum RowHandleToStruct(struct FCharacterPerksRowHandle RowHandle); // Function Icarus.CharacterPerksLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151a320
	void RemoveRowFromCharacterPerksTable(struct FName Name); // Function Icarus.CharacterPerksLibrary.RemoveRowFromCharacterPerksTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x151a120
	void RefreshConstants(); // Function Icarus.CharacterPerksLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x151a000
	int32_t NumRows(); // Function Icarus.CharacterPerksLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519f90
	bool NotEqual_EnumName(struct FCharacterPerksEnum A, struct FName B); // Function Icarus.CharacterPerksLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519e40
	bool NotEqual_EnumEnum(struct FCharacterPerksEnum A, struct FCharacterPerksEnum B); // Function Icarus.CharacterPerksLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519b70
	struct FCharacterPerksEnum NameToStruct(struct FName NameValue); // Function Icarus.CharacterPerksLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519900
	int32_t NameToInt(struct FName NameValue); // Function Icarus.CharacterPerksLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1519750
	struct FCharacterPerksRowHandle MakeLiteralCharacterPerks(struct FCharacterPerksRowHandle RowHandle); // Function Icarus.CharacterPerksLibrary.MakeLiteralCharacterPerks // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519560
	struct FCharacterPerksRowHandle MakeCharacterPerksFromIndex(int32_t Index); // Function Icarus.CharacterPerksLibrary.MakeCharacterPerksFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519330
	struct FCharacterPerksEnum MakeCharacterPerksEnum(struct FCharacterPerksEnum Enum); // Function Icarus.CharacterPerksLibrary.MakeCharacterPerksEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15192b0
	struct FCharacterPerksRowHandle MakeCharacterPerks(struct FName RowName); // Function Icarus.CharacterPerksLibrary.MakeCharacterPerks // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1519210
	bool IsValidName(struct FName NameValue); // Function Icarus.CharacterPerksLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1518e20
	struct FCharacterPerksEnum IntToStruct(int32_t IntValue); // Function Icarus.CharacterPerksLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1518c70
	struct FName IntToName(int32_t IntValue); // Function Icarus.CharacterPerksLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1518ac0
	void GetCharacterPerksStruct(struct FCharacterPerksRowHandle RowHandle, struct FCharacterPerk CharacterPerks, enum class EValid Paths); // Function Icarus.CharacterPerksLibrary.GetCharacterPerksStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1518800
	bool EqualEqual_FCharacterPerksRowHandleFCharacterPerksRowHandle(struct FCharacterPerksRowHandle RowHandleA, struct FCharacterPerksRowHandle RowHandleB); // Function Icarus.CharacterPerksLibrary.EqualEqual_FCharacterPerksRowHandleFCharacterPerksRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15183b0
	bool EqualEqual_EnumEnum(struct FCharacterPerksEnum A, struct FCharacterPerksEnum B); // Function Icarus.CharacterPerksLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1518040
	struct FCharacterPerksRowHandle CastToCharacterPerksRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.CharacterPerksLibrary.CastToCharacterPerksRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1517d40
	void BreakCharacterPerksEnum(struct FCharacterPerksEnum Enum, struct FName Name, int32_t Index); // Function Icarus.CharacterPerksLibrary.BreakCharacterPerksEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x15179a0
	void AddRowToCharacterPerksTable(struct FName Name, struct FCharacterPerk Data, struct FCharacterPerksRowHandle NewRow); // Function Icarus.CharacterPerksLibrary.AddRowToCharacterPerksTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1517550
};

// Class Icarus.CharacterPerksTable
// Size: 0xb8 (Inherited: 0xb8)
struct UCharacterPerksTable : UIcarusDataTable {
};

// Class Icarus.CharacterStartingStatsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCharacterStartingStatsLibrary : URowLibrary {

	struct FCharacterStartingStatsRowHandle StructToRowHandle(struct FCharacterStartingStatsEnum EnumValue); // Function Icarus.CharacterStartingStatsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151fc40
	struct FName StructToName(struct FCharacterStartingStatsEnum EnumValue); // Function Icarus.CharacterStartingStatsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151fb00
	int32_t StructToInt(struct FCharacterStartingStatsEnum EnumValue); // Function Icarus.CharacterStartingStatsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151f9c0
	struct FCharacterStartingStatsEnum RowHandleToStruct(struct FCharacterStartingStatsRowHandle RowHandle); // Function Icarus.CharacterStartingStatsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151f340
	void RemoveRowFromCharacterStartingStatsTable(struct FName Name); // Function Icarus.CharacterStartingStatsLibrary.RemoveRowFromCharacterStartingStatsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x151f240
	void RefreshConstants(); // Function Icarus.CharacterStartingStatsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x151f200
	int32_t NumRows(); // Function Icarus.CharacterStartingStatsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151f0e0
	bool NotEqual_EnumName(struct FCharacterStartingStatsEnum A, struct FName B); // Function Icarus.CharacterStartingStatsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151ef00
	bool NotEqual_EnumEnum(struct FCharacterStartingStatsEnum A, struct FCharacterStartingStatsEnum B); // Function Icarus.CharacterStartingStatsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151ed20
	struct FCharacterStartingStatsEnum NameToStruct(struct FName NameValue); // Function Icarus.CharacterStartingStatsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151ec00
	int32_t NameToInt(struct FName NameValue); // Function Icarus.CharacterStartingStatsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x151eae0
	struct FCharacterStartingStatsRowHandle MakeLiteralCharacterStartingStats(struct FCharacterStartingStatsRowHandle RowHandle); // Function Icarus.CharacterStartingStatsLibrary.MakeLiteralCharacterStartingStats // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151e940
	struct FCharacterStartingStatsRowHandle MakeCharacterStartingStatsFromIndex(int32_t Index); // Function Icarus.CharacterStartingStatsLibrary.MakeCharacterStartingStatsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151e700
	struct FCharacterStartingStatsEnum MakeCharacterStartingStatsEnum(struct FCharacterStartingStatsEnum Enum); // Function Icarus.CharacterStartingStatsLibrary.MakeCharacterStartingStatsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151e680
	struct FCharacterStartingStatsRowHandle MakeCharacterStartingStats(struct FName RowName); // Function Icarus.CharacterStartingStatsLibrary.MakeCharacterStartingStats // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151e5e0
	bool IsValidName(struct FName NameValue); // Function Icarus.CharacterStartingStatsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x151e4c0
	struct FCharacterStartingStatsEnum IntToStruct(int32_t IntValue); // Function Icarus.CharacterStartingStatsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151e3a0
	struct FName IntToName(int32_t IntValue); // Function Icarus.CharacterStartingStatsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x151e280
	void GetCharacterStartingStatsStruct(struct FCharacterStartingStatsRowHandle RowHandle, struct FPlayerStartingStats CharacterStartingStats, enum class EValid Paths); // Function Icarus.CharacterStartingStatsLibrary.GetCharacterStartingStatsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x151dd40
	bool EqualEqual_FCharacterStartingStatsRowHandleFCharacterStartingStatsRowHandle(struct FCharacterStartingStatsRowHandle RowHandleA, struct FCharacterStartingStatsRowHandle RowHandleB); // Function Icarus.CharacterStartingStatsLibrary.EqualEqual_FCharacterStartingStatsRowHandleFCharacterStartingStatsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151dac0
	bool EqualEqual_EnumEnum(struct FCharacterStartingStatsEnum A, struct FCharacterStartingStatsEnum B); // Function Icarus.CharacterStartingStatsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151d8e0
	struct FCharacterStartingStatsRowHandle CastToCharacterStartingStatsRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.CharacterStartingStatsLibrary.CastToCharacterStartingStatsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x151d5b0
	void BreakCharacterStartingStatsEnum(struct FCharacterStartingStatsEnum Enum, struct FName Name, int32_t Index); // Function Icarus.CharacterStartingStatsLibrary.BreakCharacterStartingStatsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x151d150
	void AddRowToCharacterStartingStatsTable(struct FName Name, struct FPlayerStartingStats Data, struct FCharacterStartingStatsRowHandle NewRow); // Function Icarus.CharacterStartingStatsLibrary.AddRowToCharacterStartingStatsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x151cb60
};

// Class Icarus.CharacterStartingStatsTable
// Size: 0xb8 (Inherited: 0xb8)
struct UCharacterStartingStatsTable : UIcarusDataTable {
};

// Class Icarus.CharacterState
// Size: 0x2a8 (Inherited: 0x1f8)
struct UCharacterState : UActorState {
	struct FMulticastSparseDelegate OnStaminaUpdated; // 0x1f8(0x01)
	struct FMulticastSparseDelegate OnStaminaDepleted; // 0x1f9(0x01)
	struct FMulticastSparseDelegate OnStaminaDepletedDuringAction; // 0x1fa(0x01)
	struct FMulticastSparseDelegate OnExperienceEvent; // 0x1fb(0x01)
	struct FMulticastSparseDelegate OnExperienceUpdated; // 0x1fc(0x01)
	struct FMulticastSparseDelegate OnExperienceDebtUpdated; // 0x1fd(0x01)
	struct FMulticastSparseDelegate OnLevelUpdated; // 0x1fe(0x01)
	char pad_1FF[0x1]; // 0x1ff(0x01)
	int32_t Stamina; // 0x200(0x04)
	int32_t MaxStamina; // 0x204(0x04)
	int32_t TotalExperience; // 0x208(0x04)
	int32_t TotalExperienceDebt; // 0x20c(0x04)
	struct FCharacterGrowthRowHandle GrowthRowHandle; // 0x210(0x18)
	int32_t Level; // 0x228(0x04)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct TMap<int32_t, struct FStaminaActionCostsRowHandle> StaminaTickEvents; // 0x230(0x50)
	char pad_280[0x20]; // 0x280(0x20)
	bool bHasStaminaRegen; // 0x2a0(0x01)
	char pad_2A1[0x7]; // 0x2a1(0x07)

	void TickStaminaEvents(); // Function Icarus.CharacterState.TickStaminaEvents // (Final|Native|Protected) // @ game+0x151fda0
	void StopStaminaAction(struct FStaminaActionCostsRowHandle Action, int32_t UID); // Function Icarus.CharacterState.StopStaminaAction // (Final|Native|Public|BlueprintCallable) // @ game+0x151f8c0
	int32_t StartStaminaAction(struct FStaminaActionCostsRowHandle Action, bool SkipTickCost); // Function Icarus.CharacterState.StartStaminaAction // (Final|Native|Public|BlueprintCallable) // @ game+0x151f7b0
	bool SetupAI(int32_t Level, int32_t New_Health, int32_t New_Stamina, int32_t New_Strength, int32_t New_Agility, int32_t New_Perception); // Function Icarus.CharacterState.SetupAI // (Final|Native|Public|BlueprintCallable) // @ game+0x151f5e0
	void SetStamina(int32_t Amount); // Function Icarus.CharacterState.SetStamina // (Final|Native|Public|BlueprintCallable) // @ game+0x151f550
	void SetExperienceDebt(int32_t Amount); // Function Icarus.CharacterState.SetExperienceDebt // (Native|Public|BlueprintCallable) // @ game+0x151f4c0
	void SetExperience(int32_t Amount); // Function Icarus.CharacterState.SetExperience // (Native|Public|BlueprintCallable) // @ game+0x14ffa80
	void RecalculateStaminaRegenRate(); // Function Icarus.CharacterState.RecalculateStaminaRegenRate // (Final|Native|Protected) // @ game+0x151f1e0
	void RecalculateCurrentStamina(); // Function Icarus.CharacterState.RecalculateCurrentStamina // (Final|Native|Protected) // @ game+0x151f1c0
	void OnRep_TotalExperienceDebt(); // Function Icarus.CharacterState.OnRep_TotalExperienceDebt // (Final|Native|Protected) // @ game+0x151f1a0
	void OnRep_TotalExperience(); // Function Icarus.CharacterState.OnRep_TotalExperience // (Final|Native|Protected) // @ game+0x151f180
	void OnRep_Stamina(); // Function Icarus.CharacterState.OnRep_Stamina // (Final|Native|Protected) // @ game+0x151f160
	void OnRep_Level(); // Function Icarus.CharacterState.OnRep_Level // (Final|Native|Protected) // @ game+0x151f140
	int32_t GetStamina(); // Function Icarus.CharacterState.GetStamina // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x151e250
	int32_t GetMaxStamina(); // Function Icarus.CharacterState.GetMaxStamina // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x151e220
	int32_t GetLevel(); // Function Icarus.CharacterState.GetLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x151e1f0
	int32_t GetExperienceRequired(int32_t Level); // Function Icarus.CharacterState.GetExperienceRequired // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x151e150
	int32_t GetExperienceDebt(); // Function Icarus.CharacterState.GetExperienceDebt // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x151e120
	int32_t GetExperience(); // Function Icarus.CharacterState.GetExperience // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x151e0f0
	void ClientAddedExperienceEvent(struct FExperienceEventsRowHandle ExperienceEvent, int32_t ExperienceGained); // Function Icarus.CharacterState.ClientAddedExperienceEvent // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x151d7f0
	bool CanRegenerateStamina(); // Function Icarus.CharacterState.CanRegenerateStamina // (Final|Native|Protected|Const) // @ game+0x151d4f0
	bool CanPerformStaminaAction(struct FStaminaCost ActionCost); // Function Icarus.CharacterState.CanPerformStaminaAction // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x151d410
	void CancelStaminaAction(int32_t UID); // Function Icarus.CharacterState.CancelStaminaAction // (Final|Native|Public|BlueprintCallable) // @ game+0x151d520
	void AddStamina(int32_t Amount); // Function Icarus.CharacterState.AddStamina // (Native|Public|BlueprintCallable) // @ game+0x151d0c0
	bool AddExperienceEvent(struct FExperienceEventsRowHandle ExperienceEvent, int32_t GrantedExperience); // Function Icarus.CharacterState.AddExperienceEvent // (Final|Native|Public|HasOutParms) // @ game+0x151ca60
	void AddExperienceDebt(int32_t Amount); // Function Icarus.CharacterState.AddExperienceDebt // (Final|Native|Public|BlueprintCallable) // @ game+0x151c9d0
	void AddExperience(int32_t Amount); // Function Icarus.CharacterState.AddExperience // (Final|Native|Public|BlueprintCallable) // @ game+0x151c940
};

// Class Icarus.CharacterTimelineLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCharacterTimelineLibrary : URowLibrary {

	struct FCharacterTimelineRowHandle StructToRowHandle(struct FCharacterTimelineEnum EnumValue); // Function Icarus.CharacterTimelineLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151fcf0
	struct FName StructToName(struct FCharacterTimelineEnum EnumValue); // Function Icarus.CharacterTimelineLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151fba0
	int32_t StructToInt(struct FCharacterTimelineEnum EnumValue); // Function Icarus.CharacterTimelineLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151fa60
	struct FCharacterTimelineEnum RowHandleToStruct(struct FCharacterTimelineRowHandle RowHandle); // Function Icarus.CharacterTimelineLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151f400
	void RemoveRowFromCharacterTimelineTable(struct FName Name); // Function Icarus.CharacterTimelineLibrary.RemoveRowFromCharacterTimelineTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x151f2c0
	void RefreshConstants(); // Function Icarus.CharacterTimelineLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x151f220
	int32_t NumRows(); // Function Icarus.CharacterTimelineLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151f110
	bool NotEqual_EnumName(struct FCharacterTimelineEnum A, struct FName B); // Function Icarus.CharacterTimelineLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151eff0
	bool NotEqual_EnumEnum(struct FCharacterTimelineEnum A, struct FCharacterTimelineEnum B); // Function Icarus.CharacterTimelineLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151ee10
	struct FCharacterTimelineEnum NameToStruct(struct FName NameValue); // Function Icarus.CharacterTimelineLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151ec90
	int32_t NameToInt(struct FName NameValue); // Function Icarus.CharacterTimelineLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x151eb70
	struct FCharacterTimelineRowHandle MakeLiteralCharacterTimeline(struct FCharacterTimelineRowHandle RowHandle); // Function Icarus.CharacterTimelineLibrary.MakeLiteralCharacterTimeline // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151ea10
	struct FCharacterTimelineRowHandle MakeCharacterTimelineFromIndex(int32_t Index); // Function Icarus.CharacterTimelineLibrary.MakeCharacterTimelineFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151e8b0
	struct FCharacterTimelineEnum MakeCharacterTimelineEnum(struct FCharacterTimelineEnum Enum); // Function Icarus.CharacterTimelineLibrary.MakeCharacterTimelineEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151e830
	struct FCharacterTimelineRowHandle MakeCharacterTimeline(struct FName RowName); // Function Icarus.CharacterTimelineLibrary.MakeCharacterTimeline // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151e790
	bool IsValidName(struct FName NameValue); // Function Icarus.CharacterTimelineLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x151e550
	struct FCharacterTimelineEnum IntToStruct(int32_t IntValue); // Function Icarus.CharacterTimelineLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151e430
	struct FName IntToName(int32_t IntValue); // Function Icarus.CharacterTimelineLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x151e310
	void GetCharacterTimelineStruct(struct FCharacterTimelineRowHandle RowHandle, struct FCharacterTimeline CharacterTimeline, enum class EValid Paths); // Function Icarus.CharacterTimelineLibrary.GetCharacterTimelineStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x151df30
	bool EqualEqual_FCharacterTimelineRowHandleFCharacterTimelineRowHandle(struct FCharacterTimelineRowHandle RowHandleA, struct FCharacterTimelineRowHandle RowHandleB); // Function Icarus.CharacterTimelineLibrary.EqualEqual_FCharacterTimelineRowHandleFCharacterTimelineRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151dc00
	bool EqualEqual_EnumEnum(struct FCharacterTimelineEnum A, struct FCharacterTimelineEnum B); // Function Icarus.CharacterTimelineLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x151d9d0
	struct FCharacterTimelineRowHandle CastToCharacterTimelineRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.CharacterTimelineLibrary.CastToCharacterTimelineRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x151d6d0
	void BreakCharacterTimelineEnum(struct FCharacterTimelineEnum Enum, struct FName Name, int32_t Index); // Function Icarus.CharacterTimelineLibrary.BreakCharacterTimelineEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x151d2b0
	void AddRowToCharacterTimelineTable(struct FName Name, struct FCharacterTimeline Data, struct FCharacterTimelineRowHandle NewRow); // Function Icarus.CharacterTimelineLibrary.AddRowToCharacterTimelineTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x151cdf0
};

// Class Icarus.CharacterTimelineTable
// Size: 0xb8 (Inherited: 0xb8)
struct UCharacterTimelineTable : UIcarusDataTable {
};

// Class Icarus.CharacterVoicesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCharacterVoicesLibrary : URowLibrary {

	struct FCharacterVoicesRowHandle StructToRowHandle(struct FCharacterVoicesEnum EnumValue); // Function Icarus.CharacterVoicesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1525e10
	struct FName StructToName(struct FCharacterVoicesEnum EnumValue); // Function Icarus.CharacterVoicesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1525cd0
	int32_t StructToInt(struct FCharacterVoicesEnum EnumValue); // Function Icarus.CharacterVoicesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1525b90
	struct FCharacterVoicesEnum RowHandleToStruct(struct FCharacterVoicesRowHandle RowHandle); // Function Icarus.CharacterVoicesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1525530
	void RemoveRowFromCharacterVoicesTable(struct FName Name); // Function Icarus.CharacterVoicesLibrary.RemoveRowFromCharacterVoicesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1525430
	void RefreshConstants(); // Function Icarus.CharacterVoicesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x15253f0
	int32_t NumRows(); // Function Icarus.CharacterVoicesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1525140
	bool NotEqual_EnumName(struct FCharacterVoicesEnum A, struct FName B); // Function Icarus.CharacterVoicesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524f60
	bool NotEqual_EnumEnum(struct FCharacterVoicesEnum A, struct FCharacterVoicesEnum B); // Function Icarus.CharacterVoicesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524d80
	struct FCharacterVoicesEnum NameToStruct(struct FName NameValue); // Function Icarus.CharacterVoicesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524c60
	int32_t NameToInt(struct FName NameValue); // Function Icarus.CharacterVoicesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1524b40
	struct FCharacterVoicesRowHandle MakeLiteralCharacterVoices(struct FCharacterVoicesRowHandle RowHandle); // Function Icarus.CharacterVoicesLibrary.MakeLiteralCharacterVoices // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15249a0
	struct FCharacterVoicesRowHandle MakeCharacterVoicesFromIndex(int32_t Index); // Function Icarus.CharacterVoicesLibrary.MakeCharacterVoicesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524760
	struct FCharacterVoicesEnum MakeCharacterVoicesEnum(struct FCharacterVoicesEnum Enum); // Function Icarus.CharacterVoicesLibrary.MakeCharacterVoicesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15246e0
	struct FCharacterVoicesRowHandle MakeCharacterVoices(struct FName RowName); // Function Icarus.CharacterVoicesLibrary.MakeCharacterVoices // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524640
	bool IsValidName(struct FName NameValue); // Function Icarus.CharacterVoicesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1524500
	struct FCharacterVoicesEnum IntToStruct(int32_t IntValue); // Function Icarus.CharacterVoicesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524300
	struct FName IntToName(int32_t IntValue); // Function Icarus.CharacterVoicesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x15241e0
	void GetCharacterVoicesStruct(struct FCharacterVoicesRowHandle RowHandle, struct FCharacterVoiceData CharacterVoices, enum class EValid Paths); // Function Icarus.CharacterVoicesLibrary.GetCharacterVoicesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1523bd0
	bool EqualEqual_FCharacterVoicesRowHandleFCharacterVoicesRowHandle(struct FCharacterVoicesRowHandle RowHandleA, struct FCharacterVoicesRowHandle RowHandleB); // Function Icarus.CharacterVoicesLibrary.EqualEqual_FCharacterVoicesRowHandleFCharacterVoicesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15237a0
	bool EqualEqual_EnumEnum(struct FCharacterVoicesEnum A, struct FCharacterVoicesEnum B); // Function Icarus.CharacterVoicesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15235c0
	struct FCharacterVoicesRowHandle CastToCharacterVoicesRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.CharacterVoicesLibrary.CastToCharacterVoicesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1523330
	void BreakCharacterVoicesEnum(struct FCharacterVoicesEnum Enum, struct FName Name, int32_t Index); // Function Icarus.CharacterVoicesLibrary.BreakCharacterVoicesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1523070
	void AddRowToCharacterVoicesTable(struct FName Name, struct FCharacterVoiceData Data, struct FCharacterVoicesRowHandle NewRow); // Function Icarus.CharacterVoicesLibrary.AddRowToCharacterVoicesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1522c50
};

// Class Icarus.CharacterVoicesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UCharacterVoicesTable : UIcarusDataTable {
};

// Class Icarus.CheatController
// Size: 0x228 (Inherited: 0x220)
struct ACheatController : AActor {
	struct FPerPlayerCheatData PerPlayerCheats; // 0x220(0x03)
	char pad_223[0x5]; // 0x223(0x05)

	void SetUnlockAllRecipes(bool bEnabled); // Function Icarus.CheatController.SetUnlockAllRecipes // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1525ac0
	void SetUnlimitedResourcesEnabled(bool bEnabled); // Function Icarus.CheatController.SetUnlimitedResourcesEnabled // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1525a30
	void SetShelteredRequiredDisabled(bool bDisabled); // Function Icarus.CheatController.SetShelteredRequiredDisabled // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x15256b0
	void SetGodModeEnabled(bool bEnabled); // Function Icarus.CheatController.SetGodModeEnabled // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1525910
	void SetBuildingIntegrityDisabled(bool bDisabled); // Function Icarus.CheatController.SetBuildingIntegrityDisabled // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x15256b0
	bool IsUnlockAllRecipesEnabled(struct AActor* Actor); // Function Icarus.CheatController.IsUnlockAllRecipesEnabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524420
	bool IsUnlimitedResourcesEnabled(struct AActor* Actor); // Function Icarus.CheatController.IsUnlimitedResourcesEnabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524420
	bool IsShelteredRequiredDisabled(struct UObject* WorldContextObject); // Function Icarus.CheatController.IsShelteredRequiredDisabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524420
	bool IsGodModeEnabled(struct AActor* Actor); // Function Icarus.CheatController.IsGodModeEnabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524420
	bool IsBuildingIntegrityDisabled(struct UObject* WorldContextObject); // Function Icarus.CheatController.IsBuildingIntegrityDisabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524420
};

// Class Icarus.CheatFunctionBase
// Size: 0x2a8 (Inherited: 0x260)
struct UCheatFunctionBase : UUserWidget {
	struct FString Name; // 0x260(0x10)
	struct FText Description; // 0x270(0x18)
	struct FLinearColor TitleColour; // 0x288(0x10)
	struct FLinearColor AreaColor; // 0x298(0x10)

	void UpdatePreview(struct TArray<struct FString> Args); // Function Icarus.CheatFunctionBase.UpdatePreview // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1a38c80
	struct FString GetName(); // Function Icarus.CheatFunctionBase.GetName // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1524160
	bool ForceNoBorder(); // Function Icarus.CheatFunctionBase.ForceNoBorder // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1523ba0
	void Execute(); // Function Icarus.CheatFunctionBase.Execute // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1500450
};

// Class Icarus.CheatOverlayBase
// Size: 0x340 (Inherited: 0x260)
struct UCheatOverlayBase : UUserWidget {
	char pad_260[0x10]; // 0x260(0x10)
	struct FMulticastInlineDelegate OnScriptQueueFinished; // 0x270(0x10)
	char pad_280[0x18]; // 0x280(0x18)
	struct FMulticastInlineDelegate OnCheatScriptFinished; // 0x298(0x10)
	struct TArray<struct UCheatFunctionBase*> CheatFunctionWidgets; // 0x2a8(0x10)
	char pad_2B8[0x88]; // 0x2b8(0x88)

	void StopWaiting(); // Function Icarus.CheatOverlayBase.StopWaiting // (Final|Native|Public|BlueprintCallable) // @ game+0x1525b70
	void StartWaiting(); // Function Icarus.CheatOverlayBase.StartWaiting // (Final|Native|Public|BlueprintCallable) // @ game+0x1525b50
	void SetShow(bool bInShow); // Function Icarus.CheatOverlayBase.SetShow // (Final|Native|Public|BlueprintCallable) // @ game+0x15259a0
	void SetFilteredWidgets(struct TArray<struct UCheatFunctionBase*> Widgets); // Function Icarus.CheatOverlayBase.SetFilteredWidgets // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1a38c80
	bool SetCheatVariable(struct FString Variable, struct FString Value); // Function Icarus.CheatOverlayBase.SetCheatVariable // (Final|Native|Public|BlueprintCallable) // @ game+0x15257f0
	void SetCheatFunctionList(struct TArray<struct UObject*> List); // Function Icarus.CheatOverlayBase.SetCheatFunctionList // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1525740
	void RequestReloadCheats(); // Function Icarus.CheatOverlayBase.RequestReloadCheats // (Event|Public|BlueprintEvent) // @ game+0x1a38c80
	void PreviewCommand(struct FString CommandText); // Function Icarus.CheatOverlayBase.PreviewCommand // (Final|Native|Public|BlueprintCallable) // @ game+0x1525340
	struct FString ParseCheatLineArguments(struct FString Line, struct TArray<struct FString> Args); // Function Icarus.CheatOverlayBase.ParseCheatLineArguments // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x15251c0
	void OnShowChanged(bool bNewShow); // Function Icarus.CheatOverlayBase.OnShowChanged // (Event|Public|BlueprintEvent) // @ game+0x1a38c80
	void OnBeginPlay(); // Function Icarus.CheatOverlayBase.OnBeginPlay // (Final|Native|Public|BlueprintCallable) // @ game+0x15251a0
	bool IsWaiting(); // Function Icarus.CheatOverlayBase.IsWaiting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1524620
	bool IsShowing(); // Function Icarus.CheatOverlayBase.IsShowing // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x15244e0
	bool IsCheatScriptExecuting(); // Function Icarus.CheatOverlayBase.IsCheatScriptExecuting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x15244b0
	void EvaluateLines(struct TArray<struct FString> ScriptLines); // Function Icarus.CheatOverlayBase.EvaluateLines // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1523ad0
	void Evaluate(struct FString Script); // Function Icarus.CheatOverlayBase.Evaluate // (Final|Native|Public|BlueprintCallable) // @ game+0x1523a20
	void Close(); // Function Icarus.CheatOverlayBase.Close // (Final|Native|Public|BlueprintCallable) // @ game+0x15235a0
	void ClearFilteredWidgets(); // Function Icarus.CheatOverlayBase.ClearFilteredWidgets // (Event|Public|BlueprintEvent) // @ game+0x1a38c80
	void AddCustomFunction(struct FString Name, struct TArray<struct FString> ScriptLines, struct FString Description); // Function Icarus.CheatOverlayBase.AddCustomFunction // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1a38c80
	void AddCustomAutomationFunction(struct FString Name, struct TArray<struct FString> ScriptLines, struct FString Description); // Function Icarus.CheatOverlayBase.AddCustomAutomationFunction // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1a38c80
	void AddCheat(struct UCheatFunctionBase* Widget); // Function Icarus.CheatOverlayBase.AddCheat // (Event|Public|BlueprintEvent) // @ game+0x1a38c80
};

// Class Icarus.CheatOverlayFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCheatOverlayFunctionLibrary : UBlueprintFunctionLibrary {

	struct UCheatOverlayBase* GetCheatOverlay(struct UObject* WorldContextObject); // Function Icarus.CheatOverlayFunctionLibrary.GetCheatOverlay // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1523d90
};

// Class Icarus.ClearStorageCallbackProxy
// Size: 0x68 (Inherited: 0x30)
struct UClearStorageCallbackProxy : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UClearStorageCallbackProxy* ClearStorage(); // Function Icarus.ClearStorageCallbackProxy.ClearStorage // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1523570
};

// Class Icarus.CombustibleComponent
// Size: 0xd8 (Inherited: 0xd0)
struct UCombustibleComponent : UTraitComponent {
	int32_t MillijoulesRemaining; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)

	bool GetCombustibleData(struct FCombustibleData OutData); // Function Icarus.CombustibleComponent.GetCombustibleData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1523e20
};

// Class Icarus.CombustibleLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCombustibleLibrary : URowLibrary {

	struct FCombustibleRowHandle StructToRowHandle(struct FCombustibleEnum EnumValue); // Function Icarus.CombustibleLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1525ec0
	struct FName StructToName(struct FCombustibleEnum EnumValue); // Function Icarus.CombustibleLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1525d70
	int32_t StructToInt(struct FCombustibleEnum EnumValue); // Function Icarus.CombustibleLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1525c30
	struct FCombustibleEnum RowHandleToStruct(struct FCombustibleRowHandle RowHandle); // Function Icarus.CombustibleLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15255f0
	void RemoveRowFromCombustibleTable(struct FName Name); // Function Icarus.CombustibleLibrary.RemoveRowFromCombustibleTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x15254b0
	void RefreshConstants(); // Function Icarus.CombustibleLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1525410
	int32_t NumRows(); // Function Icarus.CombustibleLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1525170
	bool NotEqual_EnumName(struct FCombustibleEnum A, struct FName B); // Function Icarus.CombustibleLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1525050
	bool NotEqual_EnumEnum(struct FCombustibleEnum A, struct FCombustibleEnum B); // Function Icarus.CombustibleLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524e70
	struct FCombustibleEnum NameToStruct(struct FName NameValue); // Function Icarus.CombustibleLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524cf0
	int32_t NameToInt(struct FName NameValue); // Function Icarus.CombustibleLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1524bd0
	struct FCombustibleRowHandle MakeLiteralCombustible(struct FCombustibleRowHandle RowHandle); // Function Icarus.CombustibleLibrary.MakeLiteralCombustible // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524a70
	struct FCombustibleRowHandle MakeCombustibleFromIndex(int32_t Index); // Function Icarus.CombustibleLibrary.MakeCombustibleFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524910
	struct FCombustibleEnum MakeCombustibleEnum(struct FCombustibleEnum Enum); // Function Icarus.CombustibleLibrary.MakeCombustibleEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524890
	struct FCombustibleRowHandle MakeCombustible(struct FName RowName); // Function Icarus.CombustibleLibrary.MakeCombustible // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15247f0
	bool IsValidName(struct FName NameValue); // Function Icarus.CombustibleLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1524590
	struct FCombustibleEnum IntToStruct(int32_t IntValue); // Function Icarus.CombustibleLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1524390
	struct FName IntToName(int32_t IntValue); // Function Icarus.CombustibleLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1524270
	void GetCombustibleStruct(struct FCombustibleRowHandle RowHandle, struct FCombustibleData Combustible, enum class EValid Paths); // Function Icarus.CombustibleLibrary.GetCombustibleStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1523fc0
	bool EqualEqual_FCombustibleRowHandleFCombustibleRowHandle(struct FCombustibleRowHandle RowHandleA, struct FCombustibleRowHandle RowHandleB); // Function Icarus.CombustibleLibrary.EqualEqual_FCombustibleRowHandleFCombustibleRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15238e0
	bool EqualEqual_EnumEnum(struct FCombustibleEnum A, struct FCombustibleEnum B); // Function Icarus.CombustibleLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15236b0
	struct FCombustibleRowHandle CastToCombustibleRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.CombustibleLibrary.CastToCombustibleRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1523450
	void BreakCombustibleEnum(struct FCombustibleEnum Enum, struct FName Name, int32_t Index); // Function Icarus.CombustibleLibrary.BreakCombustibleEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x15231d0
	void AddRowToCombustibleTable(struct FName Name, struct FCombustibleData Data, struct FCombustibleRowHandle NewRow); // Function Icarus.CombustibleLibrary.AddRowToCombustibleTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1522e70
};

// Class Icarus.CombustibleTable
// Size: 0xb8 (Inherited: 0xb8)
struct UCombustibleTable : UIcarusDataTable {
};

// Class Icarus.ConcaveHullMesh
// Size: 0x570 (Inherited: 0x4d0)
struct UConcaveHullMesh : UProceduralMeshComponent {
	struct FMulticastSparseDelegate OnMeshGenerated; // 0x4d0(0x01)
	char pad_4D1[0x3]; // 0x4d1(0x03)
	float Concavity; // 0x4d4(0x04)
	float LengthThreshold; // 0x4d8(0x04)
	bool bProjectToLandscape; // 0x4dc(0x01)
	char pad_4DD[0x3]; // 0x4dd(0x03)
	struct TArray<struct FVector2D> ConcaveHullPoints; // 0x4e0(0x10)
	struct TArray<struct FVector> ConcaveHullVertices; // 0x4f0(0x10)
	char pad_500[0x70]; // 0x500(0x70)

	bool IsRunningAsyncGenerate(); // Function Icarus.ConcaveHullMesh.IsRunningAsyncGenerate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x152b0a0
	void GenerateConcaveHull(struct TArray<struct FVector> Points, bool bIsWorldSpace, bool bCreateConvexCollision, bool bIsAsync); // Function Icarus.ConcaveHullMesh.GenerateConcaveHull // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1529a60
	void DebugGeneratedHullPoints(float ZOffset); // Function Icarus.ConcaveHullMesh.DebugGeneratedHullPoints // (Final|Native|Public|BlueprintCallable) // @ game+0x15292e0
};

// Class Icarus.ConfirmationPopupBase
// Size: 0x280 (Inherited: 0x260)
struct UConfirmationPopupBase : UUserWidget {
	struct FMulticastInlineDelegate OnOptionAClicked; // 0x260(0x10)
	struct FMulticastInlineDelegate OnOptionBClicked; // 0x270(0x10)

	void ShowConfirmationPopup(struct FConfirmationPopupDetails ConfirmationPopupDetails, struct FDelegate OnOptionA, struct FDelegate OnOptionB); // Function Icarus.ConfirmationPopupBase.ShowConfirmationPopup // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x152bd20
	void SetPromptDetails(struct FConfirmationPopupDetails ConfirmationPopupDetails); // Function Icarus.ConfirmationPopupBase.SetPromptDetails // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1a38c80
	void SetPromptContent(struct UUserWidget* ContentWidget); // Function Icarus.ConfirmationPopupBase.SetPromptContent // (Event|Protected|BlueprintEvent) // @ game+0x1a38c80
	void OptionBClicked(); // Function Icarus.ConfirmationPopupBase.OptionBClicked // (Final|Native|Protected|BlueprintCallable) // @ game+0x152bb00
	void OptionAClicked(); // Function Icarus.ConfirmationPopupBase.OptionAClicked // (Final|Native|Protected|BlueprintCallable) // @ game+0x152bae0
};

// Class Icarus.ConnectedPlayers
// Size: 0x100 (Inherited: 0xb0)
struct UConnectedPlayers : UActorComponent {
	struct FMulticastInlineDelegate OnConnectedPlayerInitialised; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnConnectedPlayerDisconnected; // 0xc0(0x10)
	struct TArray<struct FConnectedPlayer> ConnectedPlayers; // 0xd0(0x10)
	char pad_E0[0x8]; // 0xe0(0x08)
	struct UResetCharacterProspectStateCallbackProxyGen* ResetCharacterProspectStateCallback; // 0xe8(0x08)
	char pad_F0[0x10]; // 0xf0(0x10)

	bool ServerTryCompletePlayerInitialisation(struct AIcarusPlayerController* Player); // Function Icarus.ConnectedPlayers.ServerTryCompletePlayerInitialisation // (Final|Native|Public) // @ game+0x152bc80
	void OnRep_ConnectedPlayers(); // Function Icarus.ConnectedPlayers.OnRep_ConnectedPlayers // (Final|Native|Protected) // @ game+0x152bac0
	struct TArray<struct FConnectedPlayer> GetConnectedPlayers(); // Function Icarus.ConnectedPlayers.GetConnectedPlayers // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x152a4a0
	void FriendsUpdatedForConnectedPlayer(struct AIcarusPlayerController* Controller, struct TArray<struct FFriendPackage> NewFriends); // Function Icarus.ConnectedPlayers.FriendsUpdatedForConnectedPlayer // (Final|Native|Public|HasOutParms) // @ game+0x1529940
};

// Class Icarus.ConnectedPlayersFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UConnectedPlayersFunctionLibrary : UBlueprintFunctionLibrary {

	bool NotEqual_ConnectedPlayerPlayerCharacterID(struct FConnectedPlayer A, struct FPlayerCharacterID B); // Function Icarus.ConnectedPlayersFunctionLibrary.NotEqual_ConnectedPlayerPlayerCharacterID // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x152b710
	bool NotEqual_ConnectedPlayerConnectedPlayer(struct FConnectedPlayer A, struct FConnectedPlayer B); // Function Icarus.ConnectedPlayersFunctionLibrary.NotEqual_ConnectedPlayerConnectedPlayer // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x152b500
	bool HasInitialisedPlayerByPlayerState(struct UObject* WorldContextObject, struct AIcarusPlayerState* PlayerState); // Function Icarus.ConnectedPlayersFunctionLibrary.HasInitialisedPlayerByPlayerState // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152aeb0
	bool HasInitialisedPlayerByPlayerID(struct UObject* WorldContextObject, struct FString PlayerID); // Function Icarus.ConnectedPlayersFunctionLibrary.HasInitialisedPlayerByPlayerID // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152adc0
	bool HasInitialisedPlayerByPlayerCharacterID(struct UObject* WorldContextObject, struct FPlayerCharacterID PlayerCharacterID); // Function Icarus.ConnectedPlayersFunctionLibrary.HasInitialisedPlayerByPlayerCharacterID // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x152acd0
	bool HasInitialisedPlayerByPlayerCharacter(struct UObject* WorldContextObject, struct AIcarusPlayerCharacter* PlayerCharacter); // Function Icarus.ConnectedPlayersFunctionLibrary.HasInitialisedPlayerByPlayerCharacter // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152ac00
	bool HasInitialisedPlayerByController(struct UObject* WorldContextObject, struct AIcarusPlayerController* Controller); // Function Icarus.ConnectedPlayersFunctionLibrary.HasInitialisedPlayerByController // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152ab30
	bool HasInitialisedPlayerByConnectedPlayer(struct FConnectedPlayer ConnectedPlayer); // Function Icarus.ConnectedPlayersFunctionLibrary.HasInitialisedPlayerByConnectedPlayer // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x152aa10
	struct UConnectedPlayers* GetConnectedPlayers(struct UObject* WorldContextObject); // Function Icarus.ConnectedPlayersFunctionLibrary.GetConnectedPlayers // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152a550
	bool GetConnectedPlayerByPlayerState(struct UObject* WorldContextObject, struct AIcarusPlayerState* PlayerState, struct FConnectedPlayer OutConnectedPlayer); // Function Icarus.ConnectedPlayersFunctionLibrary.GetConnectedPlayerByPlayerState // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x152a300
	bool GetConnectedPlayerByPlayerID(struct UObject* WorldContextObject, struct FString PlayerID, struct FConnectedPlayer OutConnectedPlayer); // Function Icarus.ConnectedPlayersFunctionLibrary.GetConnectedPlayerByPlayerID // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x152a130
	bool GetConnectedPlayerByPlayerCharacterID(struct UObject* WorldContextObject, struct FPlayerCharacterID PlayerCharacterID, struct FConnectedPlayer OutConnectedPlayer); // Function Icarus.ConnectedPlayersFunctionLibrary.GetConnectedPlayerByPlayerCharacterID // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1529f50
	bool GetConnectedPlayerByPlayerCharacter(struct UObject* WorldContextObject, struct AIcarusPlayerCharacter* PlayerCharacter, struct FConnectedPlayer OutConnectedPlayer); // Function Icarus.ConnectedPlayersFunctionLibrary.GetConnectedPlayerByPlayerCharacter // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1529db0
	bool GetConnectedPlayerByController(struct UObject* WorldContextObject, struct AIcarusPlayerController* Controller, struct FConnectedPlayer OutConnectedPlayer); // Function Icarus.ConnectedPlayersFunctionLibrary.GetConnectedPlayerByController // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1529c10
	bool EqualEqual_ConnectedPlayerPlayerCharacterID(struct FConnectedPlayer A, struct FPlayerCharacterID B); // Function Icarus.ConnectedPlayersFunctionLibrary.EqualEqual_ConnectedPlayerPlayerCharacterID // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1529570
	bool EqualEqual_ConnectedPlayerConnectedPlayer(struct FConnectedPlayer A, struct FConnectedPlayer B); // Function Icarus.ConnectedPlayersFunctionLibrary.EqualEqual_ConnectedPlayerConnectedPlayer // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1529360
};

// Class Icarus.ConsumableComponent
// Size: 0xd0 (Inherited: 0xd0)
struct UConsumableComponent : UTraitComponent {

	bool GetConsumableData(struct FConsumableData OutData); // Function Icarus.ConsumableComponent.GetConsumableData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x152a5e0
};

// Class Icarus.ConsumableLibrary
// Size: 0x28 (Inherited: 0x28)
struct UConsumableLibrary : URowLibrary {

	struct FConsumableRowHandle StructToRowHandle(struct FConsumableEnum EnumValue); // Function Icarus.ConsumableLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152bff0
	struct FName StructToName(struct FConsumableEnum EnumValue); // Function Icarus.ConsumableLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152bf50
	int32_t StructToInt(struct FConsumableEnum EnumValue); // Function Icarus.ConsumableLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152beb0
	struct FConsumableEnum RowHandleToStruct(struct FConsumableRowHandle RowHandle); // Function Icarus.ConsumableLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152bbc0
	void RemoveRowFromConsumableTable(struct FName Name); // Function Icarus.ConsumableLibrary.RemoveRowFromConsumableTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x152bb40
	void RefreshConstants(); // Function Icarus.ConsumableLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x152bb20
	int32_t NumRows(); // Function Icarus.ConsumableLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152ba90
	bool NotEqual_EnumName(struct FConsumableEnum A, struct FName B); // Function Icarus.ConsumableLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152b9a0
	bool NotEqual_EnumEnum(struct FConsumableEnum A, struct FConsumableEnum B); // Function Icarus.ConsumableLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152b8b0
	struct FConsumableEnum NameToStruct(struct FName NameValue); // Function Icarus.ConsumableLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152b470
	int32_t NameToInt(struct FName NameValue); // Function Icarus.ConsumableLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x152b3e0
	struct FConsumableRowHandle MakeLiteralConsumable(struct FConsumableRowHandle RowHandle); // Function Icarus.ConsumableLibrary.MakeLiteralConsumable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152b310
	struct FConsumableRowHandle MakeConsumableFromIndex(int32_t Index); // Function Icarus.ConsumableLibrary.MakeConsumableFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152b280
	struct FConsumableEnum MakeConsumableEnum(struct FConsumableEnum Enum); // Function Icarus.ConsumableLibrary.MakeConsumableEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152b200
	struct FConsumableRowHandle MakeConsumable(struct FName RowName); // Function Icarus.ConsumableLibrary.MakeConsumable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152b160
	bool IsValidName(struct FName NameValue); // Function Icarus.ConsumableLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x152b0d0
	struct FConsumableEnum IntToStruct(int32_t IntValue); // Function Icarus.ConsumableLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152b010
	struct FName IntToName(int32_t IntValue); // Function Icarus.ConsumableLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x152af80
	void GetConsumableStruct(struct FConsumableRowHandle RowHandle, struct FConsumableData Consumable, enum class EValid Paths); // Function Icarus.ConsumableLibrary.GetConsumableStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x152a7e0
	bool EqualEqual_FConsumableRowHandleFConsumableRowHandle(struct FConsumableRowHandle RowHandleA, struct FConsumableRowHandle RowHandleB); // Function Icarus.ConsumableLibrary.EqualEqual_FConsumableRowHandleFConsumableRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1529800
	bool EqualEqual_EnumEnum(struct FConsumableEnum A, struct FConsumableEnum B); // Function Icarus.ConsumableLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1529710
	struct FConsumableRowHandle CastToConsumableRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.ConsumableLibrary.CastToConsumableRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1529130
	void BreakConsumableEnum(struct FConsumableEnum Enum, struct FName Name, int32_t Index); // Function Icarus.ConsumableLibrary.BreakConsumableEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1528fd0
	void AddRowToConsumableTable(struct FName Name, struct FConsumableData Data, struct FConsumableRowHandle NewRow); // Function Icarus.ConsumableLibrary.AddRowToConsumableTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1528cf0
};

// Class Icarus.ConsumableTable
// Size: 0xb8 (Inherited: 0xb8)
struct UConsumableTable : UIcarusDataTable {
};

// Class Icarus.ContextMenuFactory
// Size: 0x238 (Inherited: 0x220)
struct AContextMenuFactory : AActor {
	struct APlayerController* OwningPlayer; // 0x220(0x08)
	struct TArray<struct FContextMenuItemData> Items; // 0x228(0x10)

	struct UContextMenuWidget* ShowAsRadialMenu(); // Function Icarus.ContextMenuFactory.ShowAsRadialMenu // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	struct UContextMenuWidget* ShowAsContextMenu(struct FVector2D ScreenPosition); // Function Icarus.ContextMenuFactory.ShowAsContextMenu // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void CreateMenu(struct APlayerController* NewOwningPlayer); // Function Icarus.ContextMenuFactory.CreateMenu // (Final|Native|Public|BlueprintCallable) // @ game+0x1529250
	void AddItem(struct FContextMenuItemData ContextMenuItemData, struct FDelegate OnClickedDelegate); // Function Icarus.ContextMenuFactory.AddItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1528b90
};

// Class Icarus.ContextMenuGroupTypesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UContextMenuGroupTypesLibrary : URowLibrary {

	struct FContextMenuGroupTypesRowHandle StructToRowHandle(struct FContextMenuGroupTypesEnum EnumValue); // Function Icarus.ContextMenuGroupTypesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1531b20
	struct FName StructToName(struct FContextMenuGroupTypesEnum EnumValue); // Function Icarus.ContextMenuGroupTypesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15319e0
	int32_t StructToInt(struct FContextMenuGroupTypesEnum EnumValue); // Function Icarus.ContextMenuGroupTypesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15318a0
	struct FContextMenuGroupTypesEnum RowHandleToStruct(struct FContextMenuGroupTypesRowHandle RowHandle); // Function Icarus.ContextMenuGroupTypesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1531720
	void RemoveRowFromContextMenuGroupTypesTable(struct FName Name); // Function Icarus.ContextMenuGroupTypesLibrary.RemoveRowFromContextMenuGroupTypesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1531620
	void RefreshConstants(); // Function Icarus.ContextMenuGroupTypesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x15315e0
	int32_t NumRows(); // Function Icarus.ContextMenuGroupTypesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1531580
	bool NotEqual_EnumName(struct FContextMenuGroupTypesEnum A, struct FName B); // Function Icarus.ContextMenuGroupTypesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15313a0
	bool NotEqual_EnumEnum(struct FContextMenuGroupTypesEnum A, struct FContextMenuGroupTypesEnum B); // Function Icarus.ContextMenuGroupTypesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15311c0
	struct FContextMenuGroupTypesEnum NameToStruct(struct FName NameValue); // Function Icarus.ContextMenuGroupTypesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15310a0
	int32_t NameToInt(struct FName NameValue); // Function Icarus.ContextMenuGroupTypesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1530f80
	struct FContextMenuGroupTypesRowHandle MakeLiteralContextMenuGroupTypes(struct FContextMenuGroupTypesRowHandle RowHandle); // Function Icarus.ContextMenuGroupTypesLibrary.MakeLiteralContextMenuGroupTypes // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1530de0
	struct FContextMenuGroupTypesRowHandle MakeContextMenuGroupTypesFromIndex(int32_t Index); // Function Icarus.ContextMenuGroupTypesLibrary.MakeContextMenuGroupTypesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1530ba0
	struct FContextMenuGroupTypesEnum MakeContextMenuGroupTypesEnum(struct FContextMenuGroupTypesEnum Enum); // Function Icarus.ContextMenuGroupTypesLibrary.MakeContextMenuGroupTypesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1530b20
	struct FContextMenuGroupTypesRowHandle MakeContextMenuGroupTypes(struct FName RowName); // Function Icarus.ContextMenuGroupTypesLibrary.MakeContextMenuGroupTypes // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1530a80
	bool IsValidName(struct FName NameValue); // Function Icarus.ContextMenuGroupTypesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1530940
	struct FContextMenuGroupTypesEnum IntToStruct(int32_t IntValue); // Function Icarus.ContextMenuGroupTypesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1530770
	struct FName IntToName(int32_t IntValue); // Function Icarus.ContextMenuGroupTypesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1530650
	void GetContextMenuGroupTypesStruct(struct FContextMenuGroupTypesRowHandle RowHandle, struct FContextMenuGroupType ContextMenuGroupTypes, enum class EValid Paths); // Function Icarus.ContextMenuGroupTypesLibrary.GetContextMenuGroupTypesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1530030
	bool EqualEqual_FContextMenuGroupTypesRowHandleFContextMenuGroupTypesRowHandle(struct FContextMenuGroupTypesRowHandle RowHandleA, struct FContextMenuGroupTypesRowHandle RowHandleB); // Function Icarus.ContextMenuGroupTypesLibrary.EqualEqual_FContextMenuGroupTypesRowHandleFContextMenuGroupTypesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152fdb0
	bool EqualEqual_EnumEnum(struct FContextMenuGroupTypesEnum A, struct FContextMenuGroupTypesEnum B); // Function Icarus.ContextMenuGroupTypesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x152fbd0
	struct FContextMenuGroupTypesRowHandle CastToContextMenuGroupTypesRowHandle(struct FRowHandle RowHandle, enum class EValid Paths); // Function Icarus.ContextMenuGroupTypesLibrary.CastToContextMenuGroupTypesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x152f4f0
	void BreakContextMenuGroupTypesEnum(struct FContextMenuGroupTypesEnum Enum, struct FName Name, int32_t Index); // Function Icarus.ContextMenuGroupTypesLibrary.BreakContextMenuGroupTypesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x152f230
	void AddRowToContextMenuGroupTypesTable(struct FName Name, struct FContextMenuGroupType Data, struct FContextMenuGroupTypesRowHandle NewRow); // Function Icarus.ContextMenuGroupTypesLibrary.AddRowToContextMenuGroupTypesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x152ee10
};

// Class Icarus.ContextMenuGroupTypesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UContextMenuGroupTypesTable : UIcarusDataTable {
};

// Class Icarus.ContextMenuWidget
// Size: 0x260 (Inherited: 0x260)
struct UContextMenuWidget : UUserWidget {

	void ShowMenu(struct FVector2D ScreenPosition, struct FText MenuName, struct UTexture2D* MenuIcon); // Function Icarus.ContextMenuWidget.ShowMenu // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void CloseMenu(); // Function Icarus.ContextMenuWidget.CloseMenu // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void AddItems(struct TArray<struct FContextMenuItemData> ContextMenuItems); // Function Icarus.ContextMenuWidget.AddItems // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
};

// Class Icarus.CosmeticsFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCosmeticsFunctionLibrary : UBlueprintFunctionLibrary {

	void LogDLCInfo(); // Function Icarus.CosmeticsFunctionLibrary.LogDLCInfo // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1530a60
	bool IsDLCPackageInstalled(struct FDLCPackageDataRowHandle DLCPackage); // Function Icarus.CosmeticsFunctionLibrary.IsDLCPackageInstalled // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1530890
};

// Class Icarus.CraftingAudioDataLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCraftingAudioDataLibrary : URowLibrary {

	struct FCraftingAudioDataRowHandle StructToRowHandle(struct FCraftingAudioDataEnum EnumValue); // Function Icarus.CraftingAudioDataLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1531bd0
	struct FName StructToName(struct FCraftingAudioDataEnum EnumValue); // Function Icarus.CraftingAudioDataLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1531a80
	int32_t StructToInt(struct FCraftingAudioDataEnum EnumValue); // Function Icarus.CraftingAudioDataLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1531940
	struct FCraftingAudioDataEnum RowHandleToStruct(struct FCraftingAudioDataRowHandle RowHandle); // Function Icarus.CraftingAudioDataLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15317e0
	void RemoveRowFromCraftingAudioDataTable(struct FName Name); // Function Icarus.CraftingAudioDataLibrary.RemoveRowFromCraftingAudioDataTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x15316a0
	void RefreshConstants(); // Function Icarus.CraftingAudioDataLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1531600
	int32_t NumRows(); // Function Icarus.CraftingAudioDataLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15315b0
	bool NotEqual_EnumName(struct FCraftingAudioDataEnum A, struct FName B); // Function Icarus.CraftingAudioDataLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1531490
	bool NotEqual_EnumEnum(struct FCraftingAudioDataEnum A, struct FCraftingAudioDataEnum B); // Function Icarus.CraftingAudioDataLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15312b0
	struct FCraftingAudioDataEnum NameToStruct(struct FName NameValue); // Function Icarus.CraftingAudioDataLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1531130
	int32_t NameToInt(struct FName NameValue); // Function Icarus.CraftingAudioDataLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1531010
	struct FCraftingAudioDataRowHandle MakeLiteralCraftingAudioData(struct FCraftingAudioDataRowHandle RowHandle); // Function Icarus.CraftingAudioDataLibrary.MakeLiteralCraftingAudioData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1530eb0
	struct FCraftingAudioDataRowHandle MakeCraftingAudioDataFromIndex(int32_t Index); // Function Icarus.CraftingAudioDataLibrary.MakeCraftingAudioDataFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1530d50
	struct FCraftingAudioDataEnum MakeCraftingAudioDataEnum(struct FCraftingAudioDataEnum Enum); // Function Icarus.CraftingAudioDataLibrary.MakeCraftingAudioDataEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1530cd0
	struct FCraftingAudioDataRowHandle MakeCraftingAudioData(struct FName RowName); // Function Icarus.CraftingAudioDataLibrary.MakeCraftingAudioData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1530c30
	bool IsValidName(struct FName NameValue); // Function Icarus.CraftingAudioDataLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x15309d0
	struct FCraftingAudioDataEnum IntToStruct(int32_t IntValue); // Function Icarus.CraftingAudioDataLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1530800
	struct FName IntToName(int32_t IntValue); // Function Icarus.CraftingAudioDataLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x15306e0
	void GetCraftingAudioDataStruct(struct FCraftingAudioDataRowHandle RowHandle, struct FCraftingAudioData CraftingAudioData, enum class EValid Paths); // Function Icarus.CraftingAudioDataLibrary.GetCraftingAudioDataStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x15301f0
