// Class OnlineSubsystemIcarus.AddPlayerToProspectCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct UAddPlayerToProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct UAddPlayerToProspectCallbackProxyGen* AddPlayerToProspect(struct FReqAddPlayerToProspect Request); // Function OnlineSubsystemIcarus.AddPlayerToProspectCallbackProxyGen.AddPlayerToProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dc840
};

// Class OnlineSubsystemIcarus.BackToHabCallbackProxyGen
// Size: 0x98 (Inherited: 0x30)
struct UBackToHabCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x48]; // 0x50(0x48)

	struct UBackToHabCallbackProxyGen* BackToHab(struct FReqBackToHab Request); // Function OnlineSubsystemIcarus.BackToHabCallbackProxyGen.BackToHab // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dc900
};

// Class OnlineSubsystemIcarus.BuyWorkshopPackCallbackProxyGen
// Size: 0x70 (Inherited: 0x30)
struct UBuyWorkshopPackCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x20]; // 0x50(0x20)

	struct UBuyWorkshopPackCallbackProxyGen* BuyWorkshopPack(struct FReqPurchaseWorkshopPack Request); // Function OnlineSubsystemIcarus.BuyWorkshopPackCallbackProxyGen.BuyWorkshopPack // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dca80
};

// Class OnlineSubsystemIcarus.CanJoinProspectCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct UCanJoinProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct UCanJoinProspectCallbackProxyGen* CanJoinProspect(struct FReqCanJoinProspect Request); // Function OnlineSubsystemIcarus.CanJoinProspectCallbackProxyGen.CanJoinProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dcb40
};

// Class OnlineSubsystemIcarus.CheckProspectExpiredCallbackProxyGen
// Size: 0x60 (Inherited: 0x30)
struct UCheckProspectExpiredCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x10]; // 0x50(0x10)

	struct UCheckProspectExpiredCallbackProxyGen* CheckProspectExpired(struct FReqCheckProspectExpired Request); // Function OnlineSubsystemIcarus.CheckProspectExpiredCallbackProxyGen.CheckProspectExpired // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dcc00
};

// Class OnlineSubsystemIcarus.ClaimNotificationAttachmentsCallbackProxyGen
// Size: 0x70 (Inherited: 0x30)
struct UClaimNotificationAttachmentsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x20]; // 0x50(0x20)

	struct UClaimNotificationAttachmentsCallbackProxyGen* ClaimNotificationAttachments(struct FReqClaimNotificationAttachments Request); // Function OnlineSubsystemIcarus.ClaimNotificationAttachmentsCallbackProxyGen.ClaimNotificationAttachments // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dccb0
};

// Class OnlineSubsystemIcarus.ClaimProspectCallbackProxyGen
// Size: 0xf8 (Inherited: 0x30)
struct UClaimProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0xa8]; // 0x50(0xa8)

	struct UClaimProspectCallbackProxyGen* ClaimProspect(struct FReqClaimProspect Request); // Function OnlineSubsystemIcarus.ClaimProspectCallbackProxyGen.ClaimProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dcd70
};

// Class OnlineSubsystemIcarus.CreateCharacterCallbackProxyGen
// Size: 0x128 (Inherited: 0x30)
struct UCreateCharacterCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0xd8]; // 0x50(0xd8)

	struct UCreateCharacterCallbackProxyGen* CreateCharacter(struct FReqCreateCharacter Request); // Function OnlineSubsystemIcarus.CreateCharacterCallbackProxyGen.CreateCharacter // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dcf20
};

// Class OnlineSubsystemIcarus.CreateDropshipCallbackProxyGen
// Size: 0x88 (Inherited: 0x30)
struct UCreateDropshipCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x38]; // 0x50(0x38)

	struct UCreateDropshipCallbackProxyGen* CreateDropship(struct FReqCreateDropship Request); // Function OnlineSubsystemIcarus.CreateDropshipCallbackProxyGen.CreateDropship // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd0f0
};

// Class OnlineSubsystemIcarus.CreateProspectCallbackProxyGen
// Size: 0xd0 (Inherited: 0x30)
struct UCreateProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x80]; // 0x50(0x80)

	struct UCreateProspectCallbackProxyGen* CreateProspect(struct FReqCreateProspect Request); // Function OnlineSubsystemIcarus.CreateProspectCallbackProxyGen.CreateProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd1f0
};

// Class OnlineSubsystemIcarus.DeleteCharacterCallbackProxyGen
// Size: 0x58 (Inherited: 0x30)
struct UDeleteCharacterCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x8]; // 0x50(0x08)

	struct UDeleteCharacterCallbackProxyGen* DeleteCharacter(struct FReqDeleteCharacter Request); // Function OnlineSubsystemIcarus.DeleteCharacterCallbackProxyGen.DeleteCharacter // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd390
};

// Class OnlineSubsystemIcarus.DeleteDropshipCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UDeleteDropshipCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UDeleteDropshipCallbackProxyGen* DeleteDropship(struct FReqDeleteDropship Request); // Function OnlineSubsystemIcarus.DeleteDropshipCallbackProxyGen.DeleteDropship // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd430
};

// Class OnlineSubsystemIcarus.DeleteNotificationCallbackProxyGen
// Size: 0x70 (Inherited: 0x30)
struct UDeleteNotificationCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x20]; // 0x50(0x20)

	struct UDeleteNotificationCallbackProxyGen* DeleteNotification(struct FReqDeleteNotification Request); // Function OnlineSubsystemIcarus.DeleteNotificationCallbackProxyGen.DeleteNotification // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd4e0
};

// Class OnlineSubsystemIcarus.GetAllProspectsCallbackProxyGen
// Size: 0x60 (Inherited: 0x30)
struct UGetAllProspectsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x10]; // 0x50(0x10)

	struct UGetAllProspectsCallbackProxyGen* GetAllProspects(struct FReqGetAllProspects Request); // Function OnlineSubsystemIcarus.GetAllProspectsCallbackProxyGen.GetAllProspects // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd5a0
};

// Class OnlineSubsystemIcarus.GetAvailableProspectsCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetAvailableProspectsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetAvailableProspectsCallbackProxyGen* GetAvailableProspects(struct FReqGetAvailableProspects Request); // Function OnlineSubsystemIcarus.GetAvailableProspectsCallbackProxyGen.GetAvailableProspects // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd650
};

// Class OnlineSubsystemIcarus.GetChallengesCallbackProxyGen
// Size: 0x60 (Inherited: 0x30)
struct UGetChallengesCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x10]; // 0x50(0x10)

	struct UGetChallengesCallbackProxyGen* GetChallenges(struct FReqGetChallenges Request); // Function OnlineSubsystemIcarus.GetChallengesCallbackProxyGen.GetChallenges // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd700
};

// Class OnlineSubsystemIcarus.GetCharacterLoadoutCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetCharacterLoadoutCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetCharacterLoadoutCallbackProxyGen* GetCharacterLoadout(struct FReqGetCharacterLoadout Request); // Function OnlineSubsystemIcarus.GetCharacterLoadoutCallbackProxyGen.GetCharacterLoadout // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd7b0
};

// Class OnlineSubsystemIcarus.GetCharacterProfileCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetCharacterProfileCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetCharacterProfileCallbackProxyGen* GetCharacterProfile(struct FReqGetCharacterProfile Request); // Function OnlineSubsystemIcarus.GetCharacterProfileCallbackProxyGen.GetCharacterProfile // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd860
};

// Class OnlineSubsystemIcarus.GetCharactersCallbackProxyGen
// Size: 0x58 (Inherited: 0x30)
struct UGetCharactersCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x8]; // 0x50(0x08)

	struct UGetCharactersCallbackProxyGen* GetCharacters(struct FReqGetCharacters Request); // Function OnlineSubsystemIcarus.GetCharactersCallbackProxyGen.GetCharacters // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd910
};

// Class OnlineSubsystemIcarus.GetCreditsCallbackProxyGen
// Size: 0x60 (Inherited: 0x30)
struct UGetCreditsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x10]; // 0x50(0x10)

	struct UGetCreditsCallbackProxyGen* GetCredits(struct FReqGetCredits Request); // Function OnlineSubsystemIcarus.GetCreditsCallbackProxyGen.GetCredits // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd9a0
};

// Class OnlineSubsystemIcarus.GetDropshipsCallbackProxyGen
// Size: 0x60 (Inherited: 0x30)
struct UGetDropshipsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x10]; // 0x50(0x10)

	struct UGetDropshipsCallbackProxyGen* GetDropships(struct FReqGetDropships Request); // Function OnlineSubsystemIcarus.GetDropshipsCallbackProxyGen.GetDropships // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dda50
};

// Class OnlineSubsystemIcarus.GetLastProspectCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetLastProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetLastProspectCallbackProxyGen* GetLastProspect(struct FReqGetLastProspect Request); // Function OnlineSubsystemIcarus.GetLastProspectCallbackProxyGen.GetLastProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9ddb00
};

// Class OnlineSubsystemIcarus.GetLoadoutInventoryCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetLoadoutInventoryCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetLoadoutInventoryCallbackProxyGen* GetLoadoutInventory(struct FReqLoadoutInventory Request); // Function OnlineSubsystemIcarus.GetLoadoutInventoryCallbackProxyGen.GetLoadoutInventory // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9ddbb0
};

// Class OnlineSubsystemIcarus.GetMetaInventoryCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetMetaInventoryCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetMetaInventoryCallbackProxyGen* GetMetaInventory(struct FReqGetMetaInventory Request); // Function OnlineSubsystemIcarus.GetMetaInventoryCallbackProxyGen.GetMetaInventory // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9ddc60
};

// Class OnlineSubsystemIcarus.GetMetaResourceCallbackProxyGen
// Size: 0x60 (Inherited: 0x30)
struct UGetMetaResourceCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x10]; // 0x50(0x10)

	struct UGetMetaResourceCallbackProxyGen* GetMetaResource(struct FReqGetMetaResources Request); // Function OnlineSubsystemIcarus.GetMetaResourceCallbackProxyGen.GetMetaResource // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e1af0
};

// Class OnlineSubsystemIcarus.GetNotificationsCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetNotificationsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetNotificationsCallbackProxyGen* GetNotifications(struct FReqGetNotifications Request); // Function OnlineSubsystemIcarus.GetNotificationsCallbackProxyGen.GetNotifications // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e1ba0
};

// Class OnlineSubsystemIcarus.GetPreparedLoadoutCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UGetPreparedLoadoutCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UGetPreparedLoadoutCallbackProxyGen* GetPreparedLoadout(struct FReqPreparedLoadout Request); // Function OnlineSubsystemIcarus.GetPreparedLoadoutCallbackProxyGen.GetPreparedLoadout // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e1c50
};

// Class OnlineSubsystemIcarus.GetProspectCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct UGetProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct UGetProspectCallbackProxyGen* GetProspect(struct FReqGetProspect Request); // Function OnlineSubsystemIcarus.GetProspectCallbackProxyGen.GetProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e1d00
};

// Class OnlineSubsystemIcarus.GetProspectReportCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct UGetProspectReportCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct UGetProspectReportCallbackProxyGen* GetProspectReport(struct FReqGetProspectReport Request); // Function OnlineSubsystemIcarus.GetProspectReportCallbackProxyGen.GetProspectReport // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e1dc0
};

// Class OnlineSubsystemIcarus.GetProspectSummaryCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct UGetProspectSummaryCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct UGetProspectSummaryCallbackProxyGen* GetProspectSummary(struct FReqGetProspectSummary Request); // Function OnlineSubsystemIcarus.GetProspectSummaryCallbackProxyGen.GetProspectSummary // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e1e80
};

// Class OnlineSubsystemIcarus.GetUserProfileCallbackProxyGen
// Size: 0x58 (Inherited: 0x30)
struct UGetUserProfileCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x8]; // 0x50(0x08)

	struct UGetUserProfileCallbackProxyGen* GetUserProfile(struct FReqGetUserProfile Request); // Function OnlineSubsystemIcarus.GetUserProfileCallbackProxyGen.GetUserProfile // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e1f60
};

// Class OnlineSubsystemIcarus.GetWorkshopPacksCallbackProxyGen
// Size: 0x58 (Inherited: 0x30)
struct UGetWorkshopPacksCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x8]; // 0x50(0x08)

	struct UGetWorkshopPacksCallbackProxyGen* GetWorkshopPacks(struct FReqGetWorkshopPacks Request); // Function OnlineSubsystemIcarus.GetWorkshopPacksCallbackProxyGen.GetWorkshopPacks // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e1ff0
};

// Class OnlineSubsystemIcarus.HostCandidateCallbackProxyGen
// Size: 0x70 (Inherited: 0x30)
struct UHostCandidateCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x20]; // 0x50(0x20)

	struct UHostCandidateCallbackProxyGen* HostCandidate(struct FReqHostCandidate Request); // Function OnlineSubsystemIcarus.HostCandidateCallbackProxyGen.HostCandidate // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e2080
};

// Class OnlineSubsystemIcarus.IcarusConnectionComponentBase
// Size: 0x1a0 (Inherited: 0x28)
struct UIcarusConnectionComponentBase : UObject {
	char pad_28[0x48]; // 0x28(0x48)
	struct FString AddressAndPort; // 0x70(0x10)
	char pad_80[0x120]; // 0x80(0x120)

	bool IsConnected(); // Function OnlineSubsystemIcarus.IcarusConnectionComponentBase.IsConnected // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9e2140
	int32_t GetReconnectAttempts(); // Function OnlineSubsystemIcarus.IcarusConnectionComponentBase.GetReconnectAttempts // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9e1f40
	struct FString GetAuthType(); // Function OnlineSubsystemIcarus.IcarusConnectionComponentBase.GetAuthType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9e1750
	struct FString GetAuthToken(); // Function OnlineSubsystemIcarus.IcarusConnectionComponentBase.GetAuthToken // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9e1680
	struct FString GetAuthId(); // Function OnlineSubsystemIcarus.IcarusConnectionComponentBase.GetAuthId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9e15b0
};

// Class OnlineSubsystemIcarus.IcarusConnectionComponentGen
// Size: 0x550 (Inherited: 0x1a0)
struct UIcarusConnectionComponentGen : UIcarusConnectionComponentBase {
	char pad_1A0[0x3b0]; // 0x1a0(0x3b0)
};

// Class OnlineSubsystemIcarus.IcarusConnectionComponent
// Size: 0x670 (Inherited: 0x550)
struct UIcarusConnectionComponent : UIcarusConnectionComponentGen {
	char pad_550[0x120]; // 0x550(0x120)
};

// Class OnlineSubsystemIcarus.IcarusLobbyConnectionComponentBase
// Size: 0x1c0 (Inherited: 0x28)
struct UIcarusLobbyConnectionComponentBase : UObject {
	struct FString AddressAndPort; // 0x28(0x10)
	char pad_38[0x188]; // 0x38(0x188)

	bool IsConnected(); // Function OnlineSubsystemIcarus.IcarusLobbyConnectionComponentBase.IsConnected // (Final|Native|Public|BlueprintCallable) // @ game+0x9e2170
};

// Class OnlineSubsystemIcarus.IcarusLobbyConnectionComponentGen
// Size: 0x1d0 (Inherited: 0x1c0)
struct UIcarusLobbyConnectionComponentGen : UIcarusLobbyConnectionComponentBase {
	char pad_1C0[0x10]; // 0x1c0(0x10)
};

// Class OnlineSubsystemIcarus.IcarusLobbyConnectionComponent
// Size: 0x228 (Inherited: 0x1d0)
struct UIcarusLobbyConnectionComponent : UIcarusLobbyConnectionComponentGen {
	char pad_1D0[0x58]; // 0x1d0(0x58)
};

// Class OnlineSubsystemIcarus.IcarusMessageListeners
// Size: 0x68 (Inherited: 0x28)
struct UIcarusMessageListeners : UObject {
	struct FMulticastInlineDelegate OnConnectMessage; // 0x28(0x10)
	struct FMulticastInlineDelegate OnMatchUpdateMessage; // 0x38(0x10)
	struct FMulticastInlineDelegate OnUpdateConnectionStringMessage; // 0x48(0x10)
	struct FMulticastInlineDelegate OnChatMessage; // 0x58(0x10)
};

// Class OnlineSubsystemIcarus.IcarusOfflineConnectionComponentGen
// Size: 0x6d0 (Inherited: 0x670)
struct UIcarusOfflineConnectionComponentGen : UIcarusConnectionComponent {
	char pad_670[0x60]; // 0x670(0x60)
};

// Class OnlineSubsystemIcarus.JoinProspectCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UJoinProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UJoinProspectCallbackProxyGen* JoinProspect(struct FReqJoinProspect Request); // Function OnlineSubsystemIcarus.JoinProspectCallbackProxyGen.JoinProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e2200
};

// Class OnlineSubsystemIcarus.LeaveProspectCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct ULeaveProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct ULeaveProspectCallbackProxyGen* LeaveProspect(struct FReqLeaveProspect Request); // Function OnlineSubsystemIcarus.LeaveProspectCallbackProxyGen.LeaveProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e22b0
};

// Class OnlineSubsystemIcarus.LobbyMessageCallbackProxyGen
// Size: 0x90 (Inherited: 0x30)
struct ULobbyMessageCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x40]; // 0x50(0x40)

	struct ULobbyMessageCallbackProxyGen* LobbyMessage(struct FReqLobbyMessage Request); // Function OnlineSubsystemIcarus.LobbyMessageCallbackProxyGen.LobbyMessage // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e2360
};

// Class OnlineSubsystemIcarus.ModifyDropshipCallbackProxyGen
// Size: 0x90 (Inherited: 0x30)
struct UModifyDropshipCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x40]; // 0x50(0x40)

	struct UModifyDropshipCallbackProxyGen* ModifyDropship(struct FReqModifyDropship Request); // Function OnlineSubsystemIcarus.ModifyDropshipCallbackProxyGen.ModifyDropship // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e25a0
};

// Class OnlineSubsystemIcarus.MoveMetaInventoryItemCallbackProxyGen
// Size: 0x90 (Inherited: 0x30)
struct UMoveMetaInventoryItemCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x40]; // 0x50(0x40)

	struct UMoveMetaInventoryItemCallbackProxyGen* MoveMetaInventoryItem(struct FReqMoveMetaInventoryItem Request); // Function OnlineSubsystemIcarus.MoveMetaInventoryItemCallbackProxyGen.MoveMetaInventoryItem // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e26a0
};

// Class OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UOnlineSubsystemIcarusFunctionLibrary : UBlueprintFunctionLibrary {

	bool SwitchOnlineMode(bool bOnlineMode); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.SwitchOnlineMode // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9e28d0
	void SetPresence(struct APlayerController* PlayerController, enum class EOnlinePresenceStatusIcarus NewState, struct TArray<struct FPresencePropertyKeyPair> Properties); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.SetPresence // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9e2780
	struct FPresencePropertyKeyPair MakeLiteralPresencePropertyString(struct FName Key, struct FString Value); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.MakeLiteralPresencePropertyString // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e2450
	bool IsOnlineSubsystemIcarusEnabled(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.IsOnlineSubsystemIcarusEnabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e21d0
	bool IsOnlineMode(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.IsOnlineMode // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e21a0
	bool GetIcarusVersion(struct FIcarusVersion Version); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.GetIcarusVersion // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9e1a20
	struct UIcarusMessageListeners* GetIcarusMessageListeners(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.GetIcarusMessageListeners // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e19f0
	struct UIcarusLobbyConnectionComponent* GetIcarusLobbyConnectionComponent(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.GetIcarusLobbyConnectionComponent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e19c0
	struct UIcarusConnectionComponent* GetIcarusConnectionComponent(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.GetIcarusConnectionComponent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e1990
	struct FString GetHash(struct TArray<char> Buffer); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.GetHash // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9e18a0
	struct FString GetGatewayAddress(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusFunctionLibrary.GetGatewayAddress // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e1820
};

// Class OnlineSubsystemIcarus.OnlineSubsystemIcarusOfflineFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UOnlineSubsystemIcarusOfflineFunctionLibrary : UBlueprintFunctionLibrary {

	bool SwitchOnlineMode(bool bOnlineMode); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusOfflineFunctionLibrary.SwitchOnlineMode // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9e28d0
	bool IsOnlineMode(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusOfflineFunctionLibrary.IsOnlineMode // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e21a0
};

// Class OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UOnlineSubsystemIcarusSessionFunctionLibrary : UBlueprintFunctionLibrary {

	void SendChatMessage(struct FIcarusChatMessage ChatMessage); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.SendChatMessage // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e6f40
	void ReqUpdateLobbyStatus(enum class ELobbyStatus LobbyStatus); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.ReqUpdateLobbyStatus // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9e6ae0
	void RequestConnectionString(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.RequestConnectionString // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9e6b50
	bool IsValidMatch(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.IsValidMatch // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e6720
	bool IsMatchHost(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.IsMatchHost // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e66f0
	bool IsConnectedIcarusBackend(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.IsConnectedIcarusBackend // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e66c0
	struct TMap<struct FName, struct FMatchMakingFilter> GetMatchFilters(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.GetMatchFilters // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e65f0
	struct FString GetIcarusPlayerId(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.GetIcarusPlayerId // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e6570
	struct FMatchUpdate GetCurrentMatch(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.GetCurrentMatch // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e63a0
	struct FConnectionString GetConnectionString(); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.GetConnectionString // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e6330
	struct FString GetAuthToken(int32_t LocalUserNum); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.GetAuthToken // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e6260
	void CancelMatchMaking(struct FName SessionName); // Function OnlineSubsystemIcarus.OnlineSubsystemIcarusSessionFunctionLibrary.CancelMatchMaking // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9e61e0
};

// Class OnlineSubsystemIcarus.PackageLoadoutCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UPackageLoadoutCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UPackageLoadoutCallbackProxyGen* PackageLoadout(struct FReqPackageLoadout Request); // Function OnlineSubsystemIcarus.PackageLoadoutCallbackProxyGen.PackageLoadout // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e6750
};

// Class OnlineSubsystemIcarus.ReadNotificationCallbackProxyGen
// Size: 0x70 (Inherited: 0x30)
struct UReadNotificationCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x20]; // 0x50(0x20)

	struct UReadNotificationCallbackProxyGen* ReadNotification(struct FReqReadNotification Request); // Function OnlineSubsystemIcarus.ReadNotificationCallbackProxyGen.ReadNotification // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e6800
};

// Class OnlineSubsystemIcarus.RemoveEnvirosuitCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct URemoveEnvirosuitCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct URemoveEnvirosuitCallbackProxyGen* RemoveEnvirosuit(struct FReqRemoveEnvirosuit Request); // Function OnlineSubsystemIcarus.RemoveEnvirosuitCallbackProxyGen.RemoveEnvirosuit // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e68c0
};

// Class OnlineSubsystemIcarus.RemoveMetaItemCallbackProxyGen
// Size: 0x70 (Inherited: 0x30)
struct URemoveMetaItemCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x20]; // 0x50(0x20)

	struct URemoveMetaItemCallbackProxyGen* RemoveMetaItem(struct FReqRemoveMetaInventoryItem Request); // Function OnlineSubsystemIcarus.RemoveMetaItemCallbackProxyGen.RemoveMetaItem // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e6970
};

// Class OnlineSubsystemIcarus.RemoveSelectedDropshipCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct URemoveSelectedDropshipCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct URemoveSelectedDropshipCallbackProxyGen* RemoveSelectedDropship(struct FReqRemoveSelectedDropship Request); // Function OnlineSubsystemIcarus.RemoveSelectedDropshipCallbackProxyGen.RemoveSelectedDropship // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e6a30
};

// Class OnlineSubsystemIcarus.ResetCharacterCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UResetCharacterCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UResetCharacterCallbackProxyGen* ResetCharacter(struct FReqResetCharacter Request); // Function OnlineSubsystemIcarus.ResetCharacterCallbackProxyGen.ResetCharacter // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e6b70
};

// Class OnlineSubsystemIcarus.ResetCharacterProspectStateCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UResetCharacterProspectStateCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UResetCharacterProspectStateCallbackProxyGen* ResetCharacterProspectState(struct FReqResetCharacterProspectState Request); // Function OnlineSubsystemIcarus.ResetCharacterProspectStateCallbackProxyGen.ResetCharacterProspectState // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e6c20
};

// Class OnlineSubsystemIcarus.ResumeProspectCallbackProxyGen
// Size: 0xa8 (Inherited: 0x30)
struct UResumeProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x58]; // 0x50(0x58)

	struct UResumeProspectCallbackProxyGen* ResumeProspect(struct FReqResumeProspect Request); // Function OnlineSubsystemIcarus.ResumeProspectCallbackProxyGen.ResumeProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e6cd0
};

// Class OnlineSubsystemIcarus.SelectDropshipCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct USelectDropshipCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct USelectDropshipCallbackProxyGen* SelectDropship(struct FReqSelectDropship Request); // Function OnlineSubsystemIcarus.SelectDropshipCallbackProxyGen.SelectDropship // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e6dd0
};

// Class OnlineSubsystemIcarus.SelectEnvirosuitCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct USelectEnvirosuitCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct USelectEnvirosuitCallbackProxyGen* SelectEnvirosuit(struct FReqSelectEnvirosuit Request); // Function OnlineSubsystemIcarus.SelectEnvirosuitCallbackProxyGen.SelectEnvirosuit // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e6e80
};

// Class OnlineSubsystemIcarus.SetResourceSplitCallbackProxyGen
// Size: 0x88 (Inherited: 0x30)
struct USetResourceSplitCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x38]; // 0x50(0x38)

	struct USetResourceSplitCallbackProxyGen* SetResourceSplit(struct FReqSetResourceSplit Request); // Function OnlineSubsystemIcarus.SetResourceSplitCallbackProxyGen.SetResourceSplit // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e7010
};

// Class OnlineSubsystemIcarus.SettleProspectCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct USettleProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct USettleProspectCallbackProxyGen* SettleProspect(struct FReqSettleProspect Request); // Function OnlineSubsystemIcarus.SettleProspectCallbackProxyGen.SettleProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e7110
};

// Class OnlineSubsystemIcarus.SyncTalentsCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct USyncTalentsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct USyncTalentsCallbackProxyGen* SyncTalents(struct FReqSyncTalents Request); // Function OnlineSubsystemIcarus.SyncTalentsCallbackProxyGen.SyncTalents // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e83b0
};

// Class OnlineSubsystemIcarus.UnlockCharacterFlagsCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UUnlockCharacterFlagsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UUnlockCharacterFlagsCallbackProxyGen* UnlockCharacterFlags(struct FReqUnlockCharacterFlags Request); // Function OnlineSubsystemIcarus.UnlockCharacterFlagsCallbackProxyGen.UnlockCharacterFlags // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e84a0
};

// Class OnlineSubsystemIcarus.UnpackageLoadoutCallbackProxyGen
// Size: 0x68 (Inherited: 0x30)
struct UUnpackageLoadoutCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x18]; // 0x50(0x18)

	struct UUnpackageLoadoutCallbackProxyGen* UnpackageLoadout(struct FReqUnpackageLoadout Request); // Function OnlineSubsystemIcarus.UnpackageLoadoutCallbackProxyGen.UnpackageLoadout // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e8550
};

// Class OnlineSubsystemIcarus.UpdateChallengeProgressCallbackProxyGen
// Size: 0x78 (Inherited: 0x30)
struct UUpdateChallengeProgressCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct UUpdateChallengeProgressCallbackProxyGen* UpdateChallengeProgress(struct FReqUpdateChallengeProgress Request); // Function OnlineSubsystemIcarus.UpdateChallengeProgressCallbackProxyGen.UpdateChallengeProgress // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e8600
};

// Class OnlineSubsystemIcarus.UpdateCharacterLoadoutCallbackProxyGen
// Size: 0x1a0 (Inherited: 0x30)
struct UUpdateCharacterLoadoutCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x150]; // 0x50(0x150)

	struct UUpdateCharacterLoadoutCallbackProxyGen* UpdateCharacterLoadout(struct FReqUpdateCharacterLoadout Request); // Function OnlineSubsystemIcarus.UpdateCharacterLoadoutCallbackProxyGen.UpdateCharacterLoadout // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e86c0
};

// Class OnlineSubsystemIcarus.UpdateCharacterProgressCallbackProxyGen
// Size: 0x98 (Inherited: 0x30)
struct UUpdateCharacterProgressCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x48]; // 0x50(0x48)

	struct UUpdateCharacterProgressCallbackProxyGen* UpdateCharacterProgress(struct FReqUpdateCharacterProgress Request); // Function OnlineSubsystemIcarus.UpdateCharacterProgressCallbackProxyGen.UpdateCharacterProgress // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e8780
};

// Class OnlineSubsystemIcarus.UpdateCosmeticsCallbackProxyGen
// Size: 0x130 (Inherited: 0x30)
struct UUpdateCosmeticsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0xe0]; // 0x50(0xe0)

	struct UUpdateCosmeticsCallbackProxyGen* UpdateCosmetics(struct FReqUpdateCosmetics Request); // Function OnlineSubsystemIcarus.UpdateCosmeticsCallbackProxyGen.UpdateCosmetics // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e8870
};

// Class OnlineSubsystemIcarus.UpdateFactionMissionProgressCallbackProxyGen
// Size: 0x90 (Inherited: 0x30)
struct UUpdateFactionMissionProgressCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x40]; // 0x50(0x40)

	struct UUpdateFactionMissionProgressCallbackProxyGen* UpdateFactionMissionProgress(struct FReqUpdateFactionMissionProgress Request); // Function OnlineSubsystemIcarus.UpdateFactionMissionProgressCallbackProxyGen.UpdateFactionMissionProgress // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e8a50
};

// Class OnlineSubsystemIcarus.UpdateProspectCallbackProxyGen
// Size: 0xb8 (Inherited: 0x30)
struct UUpdateProspectCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x68]; // 0x50(0x68)

	struct UUpdateProspectCallbackProxyGen* UpdateProspect(struct FReqUpdateProspect Request); // Function OnlineSubsystemIcarus.UpdateProspectCallbackProxyGen.UpdateProspect // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e8b30
};

// Class OnlineSubsystemIcarus.UpdateTrackedStatsCallbackProxyGen
// Size: 0x88 (Inherited: 0x30)
struct UUpdateTrackedStatsCallbackProxyGen : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	char pad_50[0x38]; // 0x50(0x38)

	struct UUpdateTrackedStatsCallbackProxyGen* UpdateTrackedStats(struct FReqUpdateTrackedStats Request); // Function OnlineSubsystemIcarus.UpdateTrackedStatsCallbackProxyGen.UpdateTrackedStats // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9e8c40
};

