// UserDefinedStruct RadarV3ScanData.RadarV3ScanData
// Size: 0x28 (Inherited: 0x00)
struct FRadarV3ScanData {
	struct FVector Location_2_1234265D4D70EF2FDCFE7385A4201114; // 0x00(0x0c)
	float SizeInKM_5_CAAB00AA40191EC6B5D044A83D116506; // 0x0c(0x04)
	float Direction_14_BEB94AB0441C27CF3F0BDF955D12792B; // 0x10(0x04)
	float ArcLengthInPercent_16_65E0BAFD4F1436FDE4DFBEA54CFA9D26; // 0x14(0x04)
	float RandomOffset_19_9F28C00E4E173B93580BDE8C962847C8; // 0x18(0x04)
	float Distance_21_84F3A08D43B87029913183B5BB20119F; // 0x1c(0x04)
	float Intensity_7_A021D8EF4C249091495ACE8CB856C3F3; // 0x20(0x04)
	int32_t UID_10_7CC09B5C4ABA02C74E2CA98B21EF1C84; // 0x24(0x04)
};

