// ControlRigBlueprintGeneratedClass SK-Wolf_CtrlRig.SK-Wolf_CtrlRig_C
// Size: 0x688 (Inherited: 0x650)
struct USK-Wolf_CtrlRig_C : UControlRig {
	struct FVector Trace_Length; // 0x650(0x0c)
	float FloorRH; // 0x65c(0x04)
	float FloorLH; // 0x660(0x04)
	float FloorLF; // 0x664(0x04)
	float FloorRF; // 0x668(0x04)
	float Trace_Offset; // 0x66c(0x04)
	float Pelvis_Speed_Inc; // 0x670(0x04)
	float Pelvis_Speed_Dec; // 0x674(0x04)
	struct FName Pelvis_Bone; // 0x678(0x08)
	struct FName Root_Bone; // 0x680(0x08)
};

