// WidgetBlueprintGeneratedClass UMG_HealthBar.UMG_HealthBar_C
// Size: 0x2a0 (Inherited: 0x260)
struct UUMG_HealthBar_C : UUserWidget {
	struct UProgressBar* BaseHealthBar; // 0x260(0x08)
	struct UProgressBar* Food1HealthBar; // 0x268(0x08)
	struct UProgressBar* Food2HealthBar; // 0x270(0x08)
	struct UProgressBar* Food3HealthBar_3; // 0x278(0x08)
	struct UImage* ShelterIcon; // 0x280(0x08)
	struct UUMG_ModifierState_C* UMG_ModifierState; // 0x288(0x08)
	struct UUMG_ModifierState_C* UMG_ModifierState_2; // 0x290(0x08)
	struct UUMG_ModifierState_C* UMG_ModifierState_3; // 0x298(0x08)
};

