// WidgetBlueprintGeneratedClass UMG_IntroTips_Space.UMG_IntroTips_Space_C
// Size: 0x308 (Inherited: 0x260)
struct UUMG_IntroTips_Space_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* Initialize; // 0x268(0x08)
	struct UWidgetAnimation* RevealGoals; // 0x270(0x08)
	struct UImage* Dot1; // 0x278(0x08)
	struct UImage* Dot1_2; // 0x280(0x08)
	struct UImage* Dot2; // 0x288(0x08)
	struct UImage* Dot2_2; // 0x290(0x08)
	struct UImage* Dot3; // 0x298(0x08)
	struct UImage* Dot3_2; // 0x2a0(0x08)
	struct UImage* Dot4; // 0x2a8(0x08)
	struct UImage* Dot4_2; // 0x2b0(0x08)
	struct UImage* Dot5; // 0x2b8(0x08)
	struct UImage* Dot5_2; // 0x2c0(0x08)
	struct UImage* Image; // 0x2c8(0x08)
	struct UImage* Image_2; // 0x2d0(0x08)
	struct UImage* Image_3; // 0x2d8(0x08)
	struct UImage* Image_610; // 0x2e0(0x08)
	struct UImage* Picture; // 0x2e8(0x08)
	struct UImage* Picture_2; // 0x2f0(0x08)
	struct UImage* Picture_3; // 0x2f8(0x08)
	struct UUMG_BasicButton_2_C* UMG_BasicButton_3; // 0x300(0x08)

	void Finished_4D461BEF47EF084053E66D886BC85A33(); // Function UMG_IntroTips_Space.UMG_IntroTips_Space_C.Finished_4D461BEF47EF084053E66D886BC85A33 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void OpenAnim(); // Function UMG_IntroTips_Space.UMG_IntroTips_Space_C.OpenAnim // (BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void BndEvt__UMG_BasicButton_2_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature(struct UUMG_ButtonBase_C* Button); // Function UMG_IntroTips_Space.UMG_IntroTips_Space_C.BndEvt__UMG_BasicButton_2_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature // (BlueprintEvent) // @ game+0x1a38c80
	void ExecuteUbergraph_UMG_IntroTips_Space(int32_t EntryPoint); // Function UMG_IntroTips_Space.UMG_IntroTips_Space_C.ExecuteUbergraph_UMG_IntroTips_Space // (Final|UbergraphFunction) // @ game+0x1a38c80
};

