// WidgetBlueprintGeneratedClass UMG_Talent_ComingSoon.UMG_Talent_ComingSoon_C
// Size: 0x2b0 (Inherited: 0x260)
struct UUMG_Talent_ComingSoon_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* Reveal; // 0x268(0x08)
	struct UBorder* Border_46; // 0x270(0x08)
	struct UImage* ClockIcon; // 0x278(0x08)
	struct UButton* HoverArea; // 0x280(0x08)
	struct UBorder* TextBorder; // 0x288(0x08)
	struct FLinearColor HoveredColor; // 0x290(0x10)
	struct FLinearColor UnhoveredColor; // 0x2a0(0x10)

	void PreConstruct(bool IsDesignTime); // Function UMG_Talent_ComingSoon.UMG_Talent_ComingSoon_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1a38c80
	void BndEvt__HoverArea_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function UMG_Talent_ComingSoon.UMG_Talent_ComingSoon_C.BndEvt__HoverArea_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1a38c80
	void BndEvt__HoverArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function UMG_Talent_ComingSoon.UMG_Talent_ComingSoon_C.BndEvt__HoverArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1a38c80
	void ExecuteUbergraph_UMG_Talent_ComingSoon(int32_t EntryPoint); // Function UMG_Talent_ComingSoon.UMG_Talent_ComingSoon_C.ExecuteUbergraph_UMG_Talent_ComingSoon // (Final|UbergraphFunction|HasDefaults) // @ game+0x1a38c80
};

