// WidgetBlueprintGeneratedClass UMG_MissingRequirement_Warning.UMG_MissingRequirement_Warning_C
// Size: 0x2b0 (Inherited: 0x260)
struct UUMG_MissingRequirement_Warning_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* Warning; // 0x268(0x08)
	struct UImage* corner; // 0x270(0x08)
	struct UImage* corner_2; // 0x278(0x08)
	struct UImage* corner_3; // 0x280(0x08)
	struct UImage* corner_4; // 0x288(0x08)
	struct UTextBlock* WarningTextBox; // 0x290(0x08)
	struct FText WarningText; // 0x298(0x18)

	void Construct(); // Function UMG_MissingRequirement_Warning.UMG_MissingRequirement_Warning_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1a38c80
	void FireWarning(); // Function UMG_MissingRequirement_Warning.UMG_MissingRequirement_Warning_C.FireWarning // (BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void ExecuteUbergraph_UMG_MissingRequirement_Warning(int32_t EntryPoint); // Function UMG_MissingRequirement_Warning.UMG_MissingRequirement_Warning_C.ExecuteUbergraph_UMG_MissingRequirement_Warning // (Final|UbergraphFunction) // @ game+0x1a38c80
};

