// WidgetBlueprintGeneratedClass UMG_UserInterface.UMG_UserInterface_C
// Size: 0x611 (Inherited: 0x388)
struct UUMG_UserInterface_C : UUMG_UserInterface_Base_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x388(0x08)
	struct UUMG_CraftingProgressbar_C* ActionableHoldProgressBar; // 0x390(0x08)
	struct UTextBlock* BaseStatTextBlock; // 0x398(0x08)
	struct UImage* ClockIcon; // 0x3a0(0x08)
	struct UImage* ClockIcon_2; // 0x3a8(0x08)
	struct UImage* ClockIcon_3; // 0x3b0(0x08)
	struct UImage* ClockIcon_4; // 0x3b8(0x08)
	struct UScaleBox* ConfirmationScaleBox; // 0x3c0(0x08)
	struct UUMG_ContextImage_C* ContextTarget; // 0x3c8(0x08)
	struct UTextBlock* CurrentBiome; // 0x3d0(0x08)
	struct UTextBlock* CurrentTime; // 0x3d8(0x08)
	struct USizeBox* CursorItemSize; // 0x3e0(0x08)
	struct UScaleBox* CursorScaleBox; // 0x3e8(0x08)
	struct UCanvasPanel* DamageNumbers; // 0x3f0(0x08)
	struct UCanvasPanel* Debug; // 0x3f8(0x08)
	struct UTextBlock* EnviromentalTemp; // 0x400(0x08)
	struct URetainerBox* EnvironmentInfoBox; // 0x408(0x08)
	struct UBorder* EnvTemp; // 0x410(0x08)
	struct USizeBox* FactionMissionBox; // 0x418(0x08)
	struct UTextBlock* GameVersionNumber; // 0x420(0x08)
	struct UScaleBox* HoldActionableContainer; // 0x428(0x08)
	struct UOverlay* HUD; // 0x430(0x08)
	struct URetainerBox* InteractionPrompt; // 0x438(0x08)
	struct UBorder* InteractionPromptContainer; // 0x440(0x08)
	struct URetainerBox* LevelupBox; // 0x448(0x08)
	struct UScaleBox* MainScaleBox; // 0x450(0x08)
	struct USizeBox* MainSize; // 0x458(0x08)
	struct UHorizontalBox* MapDate; // 0x460(0x08)
	struct UOverlay* Menus; // 0x468(0x08)
	struct URetainerBox* MissionTimer; // 0x470(0x08)
	struct UTextBlock* OutOfDateText; // 0x478(0x08)
	struct UNamedSlot* RadialMenuSlot; // 0x480(0x08)
	struct UScaleBox* RadialScaleBox; // 0x488(0x08)
	struct UBorder* StatDebugger; // 0x490(0x08)
	struct URetainerBox* SurvivalRetainer; // 0x498(0x08)
	struct UScaleBox* TempMouseWidgetScaleBox; // 0x4a0(0x08)
	struct UUMG_BuildControls_C* UMG_BuildControls; // 0x4a8(0x08)
	struct UUMG_ChallengeCompleted_C* UMG_ChallengeCompleted; // 0x4b0(0x08)
	struct UUMG_Chatbox_C* UMG_Chatbox; // 0x4b8(0x08)
	struct UUMG_ConfirmationPopup_C* UMG_ConfirmationPopup; // 0x4c0(0x08)
	struct UUMG_ConnectionLost_C* UMG_ConnectionLost; // 0x4c8(0x08)
	struct UUMG_CursorWidget_C* UMG_CursorWidget; // 0x4d0(0x08)
	struct UUMG_DeathScreen_C* UMG_DeathScreen; // 0x4d8(0x08)
	struct UUMG_EncumbranceBar_C* UMG_EncumbranceBar; // 0x4e0(0x08)
	struct UUMG_EscapeMenu_C* UMG_EscapeMenu; // 0x4e8(0x08)
	struct UUMG_ExperienceNotifier_C* UMG_ExperienceNotifier; // 0x4f0(0x08)
	struct UUMG_ExperienceTracker_C* UMG_ExperienceTracker; // 0x4f8(0x08)
	struct UUMG_ExposureDisplay_C* UMG_ExposureDisplay; // 0x500(0x08)
	struct UUMG_FocusedItemInfo_C* UMG_FocusedItemInfo; // 0x508(0x08)
	struct UUMG_GameMessageContainer_C* UMG_GameMessageContainer; // 0x510(0x08)
	struct UUMG_RecipeElementTooltip_C* UMG_HolographicPreview; // 0x518(0x08)
	struct UUMG_Hotbar_C* UMG_Hotbar; // 0x520(0x08)
	struct UIcarusCompassWidget_C* UMG_IcarusCompassWidget; // 0x528(0x08)
	struct UUMG_InteractionPrompt_C* UMG_InteractionPrompt; // 0x530(0x08)
	struct UUMG_Levelup_C* UMG_Levelup; // 0x538(0x08)
	struct UUMG_MainMenu_C* UMG_MainMenu; // 0x540(0x08)
	struct UUMG_MissionTimer_C* UMG_MissionTimer; // 0x548(0x08)
	struct UUMG_ModifierStateContainer_C* UMG_ModifierStateContainer; // 0x550(0x08)
	struct UUMG_OutOfBounds_C* UMG_OutOfBounds; // 0x558(0x08)
	struct UUMG_QuestObjectiveList_C* UMG_QuestObjectiveList; // 0x560(0x08)
	struct UUMG_QuickCrafting_C* UMG_QuickCrafting; // 0x568(0x08)
	struct UUMG_ResourcePromptDisplay_C* UMG_ResourcePromptDisplay; // 0x570(0x08)
	struct UUMG_SleepScreen_C* UMG_SleepScreen; // 0x578(0x08)
	struct UUMG_Stamina_C* UMG_Stamina; // 0x580(0x08)
	struct UUMG_Stealth_C* UMG_Stealth; // 0x588(0x08)
	struct UUMG_Survival_C* UMG_Survival; // 0x590(0x08)
	struct UUMG_WarningContainer_C* UMG_WarningContainer; // 0x598(0x08)
	struct UUMG_WeatherEventCard_2_C* UMG_WeatherEventCard_3; // 0x5a0(0x08)
	struct UUMG_WeatherEventTimeline_C* UMG_WeatherEventTimeline_118; // 0x5a8(0x08)
	struct UUMG_WeatherWarning_C* UMG_WeatherWarning; // 0x5b0(0x08)
	struct UHorizontalBox* Version; // 0x5b8(0x08)
	struct UTextBlock* VirtualStatTextBlock; // 0x5c0(0x08)
	struct UW_ProjectionInterface_C* W_ProjectionInterface; // 0x5c8(0x08)
	struct ABP_IcarusPlayerControllerSurvival_C* PlayerController; // 0x5d0(0x08)
	struct UUserWidget* CurrentDynamicWidget; // 0x5d8(0x08)
	bool VerboseStatDebugging; // 0x5e0(0x01)
	char pad_5E1[0x7]; // 0x5e1(0x07)
	struct ABP_AtmosphereController_C* AtmoContRef; // 0x5e8(0x08)
	struct AIcarusItem* Focused Item; // 0x5f0(0x08)
	struct UPlayerCharacterState* PlayerCharacterState; // 0x5f8(0x08)
	struct FMulticastInlineDelegate OnMenuOpened; // 0x600(0x10)
	enum class EMainMenuOptions LastShownMenu; // 0x610(0x01)

	void Is Showing Confirmation Prompt(bool ShowingConfirmation); // Function UMG_UserInterface.UMG_UserInterface_C.Is Showing Confirmation Prompt // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1a38c80
	void TryChangeToMenu(enum class EMainMenuOptions MenuType); // Function UMG_UserInterface.UMG_UserInterface_C.TryChangeToMenu // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void ToggleMenus(); // Function UMG_UserInterface.UMG_UserInterface_C.ToggleMenus // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void Show Game Message(bool Error, struct FText Message, float LifeTimeOverride); // Function UMG_UserInterface.UMG_UserInterface_C.Show Game Message // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void HideLoadingScreen(); // Function UMG_UserInterface.UMG_UserInterface_C.HideLoadingScreen // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void ShowLoadingScreen(struct FText Optional Message); // Function UMG_UserInterface.UMG_UserInterface_C.ShowLoadingScreen // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void RemoveRadialMenu(struct UUserWidget* RadialMenu); // Function UMG_UserInterface.UMG_UserInterface_C.RemoveRadialMenu // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void IsShowingRadialMenu(bool ShowingRadialMenu); // Function UMG_UserInterface.UMG_UserInterface_C.IsShowingRadialMenu // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1a38c80
	void AddRadialMenu(struct UUserWidget* RadialMenu); // Function UMG_UserInterface.UMG_UserInterface_C.AddRadialMenu // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void OnLocalWeatherUpdated(struct FWeatherEventsRowHandle NewEvent); // Function UMG_UserInterface.UMG_UserInterface_C.OnLocalWeatherUpdated // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void WeatherTimelineShowLogic(); // Function UMG_UserInterface.UMG_UserInterface_C.WeatherTimelineShowLogic // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void HideWeatherTimeline(); // Function UMG_UserInterface.UMG_UserInterface_C.HideWeatherTimeline // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void ShowWeatherTimeline(); // Function UMG_UserInterface.UMG_UserInterface_C.ShowWeatherTimeline // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void TickStatDebug(); // Function UMG_UserInterface.UMG_UserInterface_C.TickStatDebug // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void TickActionableHold(); // Function UMG_UserInterface.UMG_UserInterface_C.TickActionableHold // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void EscapeKeyPressed(); // Function UMG_UserInterface.UMG_UserInterface_C.EscapeKeyPressed // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	enum class ESlateVisibility Get_QuestObjectiveBox_Visibility_1(); // Function UMG_UserInterface.UMG_UserInterface_C.Get_QuestObjectiveBox_Visibility_1 // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1a38c80
	void OpenEscapeMenu(); // Function UMG_UserInterface.UMG_UserInterface_C.OpenEscapeMenu // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void IsMenuVisible(bool Visible); // Function UMG_UserInterface.UMG_UserInterface_C.IsMenuVisible // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void HideWeatherWarningUI(); // Function UMG_UserInterface.UMG_UserInterface_C.HideWeatherWarningUI // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void ShowWeatherWarningUI(struct FText WarningMessage); // Function UMG_UserInterface.UMG_UserInterface_C.ShowWeatherWarningUI // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void UpdateBuildingHelper(struct AIcarusItem* FocusedItem); // Function UMG_UserInterface.UMG_UserInterface_C.UpdateBuildingHelper // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	struct UW_ProjectionInterface_C* GetProjectionInterface(); // Function UMG_UserInterface.UMG_UserInterface_C.GetProjectionInterface // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1a38c80
	void GetConfirmationWindow(struct UUMG_ConfirmationPopup_C* ConfirmationWidget); // Function UMG_UserInterface.UMG_UserInterface_C.GetConfirmationWindow // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1a38c80
	struct FText GetCurrentTime(); // Function UMG_UserInterface.UMG_UserInterface_C.GetCurrentTime // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1a38c80
	void ShowMainMenu(bool AllowWhileDead, bool Success); // Function UMG_UserInterface.UMG_UserInterface_C.ShowMainMenu // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void IsShowingStaticWidget(bool CheckCheatOverlay, bool Menu Open); // Function UMG_UserInterface.UMG_UserInterface_C.IsShowingStaticWidget // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	struct FText GetBiome(); // Function UMG_UserInterface.UMG_UserInterface_C.GetBiome // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1a38c80
	struct FText GetEnviromentTemp(); // Function UMG_UserInterface.UMG_UserInterface_C.GetEnviromentTemp // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1a38c80
	struct FEventReply OnKeyUp(struct FGeometry MyGeometry, struct FKeyEvent InKeyEvent); // Function UMG_UserInterface.UMG_UserInterface_C.OnKeyUp // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void GetCursorWidget(struct UUMG_CursorWidget_C* CursorWidget); // Function UMG_UserInterface.UMG_UserInterface_C.GetCursorWidget // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1a38c80
	void FocusStaticWidget(enum class EStaticUIWidgets Panel); // Function UMG_UserInterface.UMG_UserInterface_C.FocusStaticWidget // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void HidePanelDisplay(); // Function UMG_UserInterface.UMG_UserInterface_C.HidePanelDisplay // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void Reset(); // Function UMG_UserInterface.UMG_UserInterface_C.Reset // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void ScaleWidget(struct UScaleBox* ScaleBox); // Function UMG_UserInterface.UMG_UserInterface_C.ScaleWidget // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void SetPlayerDead(bool Dead); // Function UMG_UserInterface.UMG_UserInterface_C.SetPlayerDead // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void GetDropEndTime(); // Function UMG_UserInterface.UMG_UserInterface_C.GetDropEndTime // (Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1a38c80
	void ToggleVerboseStatDebugging(); // Function UMG_UserInterface.UMG_UserInterface_C.ToggleVerboseStatDebugging // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void ToggleStatDebugger(); // Function UMG_UserInterface.UMG_UserInterface_C.ToggleStatDebugger // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	struct FText GetPlayerVirtualStats(); // Function UMG_UserInterface.UMG_UserInterface_C.GetPlayerVirtualStats // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1a38c80
	struct FText GetPlayerBaseStats(); // Function UMG_UserInterface.UMG_UserInterface_C.GetPlayerBaseStats // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1a38c80
	void UpdatePlayerHighlighting(bool Active); // Function UMG_UserInterface.UMG_UserInterface_C.UpdatePlayerHighlighting // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void HideStaticWidgets(); // Function UMG_UserInterface.UMG_UserInterface_C.HideStaticWidgets // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void FocusDynamicWidget(struct UUserWidget* DynamicWidget); // Function UMG_UserInterface.UMG_UserInterface_C.FocusDynamicWidget // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void SetHUDVisibility(bool Visible); // Function UMG_UserInterface.UMG_UserInterface_C.SetHUDVisibility // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void ShowEscapeMenu(); // Function UMG_UserInterface.UMG_UserInterface_C.ShowEscapeMenu // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	struct FEventReply OnMouseButtonUp(struct FGeometry MyGeometry, struct FPointerEvent MouseEvent); // Function UMG_UserInterface.UMG_UserInterface_C.OnMouseButtonUp // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void Initialise(struct ABP_IcarusPlayerControllerSurvival_C* Controller, struct UInventory* MainInventory, struct UInventory* HotbarInventory, struct UInventory* EnvirosuitInventory, struct UInventory* EquipInventory, struct UInventory* UpgradeInventory, struct UInventory* VisionInventory); // Function UMG_UserInterface.UMG_UserInterface_C.Initialise // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function UMG_UserInterface.UMG_UserInterface_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1a38c80
	void Construct(); // Function UMG_UserInterface.UMG_UserInterface_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1a38c80
	void ToggleInventory(); // Function UMG_UserInterface.UMG_UserInterface_C.ToggleInventory // (BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void TogglePlayerCrafting(); // Function UMG_UserInterface.UMG_UserInterface_C.TogglePlayerCrafting // (BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void TogglePlayerTechTree(); // Function UMG_UserInterface.UMG_UserInterface_C.TogglePlayerTechTree // (BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void ToggleMap(); // Function UMG_UserInterface.UMG_UserInterface_C.ToggleMap // (BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void UpdateStealth(bool bIsCrouched); // Function UMG_UserInterface.UMG_UserInterface_C.UpdateStealth // (BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void AttachedSeatChanged(); // Function UMG_UserInterface.UMG_UserInterface_C.AttachedSeatChanged // (BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
	void ExecuteUbergraph_UMG_UserInterface(int32_t EntryPoint); // Function UMG_UserInterface.UMG_UserInterface_C.ExecuteUbergraph_UMG_UserInterface // (Final|UbergraphFunction|HasDefaults) // @ game+0x1a38c80
	void OnMenuOpened__DelegateSignature(); // Function UMG_UserInterface.UMG_UserInterface_C.OnMenuOpened__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x1a38c80
};

